{
  "responseHeader":{
    "status":0,
    "QTime":3,
    "params":{
      "q":"{!parent which='-_nest_path_:* genres:History !genres:fiction description:\"world war\"'}",
      "indent":"true",
      "q.op":"AND",
      "fq":"publishYear: [2005 TO 2010]",
      "rows":"30"}},
  "response":{"numFound":267,"start":0,"numFoundExact":true,"docs":[
      {
        "id":"600093",
        "name":"Guardians of the Nation: Activists on the Language Frontiers of Imperial Austria",
        "rating":4.2,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":1,
        "publisher":"Harvard University Press",
        "countsOfReviews":5,
        "pagesNumber":313,
        "description":" In the decades leading up to World War I, nationalist activists in imperial Austria labored to transform linguistically mixed rural regions into politically charged language frontiers. They hoped to remake local populations into polarized peoples and their villages into focal points of the political conflict that dominated the Habsburg Empire. But they often found bilingual inhabitants accustomed to cultural mixing who were stubbornly indifferent to identifying with only one group.  Using examples from several regions, including Bohemia and Styria, Pieter Judson traces the struggle to consolidate the loyalty of local populations for nationalist causes. Whether German, Czech, Italian, or Slovene, the nationalists faced similar and unexpected difficulties in their struggle to make nationalism relevant to local concerns and to bind people permanently to one side. Judson examines the various strategies of the nationalist activists, from the founding of minority language schools to the importation of colonists from other regions, from projects to modernize rural economies to the creation of a tourism industry. By 1914, they succeeded in projecting a public perception of nationalist frontiers, but largely failed to nationalize the populations.  Guardians of the Nation offers a provocative challenge to standard accounts of the march of nationalism in modern Europe.  (20070901)",
        "author":"Pieter M. Judson",
        "language":"English",
        "genres":["History,Politics"],
        "ISBN":"0674023250",
        "domainType":"book",
        "_version_":1718686142765727744},
      {
        "id":"606502",
        "name":"Running the World: The Inside Story of the National Security Council and the Architects of American Power",
        "rating":3.89,
        "publishYear":2006,
        "publishMonth":11,
        "publishDay":7,
        "publisher":"PublicAffairs",
        "countsOfReviews":1,
        "pagesNumber":576,
        "description":"Never before in the history of mankind have so few people had so much power over so many. The people at the top of the American national security establishment, the President and his principal advisors, the core team at the helm of the National Security Council, are without question the most powerful committee in the history of the world.Yet, in many respects, they are among the least understood. A former senior official in the Clinton Administration himself, David Rothkopf served with and knows personally many of the NSC's key players of the past twenty-five years. In Running the World he pulls back the curtain on this shadowy world to explore its inner workings, its people, their relationships, their contributions and the occasions when they have gone wrong. He traces the group's evolution from the final days of the Second World War to the post-Cold War realities of global terror—exploring its triumphs, its human dramas and most recently, what many consider to be its breakdown at a time when we needed it most.Drawing on an extraordinary series of insider interviews with policy makers including Condoleezza Rice, Colin Powell, Henry Kissinger, senior officials of the Bush Administration, and over 130 others, the book offers unprecedented insights into what must change if America is to maintain its unprecedented worldwide leadership in the decades ahead.",
        "author":"David Rothkopf",
        "language":"English",
        "genres":["Politics,History,Nonfiction,International Relations"],
        "ISBN":"1586484230",
        "domainType":"book",
        "_version_":1718686147957227522},
      {
        "id":"607268",
        "name":"The Gold Star Mother Pilgrimages of the 1930s: Overseas Grave Visitations by Mothers and Widows of Fallen U.S. World War I Soldiers",
        "rating":4.11,
        "publishYear":2005,
        "publishMonth":11,
        "publishDay":5,
        "publisher":"McFarland & Company",
        "countsOfReviews":2,
        "pagesNumber":229,
        "description":"During the first World War, a flag with a gold star identified families who had lost soldiers. Grieving women were \"Gold Star\" mothers and widows. Between 1930 and 1933, the United States government took 6,654 Gold Star pilgrims to visit their sons' and husbands' graves in American cemeteries in Belgium, England, and France. Veteran Army officers acted as tour guides, helping women come to terms with their losses as they sought solace and closure. The government meticulously planned and paid for everything from transportation and lodging to menus, tips, sightseeing, and interpreters. Flowered wreaths, flags, and camp chairs were provided at the cemeteries, and official photographers captured each woman standing at her loved one's grave. This work covers the Gold Star pilgrimages from their launch to the present day, beginning with an introduction to the war and wartime burial. Subsequent topics include the legislative struggle and evolution of the pilgrimage bill; personal pilgrimages, including that of the parents of poet Joyce Kilmer; the role of the Quartermaster Corps; the segregation controversy; a close examination of the first group to travel, Party A of May 1930; and the results of the pilgrimage experience as described by participants, observers, organizers, and scholars, researched through diaries, letters, scrapbooks, interviews, and newspaper accounts.",
        "author":"John W. Graham",
        "language":"English",
        "genres":["History,Nonfiction"],
        "ISBN":"078642138X",
        "domainType":"book",
        "_version_":1718686148414406656},
      {
        "id":"609311",
        "name":"Heinrich Himmler: The Sinister Life of the Head of the SS and Gestapo",
        "rating":3.68,
        "publishYear":2007,
        "publishMonth":17,
        "publishDay":9,
        "publisher":"Skyhorse",
        "countsOfReviews":33,
        "pagesNumber":285,
        "description":"Authors Roger Manvell and Heinrich Fraenkel, notable biographers of the World War II German leaders Joseph Goebbels and Herman Goring, delve into the life of one of the most sinister, clever, and successful of all the Nazi leaders: Heinrich Himmler. As the head of the feared SS, Himler supervised the extermination of millions. Here is the story of how a seemingly ordinary boy grew into an obsessive and superstitious man who ventured into herbalism, astrology, and homeopathic medicine before finally turning to the \"science\" of racial purity and the belief in the superiority of the Aryan people.",
        "author":"Roger Manvell",
        "language":"English",
        "genres":["History,Biography,Nonfiction,World War II"],
        "ISBN":"1602391785",
        "domainType":"book",
        "_version_":1718686149501779968},
      {
        "id":"610017",
        "name":"OSS: The Secret History of America's First Central Intelligence Agency",
        "rating":3.56,
        "publishYear":2005,
        "publishMonth":1,
        "publishDay":8,
        "publisher":"Lyons Press",
        "countsOfReviews":8,
        "pagesNumber":456,
        "description":"“The best book about America’s first modern secret service.”--Washington Post Book WorldIn the months before World War II, FDR prepared the country for conflict with Germany and Japan by reshuffling various government agencies to create the Office of Strategic Services--America’s first intelligence agency and the direct precursor to the CIA. When he charged William (“Wild Bill”) Donovan, a successful Wall Street lawyer and Wilkie Republican, to head up the office, the die was set for some of the most fantastic and fascinating operations the U.S. government has ever conducted. Author Richard Harris Smith, himself an ex-CIA hand, documents the controversial agency from its conception as a spin-off of the Office of the Coordinator for Information to its demise under Harry Truman and reconfiguration as the CIA. During his tenure, Donovan oversaw a chaotic cast of some ten thousand agents drawn from the most conservative financial scions to the country’s most idealistic New Deal true believers. Together they usurped the roles of government agencies both foreign and domestic, concocted unbelievably complicated conspiracies, and fought the good fight against the Axis powers of Germany and Japan. For example, when OSS operatives stole vital military codebooks from the Japanese embassy in Portugal, the operation was considered a success. But the success turned into a flop as the Japanese discovered what had happened, and hastilychanged a code that had already been decrypted by the U.S. Navy. Colorful personalities and truly priceless anecdotes abound in what mayarguably be called the most authoritative work on the subject.",
        "author":"Richard Harris Smith",
        "language":"English",
        "genres":["History,World War II,Espionage,Nonfiction"],
        "ISBN":"1592287298",
        "domainType":"book",
        "_version_":1718686149885558784},
      {
        "id":"610027",
        "name":"The OSS and Ho Chi Minh: Unexpected Allies in the War Against Japan (Modern War Studies)",
        "rating":4.37,
        "publishYear":2006,
        "publishMonth":12,
        "publishDay":5,
        "publisher":"University Press of Kansas",
        "countsOfReviews":1,
        "pagesNumber":435,
        "description":"Some will be shocked to find out that the United States and Ho Chi Minh, our nemesis for much of the Vietnam War, were once allies. Indeed, during the last year of World War II, American spies in Indochina found themselves working closely with Ho Chi Minh and other anti-colonial factions-compelled by circumstances to fight together against the Japanese. Dixee Bartholomew-Feis reveals how this relationship emerged and operated and how it impacted Vietnam's struggle for independence. The men of General William Donovan's newly-formed Office of Strategic Services closely collaborated with communist groups in both Europe and Asia against the Axis enemies. In Vietnam, this meant that OSS officers worked with Ho Chi Minh and the Viet Minh, whose ultimate aim was to rid the region of all imperialist powers, not just the Japanese. Ho, for his part, did whatever he could to encourage the OSS's negative view of the French, who were desperate to regain their colony. Revealing details not previously known about their covert operations, Bartholomew-Feis chronicles the exploits of these allies as they developed their network of informants, sabotaged the Japanese occupation's infrastructure, conducted guerrilla operations, and searched for downed American fliers and Allied POWs. Although the OSS did not bring Ho Chi Minh to power, Bartholomew-Feis shows that its apparent support for the Viet Minh played a significant symbolic role in helping them fill the power vacuum left in the wake of Japan's surrender. Her study also hints that, had America continued to champion the anti-colonials and their quest for independence, rather than caving in to the French, we might have been spared our long and very lethal war in Vietnam. Based partly on interviews with surviving OSS agents who served in Vietnam, Bartholomew-Feis's engaging narrative and compelling insights speak to the yearnings of an oppressed people-and remind us that history does indeed make strange bedfellows.",
        "author":"Dixee R. Bartholomew-Feis",
        "language":"English",
        "genres":["History"],
        "ISBN":"0700614311",
        "domainType":"book",
        "_version_":1718686149893947393},
      {
        "id":"613500",
        "name":"Pacific Warriors: The U.S. Marines in World War II: A Pictorial Tribute",
        "rating":3.95,
        "publishYear":2005,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Zenith Press",
        "countsOfReviews":1,
        "pagesNumber":256,
        "description":"FROM THE HALLS OF MONTEZUMA to the shores of Tripoli, as the Marine Corps Hymn relates, and more recently in the epic battle of the Chosin Reservoir in Korea and the siege of Hue City in Vietnam, America’s “soldiers of the sea” have fought their country’s baffles around the world for more than two centuries. From Belleau Wood in the Great War to the killing fields of Iraq, the fighting Leathernecks have been known for their valorous spirit—their ability to persevere in the face of nearly any odds. The U.S. Marines earned their reputation of being the “First to Fight” on the South Pacific island of Guadalcanal, when on August 7, 1942, the 1st Marine Division stormed ashore to begin one of the most difficult and brutal campaigns of recent military history. This was just the first of an unbroken string of a dozen island victories across the Pacific: up the Solomons from Guadalcanal, on westward in 1943 from Tarawa in the central Pacific, and the climactic Western Pacific campaigns of 1945 on Iwo Jima and Okinawa. Pacific Warriors covers all of the legendary Marine battles of the Pacific War in a tribute to the men who led the way against Japan. It also provides the reader with a look at the prewar Marine Corps and its remarkable base force to a full six divisions along with a modern Marine Corps air force. The rise and development of modern amphibious doctrine and training going back to the end of the nineteenth century are an important part of the story and receive detailed coverage. Combined with nearly three hundred photographs—many never before published—and detailed captions, plus seventeen maps commissioned especially for this volume, the expert text by critically acclaimed military historian Eric Hammel will serve as a lasting tribute to the United States Marines of World War II.",
        "author":"Eric Hammel",
        "language":"English",
        "genres":["History"],
        "ISBN":"0760320977",
        "domainType":"book",
        "_version_":1718686151130218496},
      {
        "id":"615400",
        "name":"Over Here: How the G.I. Bill Transformed the American Dream",
        "rating":4.1,
        "publishYear":2006,
        "publishMonth":2,
        "publishDay":10,
        "publisher":"Houghton Mifflin",
        "countsOfReviews":7,
        "pagesNumber":319,
        "description":"In 1944, the U.S. government feared the flood of returning World War II soldiers as much as it looked forward to peace. To avoid economic catastrophe, FDR, the American Legion, William Randolph Hearst, and others began crafting the Servicemen's Readjustment Act of 1944. It would be the single most transformative bill of the twentieth century. Spun as the G.I. Bill of Rights, this program for vets included home loans, health care, educational funds, and career counseling. The effects were immediate and enduring--the suburbs, the middle class, America's ever-increasing number of college graduates, the lunar landing--all are tied to the G.I. Bill. The Greatest Generation would not exist without it: Norman Mailer, Bob Dole, John F. Kennedy, Paul Newman, Jimmy Carter, Clint Eastwood, and many others benefited from its provisions. Here are the stories of some of these men and women, how their lives changed because of the bill and how this country changed because of them.",
        "author":"Edward Humes",
        "language":"English",
        "genres":["History,Nonfiction,American History"],
        "ISBN":"0151007101",
        "domainType":"book",
        "_version_":1718686152132657152},
      {
        "id":"618003",
        "name":"Sisters in Arms: The Women Who Flew in World War II",
        "rating":3.59,
        "publishYear":2006,
        "publishMonth":1,
        "publishDay":9,
        "publisher":"Casemate Publishers",
        "countsOfReviews":1,
        "pagesNumber":240,
        "description":"During World War II, a few, carefully selected women in the US and the UK were briefly given the unprecedented opportunity to fly military aircraft. Yet the story of these pioneer women pilots is made even more intriguing by the fact that, despite many notable similarities in the utilization and organization of the women in their respective countries, they experienced radically different fates.Throughout the war, the contribution of the women of the British ATA to the war effort was recognized and praised both from official quarters and in the press. By contrast, the American WASPs were first glamorized and made into Hollywood stars - and then subjected to a slander campaign. What accounts for this dramatic difference in the treatment of women pilots doing essentially the same job?This book seeks to answer these questions. The women who participated in the ATA and WASP have been allowed to speak for themselves. The story these women have to tell is exciting and intriguing.",
        "author":"Helena P. Schrader",
        "language":"English",
        "genres":["History,Research,Aviation,World War II"],
        "ISBN":"1844153886",
        "domainType":"book",
        "_version_":1718686153363685376},
      {
        "id":"618450",
        "name":"800 Days on the Eastern Front: A Russian Soldier Remembers World War II",
        "rating":3.66,
        "publishYear":2007,
        "publishMonth":24,
        "publishDay":4,
        "publisher":"University Press of Kansas",
        "countsOfReviews":7,
        "pagesNumber":159,
        "description":"During his 800 days of war, Nikolai Litvin fought at the front lines in the ferocious tank battles at Kursk, was wounded three times, and witnessed unspeakable brutalities against prisoners and civilians. But he survived to pen this brief but powerful memoir of his wartime experiences.Barely out of his teens, Litvin served for three years in the Red Army on the killing fields of the Eastern Front. His memoir presents an unadorned, candid narrative of the common soldier's lot in Stalin's army. Unlike the memoirs of Russian officers--usually preoccupied with large military operations and political concerns--this narrative offers a true ground-level view of World War II's deadliest theater. It puts a begrimed human face on the enormous toll of casualties and provides a rare perspective on battles that were instrumental in the defeat of the German army.Litvin's varied roles, ranging from antitank gunner at Kursk to heavy machine gunner in a penal battalion to staff driver for the 352nd Rifle Division, offer unique perspectives on the Red Army in World War II as it fought from the Ukraine deep into the German heartland. Litvin documents such significant battles as Operation Kutuzov, Operation Bagration, and the German counterattack on the Narev, while also providing unique personal observations on fording the Dnepr River under enemy fire, the rape of German women by Russian troops, and literally seeing his life pass before his eyes as he watched a Stuka's bomb fall directly on his position. And, because part of his duties involved chauffeuring Red Army generals, he also presents revealing glimpses into their personalities and behaviors.Originally written in 1962, with events still fresh in his mind, Litvin's memoir lay unpublished and unseen until translator Stuart Britton and a Russian colleague approached him about publishing it in English. Britton interviewed Litvin to flesh out the details of his original recollection and annotated the resulting work to provide historical context for the campaigns and battles in which he participated. Remarkably free of Soviet-era propaganda, this gem of a memoir provides a view of the war never seen by western readers, including photographs from Litvin's personal collection.An invaluable historical document, as well as a remarkable testament of survival, Litvin's memoir offers unique and penetrating insights into the Soviet wartime experience unavailable in any other source.",
        "author":"Nikolai Litvin",
        "language":"English",
        "genres":["Military History,History,World War II,Nonfiction"],
        "ISBN":"0700615172",
        "domainType":"book",
        "_version_":1718686153813524481},
      {
        "id":"618457",
        "name":"War Land on the Eastern Front: Culture, National Identity, and German Occupation in World War I",
        "rating":3.96,
        "publishYear":2005,
        "publishMonth":20,
        "publishDay":10,
        "publisher":"Cambridge University Press",
        "countsOfReviews":2,
        "pagesNumber":320,
        "description":"Vejas Gabriel Liulevicius presents a study of a hidden legacy of World War I: the experience of German soldiers on the Eastern front and the long-term effects of this encounter. Using hitherto neglected sources from both occupiers and occupied, official documents, propaganda, memoirs, and novels, he reveals how German views of the East changed during total war, and how these views affected the return of German armies under the Nazis. This persuasive and compelling study fills a yawning gap in the literature of the Great War.",
        "author":"Vejas Gabriel Liulevicius",
        "language":"English",
        "genres":["History,World War I"],
        "ISBN":"0521023904",
        "domainType":"book",
        "_version_":1718686153830301697},
      {
        "id":"618891",
        "name":"Living Dangerously: The Adventures of Merian C. Cooper, Creator of King Kong",
        "rating":4.12,
        "publishYear":2005,
        "publishMonth":2,
        "publishDay":8,
        "publisher":"Villard",
        "countsOfReviews":14,
        "pagesNumber":478,
        "description":"Explorer, war hero, filmmaker, and cinema pioneer Merian C. Cooper–the adventurer who created King Kong–was truly larger than life. “Pictures cannot be made from an executive’s desk,” “Coop” declared, and he did more than talk the talk–he walked the walk to the far corners of the globe, with a motion picture camera in tow, in an era when those corners were truly unknown, untamed, and unforgiving.Cooper’s place in history is assured, thanks not only to the monstrous gorilla from Skull Island but because the story of Kong’s creator is even bigger and bolder than the beast he made into a cultural icon. Spellbound since boyhood by tales of life-threatening adventure and exotic locales, Cooper plunged again and again into harrowing expeditions that took him to places not yet civilized by modern man.Cooper was one of the first bomber pilots in World War I. After the war, he helped form the famous Kosciuszko Squadron in battle-torn Poland. He then turned his attention to producing documentary films that chronicled his hair-raising encounters with savage warriors, man-eating tigers, nomadic tribes, and elephant stampedes. In addition to producing King Kong, he was the first to team Fred Astaire with Ginger Rogers, arranged Katharine Hepburn’s screen test, collaborated with John Ford on Hollywood’s greatest Westerns, and then changed the face of film forever with Cinerama, the original “virtual reality.” He returned to military service during World War II, serving with General Claire Chennault in China, flying missions into the heart of enemy territory.This book is a stunning tribute to a two-fisted visionary who packed a multitude of lifetimes into eighty remarkable years. The first comprehensive biography of this unique man and his amazing time, it’s the tale of someone whose greatest desire was always to be living dangerously.",
        "author":"Mark Cotta Vaz",
        "language":"English",
        "genres":["Biography,Nonfiction,Film,History"],
        "ISBN":"1400062764",
        "domainType":"book",
        "_version_":1718686153977102336},
      {
        "id":"619210",
        "name":"US Submarines 1941–45",
        "rating":3.24,
        "publishYear":2006,
        "publishMonth":31,
        "publishDay":1,
        "publisher":"Osprey Publishing",
        "countsOfReviews":2,
        "pagesNumber":48,
        "description":"Naval warfare in the Pacific changed completely with the Japanese attack on Pearl Harbor in 1941. The strategic emphasis shifted from battleships to much more lethal, far-ranging weapons systems; one of these was the submarine. This book details the design and development, classes, weapons and equipment, tactics and operational history of the US submarine in World War II. Detailed tables, photographs, and superb color plates depict the force that had an effect far beyond its size - the submarine accounted for 55% of all Japanese shipping losses, despite suffering the highest percentage loss of any unit of the United State Armed Forces in World War II.",
        "author":"Jim Christley",
        "language":"English",
        "genres":["History"],
        "ISBN":"1841768596",
        "domainType":"book",
        "_version_":1718686154057842689},
      {
        "id":"622825",
        "name":"Duffy's War: Fr. Francis Duffy, Wild Bill Donovan, and the Irish Fighting 69th in World War I",
        "rating":3.78,
        "publishYear":2006,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Potomac Books",
        "countsOfReviews":3,
        "pagesNumber":462,
        "description":"The legendary “Fighting 69th” took part in five major engagements during World War I. It served in the front lines for almost 170 days, suffering hundreds killed and thousands wounded. This highly decorated unit was inspired by its chaplain, the famous Father Francis Duffy (whose statue stands in Times Square), and commanded by the future leader of the OSS (predecessor of the CIA), “Wild Bill” Donovan. One of its casualties was the poet Joyce Kilmer. Due in large part to the classic 1940 movie The Fighting 69th, starring James Cagney and Pat O’Brien (as Duffy), the unit still has strong name recognition. But until now, no one has recounted in detail the full story of this famous Irish outfit in World War I. The exciting Duffy’s War brings to life the men’s blue-collar neighborhoods—Irish mostly and Italian and overwhelmingly Catholic. These boys came from the East Side, the West Side, Hell’s Kitchen, the Gashouse, and Five Points; from Brooklyn, Queens, Long Island City, and Staten Island; and from Father Duffy’s own parish in the Bronx. They streamed out of the tenements and apartment houses, enlisting en masse. Brothers joined up, oftentimes three and four from one family. Published during a resurgent interest in the doughboy experience of World War I, Duffy’s War also tells the fascinating history of New York City and the Irish experience in America. With this book, Stephen L. Harris completes his outstanding trilogy on New York National Guard regiments in World War I.",
        "author":"Stephen L. Harris",
        "language":"English",
        "genres":["Nonfiction,History,Military History"],
        "ISBN":"1574886517",
        "domainType":"book",
        "_version_":1718686155202887680},
      {
        "id":"627050",
        "name":"On American Soil: How Justice Became a Casualty of World War II",
        "rating":3.92,
        "publishYear":2007,
        "publishMonth":5,
        "publishDay":3,
        "publisher":"University of Washington Press",
        "countsOfReviews":8,
        "pagesNumber":358,
        "description":"During the night of August 14, 1944, an Italian prisoner of war was lynched on the Fort Lawton army base in Seattle--a murder that shocked the nation and the international community. It was a time of deep segregation in the army, and the War Department was quick to charge three African American soldiers with first-degree murder, although there was no evidence linking them to the crime. Forty other black soldiers faced lesser charges over the incident, launching one of the largest and longest army trials of World War II.In this harrowing story of race, privilege, and power, Jack Hamann explores the most overlooked civil rights event in American history. On American Soil raises important questions about how justice is carried out when a country is at war, offering vital lessons on the tensions between national security and individual rights.A V Ethel Willis White BookFor more about the author visit his website: http: //www.nolittlethings.com",
        "author":"Jack Hamann",
        "language":"English",
        "genres":["History,Nonfiction,World War II,Military History"],
        "ISBN":"0295987057",
        "domainType":"book",
        "_version_":1718686156805111808},
      {
        "id":"628846",
        "name":"Oppenheimer: Portrait of an Enigma",
        "rating":3.65,
        "publishYear":2005,
        "publishMonth":1,
        "publishDay":9,
        "publisher":"Rowman & Littlefield Publishers",
        "countsOfReviews":4,
        "pagesNumber":238,
        "description":"As a former colleague of Oppenheimer's, Jeremy Bernstein has written a biographical profile that is both personal and historical, bringing the reader close to the life and workings of an extraordinary and controversial man. Without Oppenheimer's totally remarkable leadership at Los Alamos, the atomic bomb would not have happened, and World War II would have ended very differently. Bernstein, combining the grace of a New Yorker writer with the insight of a theoretical physicist, draws a fine and fascinating portrait. --Arthur Schlesinger, Jr.",
        "author":"Jeremy Bernstein",
        "language":"English",
        "genres":["Biography,Science,History,Nonfiction"],
        "ISBN":"1566636663",
        "domainType":"book",
        "_version_":1718686157348274177},
      {
        "id":"772014",
        "name":"Corps Commanders of the Bulge: Six American Generals and Victory in the Ardennes",
        "rating":4.5,
        "publishYear":2007,
        "publishMonth":2,
        "publishDay":3,
        "publisher":"University Press of Kansas",
        "countsOfReviews":7,
        "pagesNumber":504,
        "description":"If the Battle of the Bulge was Germany's last gasp, it was also America's proving ground-the largest single action fought by the U.S. Army in World War II. Taking a new approach to an old story, Harold Winton widens our field of vision by showing how victory in this legendary campaign was built upon the remarkable resurrection of our truncated interwar army, an overhaul that produced the effective commanders crucial to GI success in beating back the Ardennes counteroffensive launched by Hitler's forces.Winton's is the first study of the Bulge to examine leadership at the largely neglected level of corps command. Focusing on the decisions and actions of six Army corps commanders--Leonard Gerow, Troy Middleton, Matthew Ridgway, John Millikin, Manton Eddy, and J. Lawton Collins--he recreates their role in this epic struggle through a mosaic of narratives that take the commanders from the pre-war training grounds of America to the crucible of war in the icy-cold killing fields of Belgium and Luxembourg.Winton introduces the story of each phase of the Bulge with a theater-level overview of the major decisions and events that shaped the corps battles and, for the first time, fully integrates the crucial role of airpower into our understanding of how events unfolded on the ground. Unlike most accounts of the Ardennes that chronicle only the periods of German and American initiative, Winton's study describes an intervening middle phase in which the initiative was fiercely contested by both sides and the outcome uncertain. His inclusion of the principal American and German commanders adds yet another valuable layer to this rich tapestry of narrative and analysis.Ultimately, Winton argues that the flexibility of the corps structure and the competence of the men who commanded the six American corps that fought in the Bulge contributed significantly to the ultimate victory. Chronicling the human drama of commanding large numbers of soldiers in battle, he has produced an artful blend of combat narrative, collective biography, and institutional history that contributes significantly to the broader understanding of World War II as a whole. With the recent modularization of the U.S. Army division, which makes this command echelon a re-creation of the corps of World War II, Corps Commanders of the Bulge also has distinct relevance to current issues of Army transformation.",
        "author":"Harold R. Winton",
        "language":"English",
        "genres":["World War II,American History,Military History"],
        "ISBN":"0700615083",
        "domainType":"book",
        "_version_":1718686215251689473},
      {
        "id":"773073",
        "name":"The Lost Years of William S. Burroughs: Beats in South Texas",
        "rating":4.12,
        "publishYear":2006,
        "publishMonth":23,
        "publishDay":5,
        "publisher":"Texas A University Press",
        "countsOfReviews":4,
        "pagesNumber":208,
        "description":"The sometimes raunchy, often legally dubious New York and Mexican exploits of William S. Burroughs, one of the godfathers of the \"Beat\" generation, are well known. Less familiar are his experiences in the Lower Rio Grande Valley of South Texas, where for several years he was a cotton farmer (while avoiding the law in New York). This intriguing chapter in the famous author's life is thoroughly recounted for the first time in Rob Johnson's new book. From 1946 to 1949 Bill Burroughs prepared himself for the writing of his first books by, among other pursuits, raising marijuana and opium poppies and entertaining Beat visitors such as Allen Ginsberg and Neal Cassady at his farm in New Waverly, Texas. Less known, though, are stories about his other farm, a \"serious\" fifty-acre spread, in the Valley near Edinburg, described in the 1977 edition of Junky. Here he raised legal crops such as cotton, carrots, and peas. Other Beat writers move casually in and out of the narrative, which includes the \"William Tell\" episode in Mexico in which Burroughs fatally shot his wife, who had placed a drink glass on her head as a target. As a setting in Burroughs's work, the Valley is central in Junky (1953), \"Tiger in the Valley\" (an unpublished 1955 short story), and, to a less extent, Queer (1985). But the Valley recurs as a setting in almost all of his books, in some form or another. Rob Johnson conducted over forty hours of interviews with people in South Texas and Mexico who knew Burroughs, his business partner Kells Elvins, and other \"South Texas Beats.\" Johnson paints a picture of a fascinating place, time, and people: South Texas and Northern Mexico in the post-World War II period and the Anglos, Mexican Americans, and Mexicans who lived there.",
        "author":"Rob Johnson",
        "language":"English",
        "genres":["History,Biography"],
        "ISBN":"1585445479",
        "domainType":"book",
        "_version_":1718686215468744705},
      {
        "id":"773178",
        "name":"A History of Us: War, Peace, and All That Jazz: 1918-1945 a History of Us Book Nine",
        "rating":3.84,
        "publishYear":2007,
        "publishMonth":9,
        "publishDay":2,
        "publisher":"Oxford University Press, USA",
        "countsOfReviews":8,
        "pagesNumber":220,
        "description":"Recommended by the Common Core State Standards for English Language Arts and Literacy as an exemplary informational text.From woman's suffrage to Babe Ruth's home runs, from Louis Armstrong's jazz to Franklin Delano Roosevelt's four presidential terms, from the finale of one world war to the dramatic close of the second, War, Peace, and All That Jazz presents the story of some of the most exciting years in U.S. history. With the end of World War I, many Americans decided to live it up, going to movies, driving cars, and cheering baseball games a plenty. But alongside this post WWI spree was high unemployment, hard times for farmers, ever present racism, and, finally, the Depression, the worst economic disaster in U.S. history, flip flopping the nation from prosperity to scarcity. Along came one of our country's greatest leaders, F.D.R., who promised a New Deal, gave Americans hope, and then saw them through the horrors and victories of World War II. These three decades full of optimism and despair, progress and Depression, and, of course, War, Peace, and All That Jazz forever changed the United States. About the Series: Master storyteller Joy Hakim has excited millions of young minds with the great drama of American history in her award-winning series A History of US. Recommended by the Common Core State Standards for English Language Arts and Literacy as an exemplary informational text, A History of US weaves together exciting stories that bring American history to life. Hailed by reviewers, historians, educators, and parents for its exciting, thought-provoking narrative, the books have been recognized as a break-through tool in teaching history and critical reading skills to young people. In ten books that span from Prehistory to the 21st century, young people will never think of American history as boring again.",
        "author":"Joy Hakim",
        "language":"English",
        "genres":["History,Nonfiction,School,Childrens"],
        "ISBN":"0195327233",
        "domainType":"book",
        "_version_":1718686215498104833},
      {
        "id":"773855",
        "name":"The Age of Abundance: How Prosperity Transformed America's Politics and Culture",
        "rating":3.51,
        "publishYear":2007,
        "publishMonth":8,
        "publishDay":5,
        "publisher":"Harper Business",
        "countsOfReviews":11,
        "pagesNumber":400,
        "description":"Until the 1950s, the struggle to feed, clothe, and employ the nation drove most of American political life. From slavery to the New Deal, political parties organized around economic interests and engaged in fervent debate over the best allocation of agonizingly scarce resources. But with the explosion of the nation's economy in the years after World War II, a new set of needs began to emerge—a search for meaning and self-expression on one side, and a quest for stability and a return to traditional values on the other.In The Age of Abundance, Brink Lindsey offers a bold reinterpretation of the latter half of the twentieth century. In this sweeping history of postwar America, the tumult of racial and gender politics, the rise of the counterculture, and the conservative revolution of the 1980s and 1990s are portrayed in an entirely new light. Readers will learn how and why the contemporary ideologies of left and right emerged in response to the novel challenges of mass prosperity.The political ideas that created the culture wars, however, have now grown obsolete. As the Washington Post aptly summarized Lindsey's take on the contradictions of American politics, \"Republicans want to go home to the United States of the 1950s while Democrats want to work there.\" Struggling to replace today's stale conflicts is a new consensus that mixes the social freedom of the left with the economic freedom of the right into a potentially powerful ethos of libertarianism. The Age of Abundance reveals the secret formula of this remarkable alchemy. The book is a breathtaking reevaluation of our recent past—and will change the way we think about the future.",
        "author":"Brink Lindsey",
        "language":"English",
        "genres":["Economics,Politics,Nonfiction,History"],
        "ISBN":"0060747668",
        "domainType":"book",
        "_version_":1718686215639662592},
      {
        "id":"776626",
        "name":"Blood, Sweat and Arrogance: And the Myth of Churchill's War",
        "rating":3.86,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":6,
        "publisher":"Phoenix",
        "countsOfReviews":3,
        "pagesNumber":496,
        "description":"Why were the British, victorious in 1918, unable to match the Germans in 1940—and why were these pioneers of tank warfare overcome for so long by Germany’s panzers? This caustic critique exposes just how close England came to losing World War II, and in the process overturns the reputations of some of Britain’s most famous generals. Churchill takes heavy blame for the poor state of the British forces in 1939, while Montgomery is revealed to have much skill with a pen…but very little in command. It’s a brilliant, eye-opening reassessment, from policy decisions in the 1920s to the great campaigns of 1939-45.",
        "author":"Gordon Corrigan",
        "language":"English",
        "genres":["History,World War II,Military History,Nonfiction"],
        "ISBN":"0304367389",
        "domainType":"book",
        "_version_":1718686216270905345},
      {
        "id":"777056",
        "name":"Adolf Hitler",
        "rating":3.63,
        "publishYear":2006,
        "publishMonth":1,
        "publishDay":6,
        "publisher":"Usborne Books",
        "countsOfReviews":4,
        "pagesNumber":64,
        "description":"How did an unremarkable boy from rural Austria become the dictator who led Germany into a bloody world war? Follow Hitler's rise to power, through failure as a student to success as a speaker, and discover how his bitter determination led ultimately to destruction.",
        "author":"Katie Daynes",
        "language":"English",
        "genres":["Childrens,Nonfiction,History"],
        "ISBN":"0794512615",
        "domainType":"book",
        "_version_":1718686216376811522},
      {
        "id":"780027",
        "name":"Churchill: An Illustrated History",
        "rating":3.89,
        "publishYear":2005,
        "publishMonth":20,
        "publishDay":10,
        "publisher":"Readers Digest",
        "countsOfReviews":2,
        "pagesNumber":256,
        "description":"Few statesmen have received so many honours as he did over the course of his career. Although several have received the Nobel Peace Prize, none save Churchill have received the Nobel Prize for Literature. His was a career that had few parallels in British history for richness, range, length and achievement. The biography provides an interesting and informative account of Churchill's life - from his childhood, military service in India and the Sudan and his role as war correspondent during the Boer war to his rise in the world of politics, his leadership of Britain in World War II and his role in the post-war struggle of the Cold War years. Coverage of Churchill's personal life will also be woven into the narrative, including his marriage to Clementine Hozier, their children and Churchill's struggle with his 'Black Dog' depressions. The book gives an honest and accurate presentation of Churchill, including his mistakes and misjudgements as well as his successes.",
        "author":"Brenda Ralph-Lewis",
        "language":"English",
        "genres":["History,Nonfiction"],
        "ISBN":"0276440501",
        "domainType":"book",
        "_version_":1718686216938848257},
      {
        "id":"781350",
        "name":"The Spanish Civil War: Reaction, Revolution, and Revenge",
        "rating":3.97,
        "publishYear":2007,
        "publishMonth":17,
        "publishDay":6,
        "publisher":"W. W. Norton  Company",
        "countsOfReviews":50,
        "pagesNumber":432,
        "description":"Paul Preston is the world's foremost historian of Spain. This surging history recounts the struggles of the 1936 war in which more than 3,000 Americans took up arms. Tracking the emergence of Francisco Franco's brutal (and, ultimately, extraordinarily durable) fascist dictatorship, Preston assesses the ways in which the Spanish Civil War presaged the Second World War that ensued so rapidly after it.The attempted social revolution in Spain awakened progressive hopes during the Depression, but the conflict quickly escalated into a new and horrifying form of warfare. As Preston shows, the unprecedented levels of brutality were burned into the American consciousness as never before by the revolutionary war reporting of Ernest Hemingway, John Dos Passos, Herbert Matthews, Vincent Sheean, Louis Fischer, and many others. Completely revised, including previously unseen material on Franco's treatment of women in wartime prisons, The Spanish Civil War is a classic work on this pivotal epoch in the twentieth century.",
        "author":"Paul Preston",
        "language":"English",
        "genres":["History,Spain,Nonfiction,Spanish Civil War"],
        "ISBN":"0393329879",
        "domainType":"book",
        "_version_":1718686217160097793},
      {
        "id":"782443",
        "name":"Stalin's Keys to Victory: The Rebirth of the Red Army in World War II",
        "rating":3.64,
        "publishYear":2007,
        "publishMonth":17,
        "publishDay":10,
        "publisher":"Tradeselect",
        "countsOfReviews":2,
        "pagesNumber":179,
        "description":"- An important reevaluation of World War II on the Eastern Front - Detailed look at how the Soviet Union created more new divisions in a few months than the U.S. did during the entire war - More than 60 tables list losses, tank and weapon production, and unit formation, with special emphasis on rifle and tank divisions and brigades When Hitler invaded the Soviet Union in June 1941, the German Army quickly annihilated a major portion of the Red Army. Yet the Red Army rebounded to successfully defend Moscow in late 1941, defeat the Germans at Stalingrad in 1942 and Kursk in 1943, and deliver the deathblow in Belarus in 1944. Dunn examines these 4 battles while explaining how the Soviets lost a third of their prewar army yet returned to beat one of the most highly trained and experienced armies the world has ever seen.",
        "author":"Walter S. Dunn Jr.",
        "language":"English",
        "genres":["Military History"],
        "ISBN":"0811734234",
        "domainType":"book",
        "_version_":1718686217424338944},
      {
        "id":"782475",
        "name":"New York Times When the Wall Came Down: The Berlin Wall and the Fall of Soviet Communism",
        "rating":3.88,
        "publishYear":2006,
        "publishMonth":10,
        "publishDay":5,
        "publisher":"Kingfisher",
        "countsOfReviews":0,
        "pagesNumber":128,
        "description":"This is history as only an eyewitness can tell it. In 1989, veteran journalist Serge Schmemann was in his hotel room when his assistant from East Germany burst in with some incredible news: the Berlin Wall was open. Serge jumped into the first cab he could find and raced to the wall in time to witness one of the great moments of European history.Including articles from the archives of The New York Times, this gripping narrative tells the whole story, from the division of Germany after World War II, to life in the Communist East, to the massive protests that brought an end to the Eastern Bloc, and the fall of the Berlin Wall.",
        "author":"Serge Schmemann",
        "language":"English",
        "genres":["History,Nonfiction,Historical"],
        "ISBN":"0753459949",
        "domainType":"book",
        "_version_":1718686217434824704},
      {
        "id":"786397",
        "name":"The 12th SS: Vol.1, the History of the Hitler Youth Panzer Division",
        "rating":3.95,
        "publishYear":2005,
        "publishMonth":21,
        "publishDay":4,
        "publisher":"Stackpole Books",
        "countsOfReviews":3,
        "pagesNumber":592,
        "description":"The defining work on Hitler's elite fanatical boy soldiersWritten by the division's former chief of staff. Volume one details all aspects of the division's history with a balanced mix of both tactical and strategic accounts, including the creation and training of these teenage warriors and their baptism of fire in the Normandy campaign in World War II.",
        "author":"Hubert Meyer",
        "language":"English",
        "genres":["Military History,World War II,Nonfiction,History"],
        "ISBN":"0811731987",
        "domainType":"book",
        "_version_":1718686218274734081},
      {
        "id":"787846",
        "name":"The Invisible Wall: A Love Story That Broke Barriers",
        "rating":4.09,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":3,
        "publisher":"Blackstone Audiobooks",
        "countsOfReviews":10,
        "pagesNumber":8,
        "description":"This enchanting true story, written when the author was ninety-three, is a moving tale of working-class life, social divide, and forbidden love on the eve of the first World War. The narrow street on which Harry grew up appeared identical to countless other working-class English neighborhoods--except for the invisible wall that ran down the center of the street, dividing the Jewish families on one side from the Christians on the other. The geographical distance may have been yards, but socially, it was miles. Families on either side did not speak or meet. But when Harry's older sister fell for the boy across the street, Harry became a go-between for the lovers, crossing the great divide to hide their secret. When the truth inevitably came out, Harry had to decide, at a very young age, what he believed was morally right.",
        "author":"Harry Bernstein",
        "language":"English",
        "genres":["Nonfiction,Memoir,Biography,History"],
        "ISBN":"0786160802",
        "domainType":"book",
        "_version_":1718686218516955136},
      {
        "id":"788325",
        "name":"Ireland: A Social and Cultural History 1922–2001",
        "rating":3.89,
        "publishYear":2010,
        "publishMonth":26,
        "publishDay":2,
        "publisher":"Harper Perennial",
        "countsOfReviews":2,
        "pagesNumber":512,
        "description":"The seminal history of Ireland’s most unusual century, thoroughly updated for the new millennium.With its starting point the bloody creation of the Irish Free State in 1922, Ireland: A Social and Cultural History explores how Irish identity has shifted across eighty years of unprecedented change and violence. What was the legacy of De Valera and Sinn Fein – or of remaining neutral during the Second World War? What were the effects of the establishment of a formally recognised Republic of Ireland in 1949 and thus the continued status of Northern Ireland as part of Great Britain? How has the state of virtual civil war that has existed between Catholics and Protestants in Northern Ireland ever since altered the course of Irish history?Terence Brown evokes all the turbulent (and often confusing) events of the last century and makes sense of them, showing with skill and wit just how Irish culture escaped from W B Yeats' backward-looking Celtic Twilight towards modernity. Ireland: A Social and Cultural History is a fascinating work of synthesis – and an unforgettable book.",
        "author":"Terence Brown",
        "language":"English",
        "genres":["History,Ireland,Nonfiction,Irish Literature"],
        "ISBN":"0007127561",
        "domainType":"book",
        "_version_":1718686218558898177},
      {
        "id":"795166",
        "name":"The War in the Empty Air: Victims, Perpetrators, and Postwar Germans",
        "rating":3.67,
        "publishYear":2005,
        "publishMonth":1,
        "publishDay":11,
        "publisher":"Indiana University Press",
        "countsOfReviews":1,
        "pagesNumber":303,
        "description":"Sixty years after the defeat of the Nazis and the discovery ofAuschwitz, the impact of WWII on the German people remains asubject that is difficult to broach in public discourse. The experiences ofGermans civilians were little studied, as if the memories of the defeatedwere not deserving of preservation. In Germany 1945, an examination ofAllied photography of postwar Germany, Dagmar Barnouwdemonstrated one of the means by which the victors sought to imposethe burden of responsibility for World War II and the Holocaust on theGerman people as a whole. Now, in The War in the Empty Air, shedemonstrates how deeply that narrative took hold and the silence itimposed.",
        "author":"Dagmar Barnouw",
        "language":"English",
        "genres":["History"],
        "ISBN":"0253346517",
        "domainType":"book",
        "_version_":1718686219663048704}]
  }}