{
  "responseHeader":{
    "status":0,
    "QTime":1,
    "params":{
      "q":"{!parent which='-_nest_path_:* genres:romance description:family description: christmas'}",
      "indent":"true",
      "q.op":"AND",
      "rows":"27"}},
  "response":{"numFound":26,"start":0,"numFoundExact":true,"docs":[
      {
        "id":"601914",
        "name":"The Baby Gift (Salvatore Brothers #4)",
        "rating":3.58,
        "publishYear":2000,
        "publishMonth":24,
        "publishDay":11,
        "publisher":"Harlequin Romance",
        "countsOfReviews":3,
        "pagesNumber":192,
        "description":"Alessandro Salvatore was stunned when a woman appeared on his doorstep carrying a baby - claiming he was the father! Alessandro wasn't looking for a wife and he wanted Lauren Williams, whoever she was, off his property....Lauren could understand Alessandro's surprise, but she was determined little Nick should have a family for Christmas. There was nothing else for it - she'd simply have to teach Alessandro to believe in love again!",
        "author":"Day Leclaire",
        "language":"English",
        "genres":["Romance,Harlequin Romance,Contemporary Romance"],
        "ISBN":"0373036310",
        "domainType":"book",
        "_version_":1718681402697842688},
      {
        "id":"612391",
        "name":"Mrs. Miracle (Angelic Intervention #4)",
        "rating":4.07,
        "publishYear":2019,
        "publishMonth":29,
        "publishDay":10,
        "publisher":"Avon",
        "countsOfReviews":402,
        "pagesNumber":352,
        "description":"Seth Webster's heart never healed after he lost his adored wife. Now, with Christmas approaching, wild twin boys to raise alone, a home in chaos, and the latest in a long line of exasperated housekeepers quitting in disgust, Seth needs more than help to keep his family togethe...he needs a miracle.And then a miracle arrives on his doorstep. Her name is Mrs. Merkle, but the kids call her \"Mrs. Miracle\"—and from the moment the warm, knowing, and very patient nanny appears, everything is different. Her sassy spirit is infectious, and it gives Seth the courage to approach Reba, a beautiful travel agent who's been hurt and betrayed, and is afraid to ever love again. Through the magic of faith—and with a little help from a children's Christmas pageant and a lot of encouragement from Mrs. Miracle—Seth and Reba might just be able to find a Christmas miracle of their very own: true love.",
        "author":"Debbie Macomber",
        "language":"English",
        "genres":["Christmas,Romance,Fiction,Holiday"],
        "ISBN":"0061083461",
        "domainType":"book",
        "_version_":1718681409383563264},
      {
        "id":"615028",
        "name":"Christmas Angel (Company of Rogues, #3)",
        "rating":3.91,
        "publishYear":2001,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Zebra",
        "countsOfReviews":85,
        "pagesNumber":352,
        "description":"HE HAD NO INTEREST IN LOVELeander Knollis, Earl of Charrington, was tired of gadding about the Continent on diplomatic missions. It was time he settled down in his family home with a wife at his side and enjoyed a proper English Christmas. But his search for an intelligent woman without fanciful notions of romance was a frustrating one indeed...until he met the very sensible Judith Rossiter. Her figure was most attractive, her manner most pleasing, and her heart kind and gentle. All he wanted was a marriage of convenience, but soon he began to wonder whether his eminently practical mind would be overruled by his surprisingly foolish heart.LOVE WAS ALL SHE COULD OFFERIt was an odd sort of marriage proposal which left Judith perplexed. Why would an earl, and a most attractive one at that, have any interest in marrying an impoverished widow with two children? It was a peculiar notion to consider but the opportunity to better her family's fortune, particularly in the advent of the approaching holiday season prompted her to accept his offer. It seemed an ideal arrangement in which she had nothing to fear...unless it was losing her heart to this most enigmatic earl!",
        "author":"Jo Beverley",
        "language":"English",
        "genres":["Romance,Historical Romance,Historical,Christmas"],
        "ISBN":"0821768433",
        "domainType":"book",
        "_version_":1718681410928115712},
      {
        "id":"669647",
        "name":"The Christmas Basket",
        "rating":4.0,
        "publishYear":2002,
        "publishMonth":24,
        "publishDay":9,
        "publisher":"MIRA",
        "countsOfReviews":273,
        "pagesNumber":240,
        "description":"No one tells a Christmas story like Debbie Macomber. The Christmas Basket is filled with gifts for the reader -- gifts of warmth and laughter . . . and emotional truth. This Christmas, let Debbie make you smile! That summer -- more than ten years ago, while they were still in high school -- Noelle McDowell and Thomas Sutton fell secretly in love. Secretly because their mothers had been locked in a bitter feud for decades. But despite the animosity between Sarah McDowell and Mary Sutton, Noelle planned to elope with Thom. Until he jilted her. This Christmas Noelle McDowell is home to celebrate the holidays with her family. (After all, December 25 is also her birthday.) Unfortunately, Noelle's feelings about home -- or rather, her hometown of Rose, Oregon -- were changed forever the day Thomas Sutton broke her heart. This Christmas the feuding mothers find themselves working together to fill Christmas baskets for charity. What irony! And what an opportunity for reconciliation . . . if only they could see it. This Christmas Noelle and Thom discover they're still in love. Regardless of their mothers' reactions, they want to be together. Is that possible? Can old rivalries be set aside? Will Sarah's Christmas daughter have a second chance with Mary's charming son? Maybe she will . . . this Christmas!",
        "author":"Debbie Macomber",
        "language":"English",
        "genres":["Christmas,Romance,Fiction,Holiday"],
        "ISBN":"1551669447",
        "domainType":"book",
        "_version_":1718681445959991296},
      {
        "id":"674438",
        "name":"Mistletoe Bay (Misty Harbor, #7)",
        "rating":3.95,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Zebra",
        "countsOfReviews":24,
        "pagesNumber":320,
        "description":"Nestled beside the coastal town of Misty Harbor, Maine, lies the picturesque village of Mistletoe Bay. There, overlooking the clear blue sea, is a charming old house that's the perfect place to gather for the holidays and give thanks for family, good friends, and bright new beginnings...When Cooper Armstrong left California to return to Maine, he also left a cheating ex and all his plans for settling down. Now Coop concentrates on taking care of his ailing father and learning his route as the area's new UPS man. It's not just Coop's parents who need assistance—Jenni Wright, whose blossoming new business has him making daily deliveries to her property, could clearly use some help. With three young sons, her mother-in-law, and a teenage niece all sharing a rickety house that seems to be held together with duct tape, Jenni has her hands full. To Jenni, Coop is their UPS guy, handyman, and her boys' guardian angel all in one gorgeous package. She's sure he'd run a mile before getting involved in the chaos of her life. But as Thanksgiving gives way to Christmas, the lovely, resilient Jenni turns Coop's expectations of a cold, lonely winter upside-down, revealing the promise of warmth, love, and a lifetime of happy memories.\"The magic of everyday pleasures permeates Evanick's contemporary romance...Evanick has a gift for finding the humor in small details, and her story of opposites who attract unfolds with endearing warmth.\" —Publishers Weekly on Harbor Nights\"Evanick's enchanting series never skimps on humanity, warmth, and romance.\" —Romantic Times on Harbor Nights",
        "author":"Marcia Evanick",
        "language":"English",
        "genres":["Romance,Christmas,Contemporary Romance,Contemporary"],
        "ISBN":"0821780093",
        "domainType":"book",
        "_version_":1718681448312995840},
      {
        "id":"765384",
        "name":"Some Kind of Wonderful",
        "rating":3.85,
        "publishYear":2004,
        "publishMonth":5,
        "publishDay":1,
        "publisher":"St. Martin's Paperbacks",
        "countsOfReviews":40,
        "pagesNumber":352,
        "description":"Holiday shop owner Carol Baker infuses her business and her life with peace and good will. But she has secrets from her past that make her all the more determined to someday have a family of her own. She never expects a sweltering July heat wave to bring the gift of a baby girl who needs a mother's love...and a man who needs to heal his wounded soul.Ex-LAPD copy Jack Reilly's back in town--temporarily--to fill in for the ailing local sheriff. Haunted by the tragedy that made him leave Los Angeles, Jack doesn't believe in \"forever.\" His sassy landlady Carol, with her year-round Chistmas spirit, gorgeous smile, and adorable little foster daughter, Liz, begin to bring him back to life. But the past has a way of coming back again, and the dark places of the heart have a way of staying hidden. Still, good things have a way of happening in Christmas--and if the Reillys have anything to say about it, what develops between Carol and Jack will be some kind of wonderful...",
        "author":"Maureen Child",
        "language":"English",
        "genres":["Romance,Contemporary Romance,Contemporary,Fiction"],
        "ISBN":"0312987277",
        "domainType":"book",
        "_version_":1718681488794320896},
      {
        "id":"769356",
        "name":"Second Spring (Family Saga, #6)",
        "rating":3.8,
        "publishYear":2003,
        "publishMonth":1,
        "publishDay":4,
        "publisher":"Forge Books",
        "countsOfReviews":0,
        "pagesNumber":352,
        "description":"Father Andrew M. Greeley, one of America's best-loved and most widely read novelists, has delighted readers with his ongoing chronicles of the crazy O'Malleys, a rambunctious but resourceful Irish-American family caught up in the sweep of modern American history. The previous novels in the saga--A Midwinter's Tale, Younger than Springtime, A Christmas Wedding, and September Song--have taken the O'Malleys of Chicago from the aftermath of World War II through the tumultuous upheavals of the sixties. Now, in Second Spring, Charles \"Chucky\" O'Malley and his growing clan face the promise and pitfalls of the late seventies.It's 1978 and the whole country, exhausted from the twin traumas of Vietnam and Watergate, seems to be suffering from a massive hangover. Chucky O'Malley knows how the country feels; approaching fifty, he finds himself in the grip of a debilitating midlife crisis. Although he has much to be thankful for, including a loving wife and a thriving career as a professional photographer, he does not feel like a success. He hasn't lost his faith, exactly, but he does feel disillusioned and depressed. As he travels the world, from the Vatican, where a new pope is to be selected, to Jimmy Carter's White House, where an overwhelmed president struggles to find a cure for his nation's malaise, Chucky searches for a way to renew his weary spirit.Fortunately, he doesn't have to face this challenge alone. With the loving support of his family, and especially his irrepressible and adoring wife, Rosemarie, he just might rediscover his lost hope and optimism in time for a Second Spring. . . .",
        "author":"Andrew M. Greeley",
        "language":"English",
        "genres":["Fiction,Romance,Historical Fiction,Mystery"],
        "ISBN":"0765302365",
        "domainType":"book",
        "_version_":1718681489655201792},
      {
        "id":"816199",
        "name":"Fangs for the Memories (Young Brothers, #1)",
        "rating":3.78,
        "publishYear":2005,
        "publishMonth":1,
        "publishDay":9,
        "publisher":"Kensington Publishing Corp.",
        "countsOfReviews":120,
        "pagesNumber":304,
        "description":"Oh, Brother!There are Christmas mornings and then there are Christmas mornings like this one: watching my brother, Rhys, swagger through our New York City apartment...smiling. We are talking about Rhys, the detached, surly and annoying; the man who turned brooding into an art form. But he's not brooding now. No, he's practically threatening to pistol whip me for shaking hands with the beautiful, sweet, half-dressed creature named Jane who just tried to sneak out of his bedroom. Weird. And who knew Brother Grim even had a sex drive?But it isn't just the smiling and the sudden libido that has me freaked out. Something terrible happened last night, something that made my brother break his own rule and save the life of a mortal. Whatever it was, now he doesn't remember anything from the past two hundred years. He wants Jane so bad that he's forcing himself to forget he's a vampire, taking himself back to a time before he crossed over and our family was destroyed. He's sauntering around the place like a Regency viscount with an English accent, saying things like \"I behaved like a randy, soused caper-wit.\" Did we ever really talk like that? So, Rhys doesn't know he's a vampire, and neither does Jane. This is what we call a problem.All I know is, this mortal woman has managed to touch my brother's frozen heart, and I, Sebastian Young, will do whatever it takes to help him keep her...",
        "author":"Kathy Love",
        "language":"English",
        "genres":["Vampires,Paranormal Romance,Paranormal,Romance"],
        "ISBN":"0758211317",
        "domainType":"book",
        "_version_":1718681502856773632},
      {
        "id":"819433",
        "name":"Love Song",
        "rating":3.06,
        "publishYear":1999,
        "publishMonth":18,
        "publishDay":5,
        "publisher":"Corgi",
        "countsOfReviews":5,
        "pagesNumber":576,
        "description":"The Merriott sisters are born into a comfortable middle-class life and their house, situated on the edge of Richmond Park, is full of fun and laughter. But then Letty, the fourth girl, arrives and tensions suddenly appear in the once happy home. For unbeknownst to the sisters, much depended on the new baby being born a boy - not least the happiness of their parents' marriage. Letty has a beautiful face but a withered arm and while the girls and their mother can accept and love her as their own, her father's resentment of her is tantamount to dislike.It is only when Aunt Rosabel, their mother's great-aunt, arrives for Christmas that all their fortunes change. Within months the Merriotts find themselves living in a great house, Merrylands in Wiltshire, with the promise of everything they, but most of all their father, have ever wanted. Unfortunately, Aunt Rosabel is not what she seems and before long the family find themselves worse off than they have ever been.",
        "author":"Charlotte Bingham",
        "language":"English",
        "genres":["Romance,Fiction"],
        "ISBN":"0553505017",
        "domainType":"book",
        "_version_":1718681504791396352},
      {
        "id":"826458",
        "name":"Persuading Annie",
        "rating":3.57,
        "publishYear":2004,
        "publishMonth":17,
        "publishDay":8,
        "publisher":"William Morrow Paperbacks",
        "countsOfReviews":134,
        "pagesNumber":352,
        "description":"After years as a sweet, good-natured pushover, Annie Markham has had to face up to three hard truths:You've got to be tough to succeed in business and romance.Sometimes your meddling loved ones are right about your worthless, no-good boyfriend being worthless and no good.The only reliable thing about men is that they're totally unreliable.Okay, she's been persuaded. So now, seven years after wisely and abruptly dumping the \"love of her life,\" Jake Mead, things should be going better for Annie Markham, right? Unfortunately, her life's going nowhere, her family's going mental, and the family business is heading straight down the tubes. Could it get worse? Of course! Jake's back, Annie's getting ready for bankruptcy, and no one's ready for Christmas ... let alone a happy New Year.And no amount of persuasion will ever convince Annie that magic does happen and dreams do come true, not even at the stroke of midnight on December 31 at New York's Plaza Hotel ... will it?",
        "author":"Melissa Nathan",
        "language":"English",
        "genres":["Chick Lit,Romance,Fiction,Contemporary"],
        "ISBN":"0060595809",
        "domainType":"book",
        "_version_":1718681507906715649},
      {
        "id":"828922",
        "name":"Unwrapped (Sex & Candy #4)",
        "rating":3.38,
        "publishYear":2004,
        "publishMonth":24,
        "publishDay":11,
        "publisher":"Harlequin Blaze",
        "countsOfReviews":2,
        "pagesNumber":256,
        "description":"Mills & Boon Blaze series promises scorching hot reads...Karina Sutter is famous for her decadent chocolates. Thanks to a secret family recipe, no one can resist the candy’s sexual effects. After one bite, men and women can’t keep their hands off one another. As happy as Karina is for her very satisfied customers, just once she would like to experience the benefits. In fact, a gorgeous, mysterious man recently moved in across the street. Maybe it’s time to let loose and indulge. When Karina shows up on Alex Anderson’s doorstep with a box of truffles, she’s sure that after one bite, he’ll be hers! It may not be true love, but who said a hot, steamy night was a bad thing? But Alex isn’t as easy to convince as she thought. But Karina’s not giving up. Besides, its Christmas—isn’t sex just the perfect gift to giveand receive?",
        "author":"Carrie Alexander",
        "language":"English",
        "genres":["Romance,Harlequin Blaze"],
        "ISBN":"0373791674",
        "domainType":"book",
        "_version_":1718681508531666944},
      {
        "id":"693106",
        "name":"Who's Afraid Of The Mistletoe?",
        "rating":3.87,
        "publishYear":1997,
        "publishMonth":24,
        "publishDay":10,
        "publisher":"Harlequin Superromance",
        "countsOfReviews":2,
        "pagesNumber":304,
        "description":"Librarian Note: This edition's ISBN is in conflict with another's in the database - Scorpions' Dance. Mills & Boon Blush series brings you moving, true-to-life romances\"The truth about Margot Early is that she is a brilliant and diverse writer.\" Affaire de Coeur   Who's afraid of the mistletoe? Sarah Calder, that's who.Why is she afraid? She really can't say    The answer is that Christmas means family, emotion, remembering the past. And kissing can mean the same things.   But now Sarah needs help, and she can only get it from one person her ex-lover, Tage. The last time she saw him was on the Iditarod Trail with his \"family\" of sled dogs. But his responsibilities have changed since then. He's recently become guardian to two young children his orphaned niece and nephew from Sweden.   Add Sara and her impossible dog to this household and you have a Christmas unlike any other!   \"A special story from the heart of a special talent. Who's Afraid of the Mistletoe? is a moving and emotional experience .\" Laura DeVries, aka Laura Gordon, author of contemporary and historical romance",
        "author":"Margot Early",
        "language":"English",
        "genres":["Romance"],
        "ISBN":"0373707665",
        "domainType":"book",
        "_version_":1718681459153174528},
      {
        "id":"695346",
        "name":"The Yuletide Engagement",
        "rating":3.45,
        "publishYear":2004,
        "publishMonth":1,
        "publishDay":5,
        "publisher":"Mills & Boon",
        "countsOfReviews":0,
        "pagesNumber":288,
        "description":"Patrick wants Ellie, but is worried that she may be pining after her devious ex-boyfriend. Although Ellie's been hurt, she desperately wants to show Patrick that the only person on her Christmas wish-list is him. But when family secrets come to light, can Ellie trust the man she loves?",
        "author":"Carole Mortimer",
        "language":"English",
        "genres":["Romance,Christmas,Harlequin,Harlequin Presents"],
        "ISBN":"026318062X",
        "domainType":"book",
        "_version_":1718681461465284608},
      {
        "id":"695372",
        "name":"Christmas Miracles",
        "rating":3.87,
        "publishYear":1997,
        "publishMonth":24,
        "publishDay":9,
        "publisher":"Harlequin",
        "countsOfReviews":7,
        "pagesNumber":381,
        "description":"When Dr. Oliver Hay-Smithe sees how kindhearted Bertha's family takes advantage of her, he decides to sweep her off her feet with \"A Christmas Proposal\" by Betty Neels. Bethany seems to be the perfect mother for Nick Rafferty's three children--and the perfect wife for Nick. So perfect, in fact, that Nick suspects he's being watched over by \"Heavenly Angels\" by Carole Mortimer.And Jill Barton loves her role as a stand-in mom for five-year-old Kip. But as soon as Jill meets Kip's father, the gorgeous Zane Doyle, she realizes why all Kip wants is \"A Daddy for Christmas\" by Rebecca Winters.",
        "author":"Betty Neels",
        "language":"English",
        "genres":["Romance,Christmas,Anthologies,Contemporary Romance"],
        "ISBN":"0373152655",
        "domainType":"book",
        "_version_":1718681461507227648},
      {
        "id":"696676",
        "name":"A Gift to Last (includes Angels Everywhere #4)",
        "rating":4.01,
        "publishYear":2002,
        "publishMonth":25,
        "publishDay":10,
        "publisher":"MIRA",
        "countsOfReviews":45,
        "pagesNumber":240,
        "description":"A Gift to Last is a compilation of two of Debbie's beloved holiday stories, Can this be Christmas? and Shirley, Goodness and Mercy. Both novellas, set during the Christmas season, convey the importance of family and community that have become a trademark of Debbie's writing.Can this be Christmas? is the story of strangers stranded in a shabby New Hampshire train depot on Christmas Eve, away from the families they love and homes they miss. Together, with the help of some local residents, they open their hearts to each other and discover the real magic of Christmas.In Shirley, Goodness and Mercy, three angels are determined to create a miracle for a man who is full of regrets and all alone at Christmas. In their unique ways, they set out to show him what life, joy and Christmas are really all about.",
        "author":"Debbie Macomber",
        "language":"English",
        "genres":["Christmas,Romance,Fiction,Holiday"],
        "ISBN":"1551669307",
        "domainType":"book",
        "_version_":1718681462079750144},
      {
        "id":"643477",
        "name":"Christmas Kisses (Mackenzie Family, #3.5 & Those Manning Men, #5)",
        "rating":3.93,
        "publishYear":1996,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Silhouette Books",
        "countsOfReviews":27,
        "pagesNumber":377,
        "description":"\"Mackenzie's Magic\" / Linda Howard (Mackenzie Family #3.5)Meet Maris MacKenzie. . . and the handsome stranger she woke up to find in her bed! Unfortunately, she had no memory of Alex MacNeil. . . the previous day. . . or the prize Thoroughbred she had apparently stolen.\"Silver Bells\" / Debbie Macomber (Those Manning Men #5)Celebrate the magic of Christmas with the Manning family. . It wasn't easy for Phillip Lark to single-handedly raise his rambunctious teenage daughter. But the girl had hatched a plot to find her father a wife, and lovely Carrie Weston seemed to fit the bill. Phillip claimed he wasn't interested in remarriage, but would the magic of the holiday season--and Carrie's wonderful charms--help him change his mind?this story was also published in the anthology That Holiday Feeling\"The Wild West Christmas\" / Linda TurnerYears ago Priscilla Rawlings gave Wyatt Chandler her innocence. He repaid her by running out on her. Now he'd come back to the Rawlings ranch for Christmas, and Priscella had to face the one man who had broken her heart. . . but whom she'd never stopped loving.",
        "author":"Linda Howard",
        "language":"English",
        "genres":["Romance,Christmas,Anthologies,Contemporary Romance"],
        "ISBN":"0373483287",
        "domainType":"book",
        "_version_":1718681432480546816},
      {
        "id":"682563",
        "name":"Santa Baby",
        "rating":3.52,
        "publishYear":2002,
        "publishMonth":1,
        "publishDay":10,
        "publisher":"Zebra",
        "countsOfReviews":28,
        "pagesNumber":416,
        "description":"This title contains stories including \"A Baby for Christmas\" by Lisa Jackson, \"Under the Mistletoe\" by Elaine Coffman, \"Holiday Stud\" by Kylie Adams, and \"Merry, Merry Mischief\" by Lisa Plumley. \"A Baby for Christmas\" - It's turning out to be a Christmas of surprises for lonely Annie McFarlane. First, there's the adorable baby left on her doorstep, followed a day later by the angry, dangerously attractive man claiming to be the child's father. Liam O' Shaughnessy may be intimidating, but this is one precious gift Annie isn't giving up without a fight...\"Under the Mistletoe\" - Dr. Stanley Levine keeps his house like his life - orderly, predictable, serene - until the day eccentric Southern belle Holly Noel moves in next door with her brood of seven girls. It may be Christmas, but that doesn't mean the dedicated bachelor has to kow-tow to an unruly clan defended by one maddening, sultry mama...\"Holiday Stud\" - The only way single, successful career woman Audra Jarecki can face a Christmas homecoming - and the pitying eyes of her family - is with a gorgeous boyfriend on her arm. Hiring hunky Colby Douglas may be the worst mistake of Audra's life...or the answer to everything on her Christmas wish list. ..\"Merry, Merry Mischief\" - Flirty Katie Moore is the ultimate good-time girl. Too bad she's held up at the office, helping nose-to-the grindstone architect Jack Brennan with a very special project: emergency babysitting for the boss' tiny daughter. Now, the party girl and the workaholic are joining forces to give the little bundle of joy a Christmas she'll never forget...",
        "author":"Lisa Jackson",
        "language":"English",
        "genres":["Christmas,Romance,Anthologies,Contemporary Romance"],
        "ISBN":"0821772945",
        "domainType":"book",
        "_version_":1718681453118619648},
      {
        "id":"741307",
        "name":"Her Christmas Wedding Wish",
        "rating":3.87,
        "publishYear":2006,
        "publishMonth":24,
        "publishDay":10,
        "publisher":"Harlequin Presents",
        "countsOfReviews":6,
        "pagesNumber":180,
        "description":"Workaholic attorney Richard Anderson's life was turned upside down when he became guardian to his orphaned nephew. He tried his best, but it was up to Molly Soderling, the boy's beautiful nurse, to make this a very special Christmas.In Richard's mansion Molly could pretend to have the family Christmas she'd always craved. She already loved the boy, but his broodingly handsome uncle was downright dangerous! Molly resisted temptation--till she made one mistake: she got caught under mistletoe....",
        "author":"Judy Christenberry",
        "language":"English",
        "genres":["Christmas,Harlequin Romance,Romance"],
        "ISBN":"0373039190",
        "domainType":"book",
        "_version_":1718681480941535232},
      {
        "id":"864753",
        "name":"The House on Hope Street",
        "rating":3.88,
        "publishYear":2001,
        "publishMonth":3,
        "publishDay":7,
        "publisher":"Dell",
        "countsOfReviews":16,
        "pagesNumber":295,
        "description":"In eighteen years of marriage, Liz and Jack Sutherland had built a family, a successful law practice, and a happy home near San Francisco, on Hope Street. Then, in an instant, it all fell apart.  It began like any other Christmas morning. But for Jack Sutherland, a five-minute errand ends in tragedy. And suddenly, Liz is alone, in the wake of an unbearable loss. How can she go on without her husband, her partner, her best friend? How can she grieve when she must console five devastated children, including one with special needs?  Powered by her children's love, Liz finds the strength to return to work, to become both mother and \"daddy.\" One by one the holidays come and go, until a devastating accident sends her oldest son to the hospital—and brings Dr. Bill Webster into her life. Bill becomes a friend to Liz as he slowly heals her shattered son. With the first anniversary of Jack's death approaching, and with it another Christmas in the house on Hope Street, a new relationship offers new hope, and Liz reflects on the little blessings that give strength when nothing else is left. But she will face one more crisis before she can look ahead to the beginning of a new life.The House on Hope Street is about learning to live again after you think life is over. It is about cherishing small miracles, and believing in big ones. It is above all about hope.",
        "author":"Danielle Steel",
        "language":"English",
        "genres":["Romance,Fiction,Chick Lit,Drama"],
        "ISBN":"0440237009",
        "domainType":"book",
        "_version_":1718681520254746625},
      {
        "id":"865061",
        "name":"The House On Hope Street",
        "rating":3.88,
        "publishYear":2001,
        "publishMonth":3,
        "publishDay":7,
        "publisher":"Random House Large Print",
        "countsOfReviews":1,
        "pagesNumber":336,
        "description":"Life was good for Liz and Jack Sutherland.  In 18 years of marriage, they had built a family, a successful law practice, and a warm, happy home near San Francisco, in a house on Hope Street.  Then, in an instant, it all fell apart.  It began like any other Christmas morning, with joy and children's laughter.  But for Jack Sutherland, a five-minute errand ends in tragedy.  And suddenly, Liz is alone, facing painful questions in the wake of an unbearable loss.How can she go on without her husband, her partner, her best friend?  How can she grieve when she must console five devastated children, including one with special needs of his own?  Powered by her children's love, Liz finds the strength to return to work, to become both mother and 'daddy', coaching her youngest son for the Special Olympics.  And one by one the holidays come and go before her eyes: Valentine's Day without flowers and without Jack...Easter...July 4th...Then, just weeks before Labor Day, a devastating accident sends her oldest son to the hospital-and brings a doctor named Bill Webster into her life.  Bill becomes a friend to Liz as he slowly heals her shattered son.And as long as the days of summer blend into fall, a new relationship offers new hope, and Liz reflects on what she has, on what she's lost, on the little blessings that give strength when nothing else is left.  Then, with the first anniversary of her husband's death approaching, and with it another Christmas in the house on Hope Street, Liz will face one more crisis before she can look back at a year of mourning and change-and ahead to the beginning of a new life.THE HOUSE ON HOPE STREET is about learning to live again after you think life is over, about gettting up when you have been knocked down, again and again.  It is about cherishing small miracles, and believing in big ones.  It is above all about hope.",
        "author":"Danielle Steel",
        "language":"English",
        "genres":["Romance,Fiction,Chick Lit,Drama"],
        "ISBN":"0375728090",
        "domainType":"book",
        "_version_":1718681520319758336},
      {
        "id":"884423",
        "name":"Christmas Rendezvous",
        "rating":3.72,
        "publishYear":1991,
        "publishMonth":1,
        "publishDay":11,
        "publisher":"Zebra",
        "countsOfReviews":3,
        "pagesNumber":383,
        "description":"Kiss of the Christmas wind by Janelle TaylorAs newlyweds Carrie Sue and Thad Jamison plan their first Christmas together, Thad must leave to track a gang of vicious bank robbers through the Montana wilderness. Will he return in time to receive a very special Christmas gift?Circle of love by Carol FinchStruggling to survive in the aftermath of the War Between the States, Pilar Maguire feels nothing but envy toward her handsome neighbor and his grand house on the hill... until he helps her remember the true meaning of Christmas.Texas magic by Emma MerrittHannah Driscoll only married Wade Carmichael to help save the town of Mistletoe, Texas. But will the holiday spirit turn their business arrangement into a whirlwind of passion and joy?Cheyenne mistletoe by Georgina GentryThe first winter after the land run, Genevieve Malone barely has enough to keep her family going, but when a half-breed drifter seeks shelter on a snowy December night, she welcomes him into her home— and her heart.Tidewater promise by Jo GoodmanVirginia beauty Courtney McClellan has lost her faith in happily-ever-after... until a childhood friendship blossoms into a once-in-a-lifetime love.Cactus and thistle by Evelyn RogersWhen Mattie Campbell leaves her Texas ranch to share a white Christmas with her late husband's family, she never ' expects to find sizzling romance instead of snow!",
        "author":"Janelle Taylor",
        "language":"English",
        "genres":["Anthologies,Christmas,Romance,Historical Romance"],
        "ISBN":"0821735896",
        "domainType":"book",
        "_version_":1718681524805566465},
      {
        "id":"896595",
        "name":"An Affair Before Christmas (Desperate Duchesses, #2)",
        "rating":3.59,
        "publishYear":2007,
        "publishMonth":13,
        "publishDay":11,
        "publisher":"Avon",
        "countsOfReviews":414,
        "pagesNumber":400,
        "description":"Magic under the mistletoe...One spectacular Christmas, Lady Perdita Selby, known to her friends and family as Poppy, met the man she thought she would love forever. The devilishly attractive Duke of Fletcher was the perfect match for the innocent, breathtakingly beautiful young Englishwoman, and theirs was the most romantic wedding she had ever seen. Four years later, Poppy and the duke have become the toast of the ton... but behind closed doors the spark of their love affair has burned out.Unwilling to lose the woman he still lusts after, the duke is determined to win back his beguiling bride's delectable affections...and surpass the heady days of first love with a truly sinful seduction.",
        "author":"Eloisa James",
        "language":"English",
        "genres":["Romance,Historical Romance,Historical,Historical Fiction"],
        "ISBN":"0061245542",
        "domainType":"book",
        "_version_":1718681528566808576},
      {
        "id":"911551",
        "name":"Stargazy Pie",
        "rating":4.14,
        "publishYear":2002,
        "publishMonth":5,
        "publishDay":11,
        "publisher":"Arrow Books",
        "countsOfReviews":15,
        "pagesNumber":400,
        "description":"There’s nothing quite as strange as other people’s families.The invitation to spend Christmas with her boss Davey Stanton’s family gets Poppy inextricably entangled in the family politics and convoluted machinations of a group of Cornish eccentrics who come complete with their own witch. And then there’s the tempting problem of Davey’s gorgeous younger brother.",
        "author":"Laura Lockington",
        "language":"English",
        "genres":["Chick Lit,Fiction,Romance"],
        "ISBN":"009941676X",
        "domainType":"book",
        "_version_":1718681534385356800},
      {
        "id":"935154",
        "name":"Underneath The Mistletoe",
        "rating":3.37,
        "publishYear":1998,
        "publishMonth":1,
        "publishDay":12,
        "publisher":"Zebra",
        "countsOfReviews":2,
        "pagesNumber":256,
        "description":"Yule log blazing on an open hearth, an angel-topped tree sparkling in all its holiday finery, Christmas is a time for dreams to come true, for longings to be fulfilled, and for three young ladies to find the extraordinary gift of love in an anthology brimming with merriment and romance.In Alice Holden's Beneath the Mistletoe, an accident on an icy road brings a dashing young army officer to Megan Wyndom's remote little cottage, igniting bitter memories of a family disgrace and sweet kisses stolen in happier times. In Monique Ellis' The Year Father Christmas Came Calling, a bold burglary at a country inn brings a handsome world-weary Lord to Sarah Forte's doorstep, where he soon finds him-self playing Father Christmas to a disarming group of orphans and the enchanting young woman he longs to make his Lady. In Paula Tanner Girard's Lady Emelia's Christmas Party, a raging snowstorm strands five strangers at Badger Hall, where an eccentric old housekeeper playing the grande dame entwines the hearts of two reluctant lovers.",
        "author":"Monique Ellis",
        "language":"English",
        "genres":["Regency Romance,Christmas,Historical Romance,Anthologies"],
        "ISBN":"082176070X",
        "domainType":"book",
        "_version_":1718681541191663616},
      {
        "id":"946664",
        "name":"Christmas Dreams: Four New Love Stories from Christmas Present",
        "rating":3.5,
        "publishYear":1997,
        "publishMonth":1,
        "publishDay":9,
        "publisher":"Barbour Publishing",
        "countsOfReviews":7,
        "pagesNumber":347,
        "description":"Evergreen ~ Rebecca GermanyTo fill the void of her first holiday alone. Nora, a string reporter for the local paper, agrees to do a story on the homeless shelters -- accompanied by a certain rakishly handsome photographer. Is Rick Thompson too good to be true, or is he the man of her dreams? Search for the Star ~ Mary HawkinsTo Jean Drew, Christmas is a time to work, not spend with family. Until this year, that is, when she's invited to spend the holidays with her niece -- and then to witness her wedding. Also on the guest list is Dr. Jonathan Howard, a man who once embodied all of Jean's dreams. Could they have another chance at love? The Christmas Wreath ~ Veda Boyd JonesJennifer Faucett is dwelling in the past, not dreaming of the future, as she prepares to spend one last Christmas in the home of her recently deceased grandmother. Next door, Mike Shannon. now a successful novelist, has come seeking peace and quiet -- and finding neither when he encounters the woman of his dreams. Christmas Baby ~ Melanie PanagiotopoulosChristmas amid the ruins in Athens, Greece, on the arm of a modern-day Adonis, sounds like a dream vacation. But there's a much more poignant reason for Christina Rallis's visit: She's come to meet her birth mother. Christina's Christmas dreams seem destined to come true...until she realizes she may have to make an unthinkable sacrifice.",
        "author":"Rebecca Germany",
        "language":"English",
        "genres":["Christmas,Romance,Christian,Christian Romance"],
        "ISBN":"1577480821",
        "domainType":"book",
        "_version_":1718681543420936193},
      {
        "id":"968356",
        "name":"Comfort and Joy",
        "rating":3.77,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":11,
        "publisher":"Zebra",
        "countsOfReviews":42,
        "pagesNumber":478,
        "description":"Curl up by the Yuletide with these heartwarming stories that add a touch of wonder to your holidays. . .\"Comfort and Joy\" by Fern MichaelsEver since Angie Bradford took over her mother's gift wrap business in the Eagle Department Store, she and handsome store chief Josh Eagle have been at odds. When Josh threatens to give up on the business and move to London, and a devastating storm may destroy their Christmas season, Angie never expects help to come in the form of a holiday miracle. . .\"A High-Kicking Christmas\" by Marie BostwickAfter ten years as a Rockette at Radio City Music Hall, Kendra Erickson needs a break from Christmas. But when an injury lands her in small-town Vermont where she finds herself directing the local holiday pageant alongside the charming new pastor, Kendra reconsiders her views on life, love--and the most romantic season of all. . .\"Suzanna's Stockings\" by Cathy LambWhen an accident lands Suzanna Everts in the hospital for Christmas this year, she'll need a little magic to save the holiday season. Enter sexy, but Scrooge-like, land developer Jack Benson to the rescue, proving to Suzanna that the best gifts are those that take you completely by surprise. . .\"Family Blessings\" by Deborah J. WolfTired of dealing with her squabbling family, Kacey would rather not be home for the holidays. But Christmas memories hold a special power that is enough to remind a family of the blessings they share--and awaken Kacey to the promise of new love. . .",
        "author":"Fern Michaels",
        "language":"English",
        "genres":["Christmas,Romance,Fiction,Anthologies"],
        "ISBN":"0821780484",
        "domainType":"book",
        "_version_":1718681548758188032}]
  }}