{
  "responseHeader":{
    "status":0,
    "QTime":10,
    "params":{
      "q":"fast read",
      "defType":"edismax",
      "indent":"true",
      "qf":"reviews",
      "fl":"*, score",
      "q.op":"OR",
      "rows":"10"}},
  "response":{"numFound":187,"start":0,"maxScore":1.4182518,"numFoundExact":true,"docs":[
      {
        "id":"678863",
        "name":"American Outrage",
        "ISBN":"044657743X",
        "rating":3.39,
        "publishYear":2007,
        "publishMonth":25,
        "publishDay":4,
        "publisher":"Grand Central Publishing",
        "countsOfReviews":46,
        "pagesNumber":306,
        "description":"Jake Carlson, a correspondent for the TV news show AMERICAN OUTRAGE, inhabits a world of sensational trials and crazed celebrities. One of the nation's top journalists, he's used to dragging himself into the dirt to get the truth. When his adopted son Sam asks him to use his muckraking talents to find his birth mother, Jake is stunned by the ugly secrets he uncovers: an international crime syndicate, a horrifying child trafficking ring, and a corrupt politician, the patriarch of an old New York financial dynasty. Initially galvanized by a career-making story, Jake---and his son---are soon the victims of brutal violence and the targets of Jake's fellow reporters, who dog them for their story. Concerned for the survival of his family, Jake realizes some sins of the past should never be uncovered...",
        "author":"Tim Green",
        "language":"English",
        "genres":["Fiction",
          "Suspense",
          "Audiobook",
          "Adult"],
        "reviews":["American Outrage is about a boy who asks his adoptive father, a journalist, to find his biological mother. What the two hadn’t expected were the death traps they would have to avoid to find the answer. American Outrage could have been a great book had the editing been better. ",
          "What happens when a television journalist becomes the story. Jake Carlson and his son Sam try to find Sam biological mother only to get mixed up with the Albanian mob and a very powerful political family.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t",
          "Trashy TV guy, tired of the biz, tries to find his adopted son's real mom, good characters, too formula like, weak end.",
          "ExcitingI just discovered Tim Green I've finished 2 books,can't wait to start anotherI used to think he was a terrific sports writer but now I know he's so much more",
          "Finally finished it. ",
          "Good story but sometimes I wasn't sure exactly what they were talking about and the kid in the story sounds totally unappealing. Yikes...",
          "The untold story is sometimes the most important… Working as an investigative reporter and celebrity host on American Outrage, Jake Carlson’s life is out of control. His job is uncertain, he’s recovering from the death of his wife and his adoptive son, Sam, is not adjusting well. Jake doesn’t have enough to go around. Trying to be everything to everyone, father and son occasionally exchange harsh words. Feeling ignored, thirteen year old Sam asks dad to find his real mom. When a series of unexpected, dangerous and mysterious events unfold, their bond of love becomes the only link. Jake’s search for truth begins while on assignment. Close to the town where Sam’s adoption took place, he stops by the old office. The investigation turns discouraging when the space is occupied by a travel bureau. Jake inquires about the adoption agency, but no one seems to know anything. When he returns the next day, the travel agency has disappeared!Many miles away, Sam is at home with the housekeeper. Frequently he calls dad for the latest information, but Sam still feels left out. When Jake runs into a dead end, Sam comes up with valuable information off the internet, and then he vanishes. Panicked, Jake blows a vital interview for American Outrage and endangers his job. But when Sam shows up in Jakes motel room, things take a risky turn.Jake has been threatened, chased and shot at. Utilizing past friends and FBI contacts he stubbornly pursues all leads. Fearing the worst, he arranges for Sam to stay with a relative. However, when his dad goes missing, Sam won’t give up and starts a search on his own. The web of deception is ever expanding. Falsified documents, white baby markets and high society cover-ups make the truth difficult to untangle. Who can be trusted? Who has the real answers? Will Sam want to hear them? Worst of all, who will become the next severed head and two hands in a bowling bag?American Outrage is full of suspense at every turn. Hang on and fasten your seatbelt! ",
          "As host of the TV news show American Outrage the widowed Jake Carlson is an expert at digging up the truth behind the real story. When his teenage adopted son, Sam, asks Jake to track down his birth mother Jake grudgingly agrees. Sam has been acting up in school lately and Jake thinks finding his birth mother might bring Sam some peace. The further Jake digs the more he reveals shocking evidence of crimes including illegal baby trafficking and a long line of cover ups in one of New York's wealthiest political families. Jake and Sam get caught up in a dangerous game with players who will stop at nothing to keep the truth from being revealed. I enjoyed listening to the abridged version of American Outrage and thought it was a great story but just a little too predictable. I saw situations coming from a mile away and even correctly guessed the ending but I still felt that it was worth my time. Jake is endearing as the caring Dad who is trying to do right by his son and Sam is an annoying know-it-all with a potty mouth but Green makes it work within the story line. What I also liked about the story is that when all was said and done",
          "Jake Carlson merupakan seorang selebriti televisyen yang kini menerima cabaran untuk mengekalkan populariti dan kewibawaannya. Masalah peribadi juga turut menghimpit Jake. Bukan sahaja isterinya meninggal dunia akibat kanser, malahan, anak angkatnya, Sam juga mempunyai masalah disiplin di sekolah. Tambah merumitkan keadaan, Sam meminta ayahnya untuk mencari ibu-bapa kandungnya yang sebenar. Dengan perasaan yang bercampur-baur, Jake bersetuju untuk memenuhi kehendak Sam. Tetapi, misi ini bukanlah sesuatu yang mudah. Pencarian mereka ini terpaksa menempuhi jalan yang sangat berbahaya. Mereka diburu oleh sebuah kumpulan ala-Mafia Albania. Selain itu, terdapat juga usaha untuk menghalangnya oleh seorang senator Kongres Amerika Syarikat yang khuatir nama baik keluarganya terjejas sekiranya terbongkar siapakah ibu-bapa Sam yang sebenar.Secara keseluruhannya, masih lagi boleh dianggap menghiburkan untuk dibaca. Terdapat beberapa twist yang tidak dijangka. Jalan dan plot ceritanya juga bersifat fast-paced dan tidak kompleks. Namun demikian, apa yang kurang saya berpuas hati adalah penamatnya yang boleh saya kelaskan sebagai anti-klimaks.",
          "American Outrage TV reporter, Jake Carlson is the best at what he does. Maybe that’s why his adopted son, Sam has asked him to locate his real mother. Jake would do anything for his son, so he agrees. Jake starts digging around to find out what he can about Sam’s biological mother. What Jake soon discovers is an illegal adoption ring that involves a dirty politician. Now everyone Jake holds near and dear to him is in danger including himself. Jake is the type of guy you want fighting on your side. He stands for everything that is right, no matter how terrible the times get. American Outrage is a high-intensity, thrill ride a minute. The story moves so fast that you will find yourself lost in the moment. American Outrage is the first book I have read by Tim Green and it won’t be the last. All I can wonder is where was Mr. Green when I was in my reading slump? Well now that I have read what Mr. Green has to offer, I plan on checking out all of his other works including his next novel, Above the Law. ",
          "Television tabloid news reporter Jake Carlson's career is in a major downslide. His wife died a year ago and now their adopted son, Sam, is in trouble at school. When Sam asks Jake's help in finding his biological mother, Jake uncovers secrets that powerful people want to keep at any cost. Fast-paced suspense that keeps you guessing until the end. A likeable main character that could start a series for Green. Highly recommended.",
          "Tim Green [former NFL player:] has evolved. His first book was completely about football. Then he went to football and crime but this one never mentions the 'F' word [football that is:]. I've enjoyed all his books to a degree, but especially those as he got away from the game and more into murder and mayhem! ",
          "Wow, what a let down. I somehow thought this book was going to be a comment on shows that exploit people in crisis. Instead it was nothing but a fairly pedestrian thriller that was a bit laughable. You can practically hear the grinding as the plot wheels turn. Not worth it. Glad it was a library book.",
          "This book was quite excellent! I tried to read it as slowly as possible so that it would not end but we know that everything must come to an end at some time. The characters were well developed. The kid actually made me angry. However his inability to follow instructions got him into a lot of trouble yet in the end he learned to enjoy the hand life had dealt him. ",
          "Jack Carlson, famous TV personality, goes looking for his adopted son's mother, only to find himself in the middle of a child smuggling ring that is connected to a prominent , wealthy politician. As the story unwinds, Carlson goes from curious to suspicious. The story moves quickly and keeps you guessing. Green is a good writer who can tell a compelling tale",
          "Fairly good book about a TV interviewer helping his adopted son look for his biological mother. Best part was the juxtaposition of the brainless topics of the interviews (totally typical of current TV interviews) with the strong emotions of the son in hoping to find his mother.",
          "What begins as an adopted son’s innocent query about his birth parents leads TV reporter Jake Carlson on a dangerous trail that includes corrupt politicians and Albanian mobsters. Listened on audio and tuned out at times because it did go on. American Outrage is the name of Jake's TV show. ",
          "This book was only okay. I liked the mystery aspect, but I didn't like the ending and I didn't think that the book really needed to be this long. I didn't like most of the characters and the plot was only half interesting. ",
          "This was a good read except I felt it to be a little contrived. Good but not great.",
          "Bought this at the Albuquerque airport and read it on the way home. It kept me interested.",
          "Very Good; tabloid reporter father tries to help son track his birth parents and end up stumbling into a conspiracy or two",
          "strong lanuage warning!!!a multi-mystery story that intwines for a son and his father.",
          "Checked out from the Gates Library. Yup! Another good one from Tim Green! He expanded a bit this time; no lawyers. This one is about adoption, Albanians and the world of TV media.",
          "Tried to listen to the audiobook, but gave up 1/2 way through disc 3. Don't know if it was the narrator or what, but it just didn't flow. Better stuff on smashwords."],
        "_version_":1719036481610186752,
        "score":1.4182518},
      {
        "id":"839728",
        "name":"The Slave-girl from Jerusalem (The Roman Mysteries, #13)",
        "ISBN":"1842551884",
        "rating":4.09,
        "publishYear":2007,
        "publishMonth":1,
        "publishDay":4,
        "publisher":"Orion Children's Books",
        "countsOfReviews":20,
        "pagesNumber":230,
        "description":"This exciting adventure recreates the siege of Masada and reveals important developments in Jonathan's struggle with his guilt over past events. Also, there's terrific insight into the workings of the Roman legal system in a page-turning court room drama. As ever, Caroline Lawrence spings new surprises for all the characters and provides motives, means and opportunities for one determined felon. And, as ever, it's up to the four young detectives to crack the case.",
        "author":"Caroline Lawrence",
        "language":"English",
        "genres":["Historical Fiction",
          "Mystery",
          "Historical",
          "Fiction"],
        "reviews":["the slave-girl is an interesting character who basically has nothing to do with the book. She hardly even talks. As for Merriam, I thought that no one really cared about her in this book at all. She's a very set aside character.",
          "Flaccus makes his debut as a new lawyer when a Jewish slave friend of Miriam’s is accused of murder, and lacking manumission evidence, by an accusing inheritance hunter. A wealthy landowner dies under mysterious circumstances setting a string of events in action. Two murders follow this death. Ostia and Rome are in uproar at a triple homicide with only one suspect, the slave girl. In this book we discover that Nubia hasn’t actually been freed by Flavia from slavery as she thought because the proper process wasn’t followed and Flavia is only a child and didn’t have recognised ownership. Nubia finds herself hiding from the police. Jonathan is beset with nightmares about his funeral and all the children make wills. At the court hearing a terrible betrayal by a friend is exposed as the two neighbouring households on Green Fountain Street have their secrets exposed to the whole Ostia and are humiliated publicly. The book starts slow and picks up pace at the end. ",
          "Really a wonderful story with so many good pieces of the mystery built well together. Again I'm amazed at the cultural information and historical practices that I learned bits and pieces of through this series.",
          "This is a great book which leads you from Ostia to Laurentum to Ostia etc. My favourite part was the end which is a big twist I didn't expect. I enjoyed every moment of it.",
          "Ohmygod. One of the best, and definitely a more grown-up story. Unexpected ending. Wow.",
          " Excellent, action packed read! ",
          " It is a fast paced thriller. "],
        "_version_":1719036482104066048,
        "score":1.3993812},
      {
        "id":"884766",
        "name":"Prince Of Fire (Gabriel Allon, #5)",
        "ISBN":"1596000236",
        "rating":4.2,
        "publishYear":2005,
        "publishMonth":22,
        "publishDay":2,
        "publisher":"Brilliance Audio",
        "countsOfReviews":10,
        "pagesNumber":10,
        "description":"Few recent thriller writers have elicited the kind of critical praise that Daniel Silva has received, with his “provocative and deeply satisfying” (The Miami Herald) novels featuring art restorer and sometime spy Gabriel Allon, “a man whose depth and passion make him one of the most fascinating characters in the genre” (Chicago Sun-Times).Now Allon is back in Venice, when a terrible explosion in Rome leads to a disturbing personal revelation: the existence of a dossier in terrorist hands that strips away his secrets, lays bare his history. Hastily recalled home to Israel, drawn once more into the heart of a service he had once forsaken, Allon finds himself stalking an elusive master terrorist across a landscape drenched with generations of blood, the trail turning on itself until, finally, he can no longer be certain who is stalking whom. And when at last the showdown comes, it will not be Gabriel alone who is threatened with destruction—for it is not his history alone that has been laid bare.A knife-edged thriller of astonishing intricacy and feeling, filled with exhilarating prose, this is Daniel Silva’s finest novel yet.",
        "author":"Daniel Silva",
        "language":"English",
        "genres":["Fiction",
          "Thriller",
          "Mystery",
          "Espionage"],
        "reviews":["The end is the best part of this novel. The toll of lives along the way is painful. 5 of 10 starsI reread this and deem it worthy of 3 stars instead of my original 2. Overall, 6 of 10 stars",
          "“We have prayed for impossible things. Peace without justice, forgiveness without restitution, …love without sacrifice.”In “Prince of Fire”, the 5th novel in the Gabriel Allon series, you can tell that the author, Daniel Silva, has had it with Palestinian terrorism. He broaches the topic in a very different manner than he did in the first novel in the series.In this text, Silva unflinchingly depicts Yasir Arafat for what he was…a two-bit terrorist whose goal was the extermination of the Jews. Arafat is given the unflattering portrait he deserves in this book. Silva makes clear that Arafat’s rejections of peace cost many people their lives. However, what makes Mr. Silva such an interesting writer is that he turns that unflinching eye on both sides of the conflict. He details the Palestinian grievance in Israel with honesty and truth, which does not often happen in books that deal with this issue. An Israeli character gives his reasoning for the brutal expulsion of some Arabs from their homes in 1947/48 and you the reader can hear his argument and decide for yourself what to make of it.I have propelled thru this series because Dan Silva is a good writer and a good storyteller. In the world of thriller fiction, that is a rare combo. Some examples from “Prince of Fire” include a section where the protagonist (Gabriel Allon) analyzes the case he is working on in the same manner he would a piece of art that he is restoring. It is an excellent analogy and the writing in this section is top notch. In another section, a victim of Hamas terrorism gives a bitter and passionate account of a bus bombing that is chilling to read.This series keeps getting better. I will be sure to move on to number 6 soon! ",
          "Another good one. Going to have to take a break from this series. Am beginning to suspect even the dachshunds are spies.",
          "Shortly before his departure he dressed in one of Herr Klemp’s egregious suits and stalked the discos and nightclubs along Sheinkin Street in Tel Aviv. Herr Klemp was all that he, and by extension Mario Delvecchio, was not – a loquacious bore, a womanizer, a man who liked expensive drink and techno music. He loathed Herr Klemp, yet at the same time welcomed him, for Gabriel never felt truly safe unless wearing the skin of another man…Gabriel Allon is in Venice, working as art restorer Mario Delvecchio, and living with Chiara, daughter of the chief Rabbi, when the Israeli Embassy in Rome is the target of a car bomb, followed by gunmen firing on those attempting to escape. When Italian authorities track the perpetrators to an abandoned apartment in Milan, they find there an encrypted CD, which they hand over to Tel Aviv. Decoded, it holds a dossier on Gabriel with photos of him and Chiara in Venice. The pair are recalled to Israel, and under the watchful eye of former spy-chief, Ari Shamron, Gabriel assembles a team to hunt the mastermind behind the Rome attack, and it is Dina who suggests a link to the Black September terrorist group. Gabriel goes undercover as a German businessman",
          "Fast-paced and action packed entertainment.",
          "This is not the best book that Silva has done. There is lots of history in this book. Most of this is correct and it is in keeping with what actually happened in the Israeli/Palestinian conflict.Unfortunately, it takes away from the story. The story almost seems secondary to the historical perspective of the story line. Even though it is a Gabriel Allon book, it seems that there is lack of focus in this book, where it drifts along. Not as focused or as quick moving as the rest of the Silva books!However, it is a part of the development of the Allon character books. That was fun and was worth the read. But, this is far from Silva's best work!",
          "Another great entry in the Gabriel Allon series. ",
          "It is difficult and somewhat arrogant for someone like me---a well-off middle-income American Christian suburbanite from Ohio---to have an opinion about the Middle East, especially in regards to the Israeli-Palestinian issue. I don’t even know what to call it, so I’ll just call it an “issue”. (Is “war” appropriate? Is “hatred” accurate? Is it politically incorrect to call it “genocide”? What the hell do you call it without offending either or both sides?)There’s so much I don’t know or understand about what is going on in the Middle East, mainly because there is so much I don’t know or understand about what is going on in my own country most of the time that the events happening hundreds of thousands of miles away, across the ocean, are all just white noise. I hate to say that, but it’s the truth.I like to pride myself on being someone who tries to stay current with what is going on in the world, but most of the time---and especially lately---I have had this frantic isolationist approach to the world. I just want to hole up with my wife and daughter, “bunker down”, stay socially distant, and the government’s “recommendation” to stay at home is strongly influencing these thoughts.Silver lining: I’m getting a lot of reading done, especially of some books that I had set aside, with every intention of someday reading them. Now that libraries and bookstores are closed, that “someday” is now.I was, a few months ago, on a Daniel Silva reading kick, and then I just stopped for no apparent reason. So, I’m picking up where I left off, which was the fifth book in his series featuring Israeli super-spy Gabriel Allon, “Prince of Fire”.After a Jewish embassy is bombed in Rome, leaving many dead, Allon is called in to spearhead the manhunt of the person or persons behind the bombing. Allon is given a hand-picked team, under the supervision of his boss and mentor, Ari Shamron.Connecting dots of similar bombings---a community center in Buenos Aires and a synagogue in Istanbul---and significant dates that are too significant to be coincidental, Allon’s team discovers that the man behind the bombing is a man whose very existence has been reduced to a myth, a man who has been shaped by a violent history between Palestinians and Israelis.It is a history in which Allon is complicit, and one for which he feels some guilt. It is a history, on the other hand, in which his boss, Shamron, takes pride. Shamron, like his Palestinian counterpart, Yasir Arafat, are part of the old-school hard-line militants, slowly dying off, but not slow enough for Allon.Going into further detail would be spoilers, but it’s needless to say that Silva has written another fast-paced edge-of-the-seat espionage action thriller, one that tackles timely subjects in an intelligent and compassionate manner.",
          "Best of the series...in my opinion ",
          "This is a more serious book than any of the later books in the series (at least, of the ones I've read). Daniel Silva is more evidently on a soapbox, linking more of the story's fiction to his version of history and reality. Unfortunately, this reminds me of efforts such as The Da Vinci Code in which the author professes that the fiction is based on facts --- but which facts, and whose interpretation of facts? As with the scientific method, which eschews all aspects of bias in its blind test, any hint of tainting invalidates the results. And so I can only approach such books as Prince Of Fire as entertainment, discounting whatever the author claims to be truth.Taken in this light, the novel is engaging, in the nature of a frivolous feel good action movie, where good prevails over evil, and the righteous are justified. Silva writes with a panache that is quite apt for spy thrillers. His is opposite the tongue-in-cheek machinations of Ian Fleming, hewing more to John le Carré and filled with gravitas, quite sure of his message and purpose.Here, the main protagonist, Gabriel Allon, an Israeli assassin who is also an expert art restorer, is set to end his career. His wife, the victim of a terrorist attack meant to kill him, is abducted, in a delightfully convoluted plot by master jihadist Khaled. With the skill of a trained killer, Allon escapes the trap set by Khaled, saves his wife, and kills some terrorists. Silva's writing is spare and hi-res clear, placing readers in the middle of the action. The rest of the book seems to be a setup for the retirement of Allon, with an offered promotion to operational administration of the Israeli spy service, the return of his wife's memory and the departure of his young lover, Keira, and his relocation to Jerusalem. But, of course, we know that retirement for Allon is far in the horizon as the number of follow up books featuring this popular hero attest. The book concludes with an uninspired (from the writing viewpoint) assassination by Allon of Khaled. This last seems a superfluous element but underlines the author's concept that the cause represented by his main character Allon is just with closure achieved only by a victorious Prince of Fire."],
        "_version_":1719036481702461440,
        "score":1.2938724},
      {
        "id":"608385",
        "name":"Cam Jansen and the Triceratops Pops Mystery (Cam Jansen Mysteries, #15)",
        "ISBN":"0142402060",
        "rating":3.96,
        "publishYear":2004,
        "publishMonth":22,
        "publishDay":7,
        "publisher":"Puffin Books",
        "countsOfReviews":26,
        "pagesNumber":64,
        "description":"The Cam Jansen series is perfect for young readers who are making the transition to chapter books. The first ten books in the series have received updated covers, bringing new life to these perennial bestsellers. Now the series redesign continues with five more books, giving Cam a cool, modern look!",
        "author":"David A. Adler",
        "language":"English",
        "genres":["Mystery",
          "Childrens",
          "Chapter Books",
          "Fiction"],
        "reviews":["Determined to buy the latest CD from her favorite band, the Triceratops Pops, fifth-grade sleuth Cam Jansen and her best friend Eric Shelton head to Ernie's Everything in Music and Video store. There they discover that all of the CDs are missing, even though an employee just put them out minutes before. Convinced that a thief is at work, Cam is on the case...First published in 1995, Cam Jansen and the Triceratops Pops Mystery feels quite dated - more dated even than the titles in this series from the 1980s, given the focus on a store selling video tapes, as well as on a video rental store. Beginning chapter-book readers today probably haven't ever seen a video tape! Leaving that aside, this was a fun entry in the Cam Jansen Mystery series, in which the eponymous heroine uses her photographic memory to solve crimes. The scenes with Jordan, the music store employee, and his discussion with the lady who wanted helped finding a CD whose name she couldn't remember, were particularly funny for me, as someone who has worked in retail. I'm not sure the target audience will find it as entertaining as I did, but it certainly added to my own enjoyment. Recommended to Cam Jansen fans, and to beginning chapter-book readers who enjoy mysteries.",
          "So this was partially my fault for not reading what the story was about before reading it, but it is not about a triceratops much to my 4 year old’s dismay. Other than that though, my daughter still seemed to enjoy it and kept asking for one more chapter. It is kind of a blast from the past with the mention of tapes and cassettes but my daughter didn’t seem confused so all was well. Overall a cute story that held a toddler’s attention which is a plus in my book. ",
          "Genre: Juvenile fiction, mysteryFormat: PrintPlot: Cam Jansen is at the mall when a CD thief strikes. Her photographic memory helps save the day (as usual!).Readers advisory: Review citation: 1998 Horn Book Guide ReviewsSource: Best books for childrenRecommended age: 7-9",
          "Age 7-10Grade: 3rd Genre: Mystery This mystery book is one of many adventure chapter books that young readers can read and learn from. I chose this book because in it, students can not only learn that stealing is a crime that should come with consequences, but that it is good to share with higher authorities if anyone has stolen something. This not only helped make things right, but it also brought about rewards for Cam and her friend Eric who helped solve a crime. I plan to have books like this one in my classroom so that students can not only engage in mystery books, but also glean from themes that teach life lessons revolving around the importance of having integrity and good morals.",
          "Cam was going to the store to buy a new Triceratops Pops CD, but they were all gone. At the same time that they looked, a man was leaving the store and the security gate beeped. It only beeped because he had a CD from a different store. The security guard checked all of his bags. Cam figured out who stole the Triceratops Pops CDs. Turns out it was the same guy who made the security gate beep. He had two bags and one had a watermelon filled with CDs in it. His watermelon broke open and they found all of the missing CDs and some watches. The police came and took over for the security guard. Cam got a FREE Triceratops Pops CD and Eric got a free Ripe Banana CD as a reward. ",
          "This is the first Cam Jansen book I read, and I think it's a great early chapter book for boys and girls alike. This one might not be the best choice for students today, however, because there are a lot of things in this book that children today won't be familiar with... VHS tapes, movie rental stores, and buying CDs at a store.",
          "Triceratops Pops Mystery tells the story of how Cam, with her photographic memory, and her friend, Eric, find out how six of the same CDs go missing. Cam and Eric investigate the media store, notify authorities, and save the day.",
          "So there's these little things on the CDs so that the people can't steal them. But someone got a tape to trick a CD store into thinking that they didn't steal them and then they just disappeared. And then Cam Jansen figured out it was just a trick. ",
          "Good mystery book for kids. Fast read. Keeps you entertained looking for the bad guy and shows kids doing good might give you a rewards.",
          "Free CDs for Cam’s brave and amazing photographic memory!",
          "Six stolen CDsHollowed our watermelonRented tape censors",
          "Very dated with a video rental store and missing CDs and tapes",
          "Cam Jansen books are clearly written, fun mysteries for kids. I bought this one for my 8-year-old brother who reads a bit higher than his grade level and it's perfect. It has good pacing and well-balanced storytelling with a nice mix of vocabulary words for its intended age range.",
          "This book was a fun read for my second-grade son, although he had no idea what a video store or a music store were. ;)",
          "This is an entertaining mystery in the Cam Jansen series by David A. Adler and Susanna Natti. We've read most of these books and have really enjoyed them all. This was a tricky mystery to solve and although I saw it coming, our girls were stunned. It's an entertaining story and we are looking forward to reading the few we haven't read yet. I found it interesting that this story features a music/video store. I doubt our girls have ever really spent much time in a store like this and most of our videos and music come online now. It's a bit of an older story, but still interesting. ",
          "The Cam Jansen series is perfect for young readers who are making the transition to chapter books. Although, I think this book is suspenseful enough on its own for children to be excited to read. I also think that this would be a worthy book for a teacher to read to the class, perhaps at the end of the day. Since some chapters end with a cliffhanger, teachers may find it useful to read a few chapters each day to students. Also, this would be a helpful book for teachers to use as an example for some mini-lessons (leads, suspense, foreshadowing/predicting, etc.). Also, if readers are interested, you can encourage them to continue reading more Cam Jansen books by David A. Adler since this book is part of a series. ",
          "-A Puffin BookAges 7-10Time 10/8 30 min-7-word summary  CD,popular, singer, stolen, a boy,a girl, findDiscussion Question1, The main charactor has a special avility called a photografic memory, which a persom remembers just about what she or he sees.I thik the ability is useful to remember students' names when I become a teacher.So, if you had such an avility what would you like to do?2,This story is taken place at CD shop,and charactors are of ten talk about music,So,Who is your favorite singer?",
          "This was a cute book as part of the Cam Jansen series. While at the mall to get the latest Triceratops Pops CD, Cam and her friend Eric find that a thief has stolen all of them. With the aid of Cam's photographic memory and some smart thinking by Eric, they of course figure out who stole the CDs and manage to help catch him.My 6 year old enjoyed it, but I think she has liked other Cam Jansen books more. She usually will read the entire thing in one sitting, and didn't with this one.",
          "So once again being a second grade teacher allows me to read cute little books like this. Although i am looking forward to sharing it with my class and seeing how they react to the story. It is based around a video rental store that sells VCR tapes. :) Might have to bring some in so they can see what the story is referring too. ",
          "There is triceratops pops music and somebody stole all six of the CDs. He cut into a watermelon and he put them inside and closed the lid. Cam solved it because he was running fast out of the store and it should have been heavy. ",
          "Cam Jansen goes to the record store to get her favorite bands new CD only to find that they are already gone. Cam and her friend witness some questionable behavior and suspect that the CDs have been stolen. It is a great story about morality and doing the right thing. ",
          "If you want a cd, save up 4 it!!!",
          "Someone stole the new triceratops new Cd and that person hid the copies of it in a watermelon.",
          "This is a cute series for kids. I would like to read the entire series....maybe...",
          "Light reading for 7-12 year old. 56 pages. A girl with photographic memory and her friend try to find the thief at CD stores. ",
          "all the triceratops cds are missing. when the man goes thru the metal detector it blinks and they find nothing on him. while he runs, he fell and the cds come out of the watermelon.",
          "camjansin",
          "Children's Reading Adventures Book Club, Summer 2014*D.E.A.R. Time -- Read with 8 & 9 year olds*06.05.2014"],
        "_version_":1719036482099871744,
        "score":1.2801455},
      {
        "id":"883056",
        "name":"Listen, Buddy",
        "ISBN":"0395854024",
        "rating":3.92,
        "publishYear":1997,
        "publishMonth":3,
        "publishDay":3,
        "publisher":"HMH Books for Young Readers",
        "countsOfReviews":68,
        "pagesNumber":32,
        "description":"Buddy's father had a beautiful big nose. He was a great sniffer. Buddy's mother had beautiful big teeth. She was a great chomper. Buddy had beautiful big ears. It didn't matter. Helen Lester and Lynn Munsinger have created eight children's books together. Munsinger's unparalleled animal characters and Lester's hysterical text have joined together to create another silly tale about a bunny who just can't seem to listen.Featuring bonus audio!",
        "author":"Helen Lester",
        "language":"English",
        "genres":["Picture Books",
          "Childrens",
          "Animals",
          "Rabbits"],
        "reviews":["Buddy was a rabbit with great big ears. His father had a beautiful big nose and a wonderful sense of smell. His mother had beautiful big teeth and could chomp carrots with the best of them. Unfortunately, Buddy’s beautiful big ears did not make him a good listener. Buddy got very distracted and so he just didn’t listen. His parents asked him to bring some squash home from the market; he brought a basket of wash instead. When they sent him for tomatoes, he came home with potatoes. His parents tried everything, talking louder, softer, standing right in front of him, but nothing seemed to work. One day Buddy’s parents gave him permission for his first long hop alone. He was so excited he didn’t listen to their warning, “At the end of the road, there are two paths. The path to the left will lead you around the pond and back home. But the path to the right will lead you to the cave of the Scruffy Varmint.” At the end of the road Buddy hopped right. Right into the Scruffy Varmint! Will Buddy survive his encounter with the snarling, mangy Scruffy Varmint or will he be made into bunnyrabbit soup?The message of this rollicking tale is that listening is important. Lester’s text is a mixture of snappy dialogue and fast-paced narrative, which keeps this book from sounding teachy-preachy. The characters are depicted humorously in the text and illustrations and the exaggerated results of Buddy's lack of listening will elicit many a giggle. Munsinger’s illustrations are brightly colored and pen and ink lines provide definition and detail. The anthropomorphic animals are dressed in solid colors and much is conveyed with facial expressions and body language. For all his faults, Buddy is an endearing protagonist and Munsinger never misses an opportunity to incorporate Buddy’s big ears into her compositions. Full Review at Picture-Book-a-Day: http://picturebookaday.blogspot.com/2...",
          "Lester, Helen Listen, Buddy, illustrated by Lynn Munsinger. PICTURE BOOK. HMH Books, 2013. (Original printing: 1995.) $8.99. Content: G.Buddy is NOT a good listener. When his dad asks him for a pen, for example, Buddy brings back a hen. And when his mother requests a slice of bread, well, he slices his bed instead. So it's no surprise that when Buddy is sent on an errand, he forgets which way he is supposed to go and ends up at the home of the Scruffy Varmint. But even the terrifying Scruffy Varmint can't get through to Buddy. Not until Buddy mishears something crucial and gets the fright of his life. That day Buddy learns how to run fast -- and how to finally listen.This is a cute story with a good lesson about listening. Children will delight in Buddy's silly misunderstandings and cheer for him when he finally gets it right. Contains a link to a free download of the audio version.Pre-K, EL (K-3) -- ADVISABLE. Reviewer: Caryn.",
          "Another clever story from Helen Lester. I love the characters that she creates. They are always so quirky and odd. Buddy, the rabbit with big ears and a problem with listening, is not exception. I really enjoyed the story and the Scruffy Varmint was very amusing. I felt bad for him, having to put up with such lousy help, but Buddy eventually learned a lesson, even if it was at the expense of the Scruffy Varmint's soup. ",
          "Oh how I hope this book sunk into the hearts of my children. I have felt like buddy's parents many times! Great, fun way to show kids the importance of listening...krb 8/6/16Read to dad, he liked it :)...krb 8/13/16",
          "we laugh out loud every single time we get to who get the what from the where side of the where what? so much fun to read and a good lesson as well",
          "This is a really great book about a bunny who has a hard time listening and his parents are frustrated. Great book about the importance of listening. Cute book",
          "Buddy learns about listening the hard way when he finds himself in a pickle.",
          "Title: Listen Buddy Author: Helen Lester Illustrator: Lynn MunsingerGenre: Predictable Theme(s): Rabbits, listening Opening Line/Sentence: Buddy’s father had a beautiful big nose. He was a great sniffer. Brief Book Summary: Listen Buddy is centralized around a bunny rabbit named Buddy. Buddy has very long, large ears but fails to listen and comprehend with whatever his parents ask of him. When Buddy decides to go out for a ‘hop’ into unknown territory, he ends up in trouble. He would have been able to avoid the trouble had he listened and remembered which direction to go down the path to safety as told to him by his parents. Buddy ends up making it home safely and pays closer listening attention. Professional Recommendation/Review #1: Phyllis Kenemer, Ph.D. (Children’s Literature)Buddy has big, beautiful ears, but he does not use them to listen accurately. He comes home from his errand to the vegetable stand with a basket of wash instead of a basket of squash; he buys fifteen potatoes instead of fifteen tomatoes; and he hands his father a hen instead of a pen. His parent’s constant request to Listen, Buddy goes unheeded. On the day that Buddy asks for permission to go on a long hop, his parents warn him about turning left at the fork in the road to avoid an encounter with Scruffy Varmint. Buddy does not hear them and hops right up to the varmint’s cave. Buddy offers to help Scruffy Varmint with his preparations for soup, not realizing that he is the intended main ingredient! Buddy hands Varmint briarwood instead of firewood, flowers instead of flour, and five inches of salt instead of five pinches. After all the confusing components have been added to the pot, Buddy obligingly throws the mixture in the fire when asked to put the soup on the fire. The angry varmint howls, I will have bunny rabbit soup. Buddy listens that time, and he hops home faster than he has ever moved in his life. From then on, Bunny listens! The attractive watercolor illustrations give personality to the characters and add to the humor. This is a fun choice for story time. Professional Recommendation/Review #2: Hazel Rochman (Booklist) Buddy is a daydreaming rabbit who never listens. When his mother asks for a basket of squash, he comes with a basket of wash. When his father asks for a pen, Buddy brings him a hen. One day Buddy meets the Scruffy Varmint monster, who nearly makes him into rabbit soup, but Buddy tricks and blunders his way out of trouble and wakes up to the world around him. Kids will enjoy the slapstick and the word jokes. Munsinger's joyful watercolors extend the farce of the disaster scenarios: in one wonderful scene we see that Buddy has sawed off a piece of bed when he's asked for a slice of bread. Use this with French's retelling of the old English folktale Lazy Jack, about a sleepy kid bewildered by adult instructions.Response to Two Professional Reviews:Both professional reviews point out the comedy that the book presents with Buddy failing to listen to the directions he is given. For example, Buddy brings potatoes instead of tomatoes. The reviews also pointed out close attention to the watercolor detailed paintings of the book. Although predictable, the book is fun and grabs the attention of the reader. The book teaches a valuable lesson about the importance of listening. Evaluation of Literacy Elements: As previously mentioned, the book has many rhyming words such as potato and tomato, squash and wash, and pinch and inch. The watercolor illustrations throughout the book are skilled and impressive. The plot is predictable. Buddy does not listen and then faces a time of conflict, which then makes him reconsider the importance of his listening skills. Consideration of Instructional Application:The most important takeaway from this book is about listening. If an individual does not listen to instructions or advice, they may end up in a position they do not want to be in. A listening activity with students would be beneficial. Giving directions only once as opposed to two, three or four times would be a way to improve attention, listening, and respect for the teachers and others.",
          "Am I the only one who is rankled by the lesson of this book? A bunny who has obvious difficulties in listening, constantly messing up, and they just let it continue with a 'Listen Buddy!' rant that even I was tuning out.No discussion of why he was having difficulties listening, what everyone could do to work through the problem. Instead, he's sent on a task that he obviously fails. From there, he ends up in scrape after scrape with a stranger, only 'learning' his lesson after the stranger threatens to eat him. Runs home and listens from that point forward.Just... what? For a kid who has difficulties listening, the only option is to be put in a dangerous situation where you could be abused or killed? There wasn't a more controlled environment to teach the kid that not listening could be dangerous? 'Don't worry, kids, your parents can be negligent too, but you better listen!'The only educationally appropriate mark I can give it is that it has a lot of repetition and wordplay to expand vocabulary, hence the 2 stars. ",
          "Even though Buddy has the BIGGEST, most BEAUTIFUL bunny ears, he isn't very good at listening. Need a slice of bread? Careful, you might get a slice of bed! Need a pen? Well I hope you like eggs, because Buddy will bring you a PEN! One day, Buddy gets to go on a long hop, but has to remember to listen to the directions. When the expected happens, Buddy's problem gets him into trouble with the Scruffy Varmint, who enlists his help making a stew. This is a fantastic read aloud to keep kids hanging on every word and to teach the idea of plot and problem in a story. This was my first ever read aloud to class, and it was magic to see those kindergarteners so engaged and interested in the story! A week later when we were reviewing it, I was so impressed with how much they remembered and had learned. Fantastic writing and illustrations. "],
        "_version_":1719036481826193408,
        "score":1.2173382},
      {
        "id":"854289",
        "name":"The Feathered Serpent",
        "ISBN":"1842326805",
        "rating":3.36,
        "publishYear":2001,
        "publishMonth":15,
        "publishDay":1,
        "publisher":"House of Stratus",
        "countsOfReviews":5,
        "pagesNumber":200,
        "description":"Reporter Peter Derwin suspects the card mysteriously left in the handbag of actress Ella Creed is a publicity stunt. But Joe Farmer, the boxing promoter, has received one too. Then, after leaving the house of millionaire philanthropist and African explorer Gregory Beale, Daphne Olroyd is followed. She is at her employers' offices when Leicester Crewe opens the front door. A dead man falls into the hall. In his hand is the card of The Feathered Serpent.aka Inspector Wadeaka Inspector Wade And The Feathered Serpent",
        "author":"Edgar Wallace",
        "language":"English",
        "genres":["Fiction",
          "Thriller",
          "Mystery",
          "Detective"],
        "reviews":["Major characters:Peter Dewin, crime reporterWilliam Lane, is he dead or isn't he?Ella Creed, self-absorbed actressJoe Farmer, boxing promotor; estranged husband of Ella CreedLeicester Bobby Crewe",
          "Not one of my favorite Edgar Wallace stories. It seemed like he was trying too hard to create a mystery out of nothing. The Mayan serpent symbol was a real stretch -- a contrivance that didn't add any interest to the story for me. I usually really like Wallace, but not this time. It wasn't the worse mystery I've ever read, but unlike Wallace's usual books, this was ho-hum.",
          "Who is the Feathered Serpent? What does he have to do with the death of various members of London society? Why is William Lane dead and yet appears to be alive?This is an enjoyable (if somewhat fast) romp through post World War I society.",
          "Meh.Ni likovi, ni radnja, ni zagonetke, a ni najvažnije, stil pisanja, mi nisu legli. Istina je da sam knjigu uzela za opustiti se i da nisam očekivala puno, ali sam ipak očekivala više.Imam još jednu njegovu knjigu na polici, ali ako ona bude ista, ne vjerujem da ću ih tražiti još.",
          "This book takes me back to my teenage years. Edgar Wallace was my step-up from The Saint and before that Biggles. Real Boys Own stuff with some outrageous coincidences but quite readable.",
          "Edgar Wallace has a fertile imagination when it comes to exploring the depravity of the human species. Like most of his books that I've read so far, this tale is a bit convoluted but still rather gripping. I actually had less trouble than normal keeping track of all the various characters, but I've learned that it pays to take notes whilst reading Wallace. Fortunately, with a kindle doing so is a breeze. So, we have ace reporter, Peter Dewin. He is following the trail of some crimes or potential crimes marked by the leaving of a card with a drawing of a feathered serpent on it. Some folks are getting these cards, and although they deny any understanding of the figure, they are none-the-less terrorized by having received said cards. One is Ella Creed, a famous actress. Another Leicester Crewe, a stock trader. Then there's Joe Farmer, who is a boxing promoter and someone who used to run a pub. Finally, we have Paula Staines, a woman who does very fine black and white drawings. What could be the connection, if any, between them, and why are they getting the feathered serpent cards? Are they warnings of some kind. Well, to learn more about feathered serpents, Dewin tracks down Gregory Beale, who is an archeologist/philanthropist, lately returned from a decade in Central America, or so he intimates anyway. Apparently, feathered serpents feature strongly in the mythology of the Maya and Aztec cultures. Beale has just hired Daphne Olroyd to be his private secretary. She had previously worked for Leicester Crewe. Dewin had met Ms. Olroyd at a restaurant and had almost immediately fallen in love with her. So, how does that all work out? Oh yeah, there is a mysterious William Lane, who was alleged to have been released from prison recently, but who apparently was killed by a car in an accident outside a house he and two of his companions were in the process of burgling. But, one of the former companions thinks he has seen Lane. Is it a ghost, or did Lane not die, despite there being a death certificate attesting that he had? How does that work? And so forth. It's an entertaining yarn with which to while away these dreary days of waiting for spring through endless dank days of drizzle. ",
          "Quaint and old-fashioned, with a hugely complex plot about secret societies and counterfeit money. It's delightful because of its multiple layers and twists. Wallace, according to the back cover, wrote 175 novels, 24 plays and there have been 160 films based on his novels. He died in Hollywood in 1932 while working on the screenplay for King Kong."],
        "_version_":1719036481772716032,
        "score":1.2025076},
      {
        "id":"753314",
        "name":"He Leadeth Me",
        "ISBN":"0898705460",
        "rating":4.48,
        "publishYear":1995,
        "publishMonth":1,
        "publishDay":2,
        "publisher":"Ignatius Press",
        "countsOfReviews":132,
        "pagesNumber":202,
        "description":"He Leadeth Me is the deeply moving personal story of one man's spiritual odyssey and the unflagging faith which enabled him to survive the horrendous ordeal that wrenched his body and spirit to near collapse. Captured by the Russian army during World War II and convicted of being a Vatican spy, American Jesuit Father Walter J. Ciszek spent some 23 agonizing years in Soviet prisons and the labor camps of Siberia. He here recalls how it was only through an utter reliance on God's will that he managed to endure. He tells of the courage he found in prayer-a courage that eased the loneliness, the pain, the frustrations, the anguish, the fears, the despair. For, as Ciszek relates, the solace of spiritual contemplation gave him an inner serenity upon which he was able to draw amidst the arrogance of evil that surrounded him. Learning to accept even the inhuman work of toiling in the infamous Siberian salt mines as a labor pleasing to God, he was able to turn adverse forces into a source of positive value and a means of drawing closer to the compassionate and never-forsaking Divine Spirit. He Leadeth Me is a book to inspire all Christians to greater faith and trust in God-even in their darkest hour.",
        "author":"Walter J. Ciszek",
        "language":"English",
        "genres":["Catholic",
          "Religion",
          "Biography",
          "Spirituality"],
        "reviews":["Rereading again for a class I'm giving our school's teachers on this amazing man...I can scarcely recommend a better read for this Year of Faith than Fr. Walter Ciszek’s follow-on to his autobiographical  With God in Russia.  He Leadeth Me is the book Fr. Ciszek wanted to write the first time, that is, it’s his spiritual journey as opposed to the factual story of his years spent behind the Iron Curtain, much of it in Siberia in labor camps, prisons and poor villages usually not serving openly as a priest—his faith constantly tested. If your faith has ever been – or is currently being – challenged this book will inspire you beyond anything you can imagine.The first eight chapters—approximately eighty pages—outline Fr. Ciszek’s initial assignment in Poland, trek into Russia, ordeal with the Soviet authorities, and deportation to Siberia. After that, although the book continues to follow Father’s almost unbelievable escape from one hostile situation after another, it is arranged in chapters with titles like: The Body, Faith, The Priesthood, Work, Humility, Freedom, The Kingdom of God, Humanity and The Fear of Death. This arrangement allows the book to be read either as a piece or selectively according to a chapter heading which you might want to refer to or reference for talk, research paper or your own spiritual benefit.Easily one of the 100 best books I’ve read in my life and one which I will return to often! READ IT! ",
          "One might think that the advice of a Jesuit missionary priest who served over 20 years in Soviet prisons to laypeople dealing with their own struggles might run something like, You don't have it quite so bad. On the contrary",
          "Father Ciszek's memoir of his imprisonment in the Soviet Union makes for compelling reading. His recounting of the continuing faith of Christians in the face of daunting persecution was inspiring. Especially impactful was the willingness of the men in hard labor camps, already grossly underfed, to fast when they had a chance to have communion. ",
          "ENGLISH: Impressive account of the imprisonment of a Jesuit priest in the Soviet Union, where he travelled to impart spiritual help to displaced Polish workers. Accused of being a Vatican spy, he spent four years in Lubyanka, eleven in labor camps in Siberia, and a few more, already free, but pushed from town to town, in Siberia. Finally he was exchanged for several Soviet spies and was able to return to his native country (the United States).This man managed to accept his sufferings, which he always interpreted as God's will for his life. Back in the USA, he has written his books to give testimony of his faith.The account of his captivity reminds me a lot of Solzhenitsyn's novel The First Circle",
          "My best religious book after the bible. I LOVE it and I keep reading it over and over. Highly recommended ",
          "Fr. Ciszek's account of his imprisonment in Russia, how he managed to survive, and what he learned about God is astonishing. In his own words: I felt that I had learned much during those years of hardship and suffering that could be of help to others in their lives. For every man's life contains its share of suffering",
          "THis book is AMAZING and I have to be honest: I will need to read this again to take it all in. It's the spiritual memoir of a priest who ended up behind the Iron Curtain at a time when it was extremely dangerous to be a priest in the Soviet Union. He ended up getting arrested, spending five years in solitary confinement enduring interrogations, was forced to sign a fraudulent confession, and then spent fifteen years in the Siberian labor camps. This book documents not the what of his survival as much as the how of his faith life and the things he learned during those years.And there are parts so intense that I will have to read this book again in order to feel I really get it all. His insights into participating with God's will are incredible.",
          "Autobiografía de un sacerdote jesuita que marchó a Rusia durante la segunda guerra mundial y estuvo retenido quince años en un campo de trabajo en Siberia. El libro es una profunda reflexión sobre el significado de la fé para él, y cómo evolucionó y maduró con el tiempo, a través de todas las penalidades sufridas. Muchas de las reflexiones son perfectamente aplicables hoy en día. Es un libro para leer despacio y reflexionar."],
        "_version_":1719036481748598784,
        "score":1.1901778},
      {
        "id":"705630",
        "name":"Criminal Justice",
        "ISBN":"0451184742",
        "rating":3.44,
        "publishYear":1998,
        "publishMonth":1,
        "publishDay":1,
        "publisher":"Signet",
        "countsOfReviews":11,
        "pagesNumber":448,
        "description":"Dan Galindo was once one of the best and brightest young lawyers in the U.S. attorney's office. That was before he refused to put a lying witness on the stand and lost the case. That was before he was tossed out of his job. That was before his wife left him, keeping their beautiful home and young son. And that was before he wound up trying to scrape a living off the bottom of society in a shabby Miami law office. But if Dan thinks things can't get worse, he is wrong. He is about to be drawn into a case that involves a million-dollar money-laundering scheme; a dangerously ambitious young female musician; a desperate music promoter; a crime lord who charms without effort and kills without conscience; a ruthless DEA agent with a blood score to settle with Dan; and then, most shockingly, a brutal murder that brings the police right to Dan's doorstep.",
        "author":"Barbara Parker",
        "language":"English",
        "genres":["Mystery",
          "Fiction",
          "Legal Thriller",
          "Suspense"],
        "reviews":["Criminal Justice by Barbara Parker is set in 1990s Miami. Dan Galindo used to be a successful federal prosecutor. He used to be happily married. He used to live in a luxury home and belong to an exclusive country club. Now his ex-wife lives in luxury, while he lives in a tiny apartment and works out of a has-been defense attorney’s office in a seedy part of town. He has limited visitation rights with his son. He has a spoiled-brat girlfriend who plays in a hoping-to-be-discovered rock band. Dan’s downfall came when he refused to put a key witness on the stand, because he knew the witness lied. He followed his conscience. But when the feds lost the case, Dan was fired. None of the hotshot Miami legal firms wanted a failure. Lacking work and self-confidence, he drank away his marriage.Dan lost everything important in his life except his integrity, which makes him a sympathetic hero in this story, surrounded by criminals and biased law enforcement. But Dan has an unrealistic fantasy of taking his son on an international fishing trip…and takes dangerous risks to achieve it.Federal prosecutor Elaine McHale respected Dan for his integrity when they worked together. She’s on a money-laundering case with the DEA. Dan enters their radar by representing a rock musician as a favor to a friend. The DEA suspect the rock band is a front for criminal activity, assume Dan is fully aware and participating in the crimes, since Dan is seen regularly with the criminals. The DEA doesn’t know (nor would they believe) Dan is just doing a favor so he can borrow an exotic speedboat.Dan’s friend is holding back secrets. He is badly in debt with his recording studio, suspects his major backer is “dirty”, but must keep working for a “break” with the band. The money-laundering kingpin is a sexually attractive man who is brutal and amoral. People under his control do not get away alive. When Dan’s girlfriend is viciously murdered in Dan’s apartment, after leaving a recorded message that she was going to tell him something important, the police are so certain Dan committed the crime, they don’t investigate the murder. Dan must track down the killer himself. His efforts link him further to the federal investigation and the criminal kingpin.Suspense mounts as the feds set a trap for the kingpin, more deaths occur, the rock band desperately tries to produce a demo record, and Dan struggles to fix his life. Betrayals abound. A fast-paced thriller with interconnecting plot threads, “recommended for mature audiences” due to violence. Overall, it’s a fairly dark and depressing depiction of Miami’s underbelly, with only Dan and Elaine shining through.",
          "In the first pages of the book are short phrases of reviews on this title as well as on other titles by Barbara Parker. For Criminal Justice, the Key West Citizen said, Realistic dialogue",
          "This. Book is filled with unexpected turns. I really liked the protagonist. He is far from perfect but at his core he's a really good guy. The author has a real feel for Miami and the south Florida lifestyle. I'm a great fan of Barbara Parker. It's too bad she didn't write more. ",
          "Dan Galindo, a disgraced former prosecutor, is working out of a small firm. His client, also a friend, leads him into a web of drug lords, DEA, federal attorneys, and a rock band. The characters were interesting, but there were so many of them and the plot was so complicated, I occasionally got lost with who was who and who was doing what. The action was well written. Overall, the book was enjoyable and I'll read more in the series.",
          "Good who dunnitset in the music recording industry.Lots of information on how a recording is actually made using sophisticated equipment and moody musicians. Good mystery to sit by the pool and read; nothing to make your heart race.",
          "It's really a 3 1/2. An okay book.",
          "Ok book. I probably should have read the backing better. I was waiting for a court thriller",
          "The first book I read By this author. Sorry it took so long I let this when it caught in the rain out by the pool. Had to let it dry out before I could read it. I enjoyed the book enjoyed the characters. They call this a romantic mystery or thriller but it kept things moving along and didn't spend too much time on the romantic side. I have to say enjoyed the book I would've given it three stars but I'm giving it four stars because I'm optimistic that the next when I read be just as good and they both will serve four stars."],
        "_version_":1719036481587118080,
        "score":1.1685655},
      {
        "id":"865406",
        "name":"Designing Your Own Classical Curriculum: A Guide to Catholic Home Education",
        "ISBN":"0898706602",
        "rating":4.05,
        "publishYear":1998,
        "publishMonth":1,
        "publishDay":11,
        "publisher":"Ignatius Press",
        "countsOfReviews":13,
        "pagesNumber":225,
        "description":"Home educator Laura Berquist presents a modern curriculum based on the time-tested philosophy of the classical Trivium—grammar, logic and rhetoric. She has given homeschoolers a valuable tool for putting together a \"liberal arts\" curriculum that feeds the soul, as well as the intellect. Her approach, covering grades K - 12, is detailed and practical, and it is adaptable by parents and teachers to any situation.This third revised edition includes a much expanded section for a high school curriculum, and an updated list of resources for all grades.",
        "author":"Laura M. Berquist",
        "language":"English",
        "genres":["Education",
          "Catholic",
          "Nonfiction",
          "Reference"],
        "reviews":["Own. The majority of the book is reference for planning each grade. The introduction and first chapter give the background and pep talk similar -- but informed completely and explicitly by her faith -- to Susan Wise Bauer's in WTM. Her goal was not only to give her children the classical education that the Catholics have not completely lost as American evangelicals have, but also to give her children a full-orbed culture of faith. She wanted not simply to avoid evolution, but to positively immerse her children in the history and culture of their faith. That's something the Catholics are better at than we are, but something I hope at least Reformed Christians are regaining (CRE more than any).This will be a useful book, and I will revisit her first chapter for a pep talk when I need it.",
          "This is the first homeschooling manual I have read that has given me a clear idea of what I might do to prepare myself for teaching my own kids. Though this is not explicitly a how-to book",
          "Thanks to COVID and having a child with cystic fibrosis, a lot of school reopening options just were not going to work for our family. After many days/hours of research and friends’ suggestions, I landed on MODG as our foundation for beginning homeschooling in our home. I read this fast and am more at ease with the decision we’ve made for our children. Plenty of resources out there for those that are interested! ",
          "This is the definitive resource to give your child a Catholic, classical education. Berquist is a wise and thoughtful guide - she’s most worthy of your attention. ",
          "This book isn’t designed to provide a deep look at either the philosophical or the practical questions of classical education. Instead, although the forward offers a brief overview of the writings that influenced Mrs. Berquist’s “take” on education, the bulk of the book consists of an outline of the subjects and curriculum she used to teach various grades. It’s intended as a reassuring resource for busy moms who wonder what they really need to include to make sure their kids get a good education. I always appreciate hearing how other families have structured their children’s home education, and I actually found this book surprisingly refreshing. At least in the homeschool circles I frequent, many classical and Charlotte Mason-influenced families today seem very keen to be whole-hearted--even “purist”--in their educational approaches. This can mean that they operate under a lot of “rules” they feel they must follow. In contrast, Mrs. Berquist, a homeschooler of the past generation, seems cheerfully ready to cite both For the Children’s Sake and Dorothy Sayer’s famous essay as formative influences on her own outlook. She refers to stages of learning, but doesn’t seem to interpret this as requiring young children to memorize anything other than poetry. She talks a lot about having children “tell back” what they have learned, but doesn’t attempt to recreate the “correct method” of Charlotte Mason narration. I rather liked that. I plan to keep this book around and glance at her recommendations as my kids get older. ",
          "The title is incredibly misleading. This isn’t a guide to creating your own curriculum, rather it is a curriculum that you can adjust if needed. It doesn’t give the ins and outs of creating a curriculum. It gives you a curriculum and gives you some minor choices along the way. While the idea behind it is classical, the actual curriculum plan feels more traditional to me. It is very similar to, but much more limited than, The Well Trained Mind. If you are wanting a classical-ish curriculum that is pretty much done for you— this is your book. If you’re wanting to actually design your own curriculum, this is not the book. If your wanting everything laid out but with more options, The Well Trained Mind is your book. ",
          "Really useful resource but somewhat dated as many homeschool and classical oriented materials have appeared in the last 20 years. So a great place to start but definitely be prepared to do some legwork after reading.",
          "Designing Your Own Classical Curriculum, written by the woman who edited The Harp and Laurel Wreath: Poetry and Dictation for the Classical Curriculum, is not an apologetics manual for homeschooling or classical education, but rather a practical suggestion for what to cover in each grade and how. I find it helpful to read about what other families have done and found successful, so I can tweak what might work for us.Although the book is classical in focus, the author does draw heavily from Charlotte Mason, emphasizing short lessons, memory work, living books, nature study, narration, artist and composer study, and habit training. Because the book is about individualizing your curriculum, you could easily make substitutions in subject areas where you disagree with the author. For example, if you are not Catholic (as I am not) you could glean some helpful ideas from the history section, but would probably prefer to select different focus areas in some respects.{Read my more detailed review on A Spirited Mind}"],
        "_version_":1719036481653178368,
        "score":1.1671169},
      {
        "id":"711405",
        "name":"The Butter Did It (Chas Wheatley, #1)",
        "ISBN":"0061096253",
        "rating":3.46,
        "publishYear":1998,
        "publishMonth":6,
        "publishDay":5,
        "publisher":"HarperTorch",
        "countsOfReviews":25,
        "pagesNumber":384,
        "description":"It is the eve of City Tastes, Washington, D.C.'s gourmet gala featuring the delectable handiwork of the city's culinary stars. Renowned restaurant reviewer Chas Wheatley expects to fill her biting 'Washington Examiner' column with reports of a sassy 'soupe en chamise' or a poor 'palourde en beignets'. But when chef Lawrence Levain's heart suddenly stops the night before the event, everyone is quick to name his soaring cholesterol as the culprit. Except Chas, whose discriminating senses smell murder. Armed with her saber-sharp pen and critic's eye for things amiss, Chas circuits the restaurant scene, doling out biting reviews and delicious recipes, while probing into Lawrence's untimely demise. With a dollop of help from her loved ones at home and a 'soupcon' of advice form a secret admirer at work, Chas's tastebuds lead her down a dangerous trail of revenge and murder, where her next bite could be her last.",
        "author":"Phyllis C. Richman",
        "language":"English",
        "genres":["Mystery",
          "Cozy Mystery",
          "Fiction",
          "Mystery Thriller"],
        "reviews":["What a fun book in this first of a three-book series.",
          "This was a highly entertaining book about a restaurant reviewer trying to figure out the murder of a past lover who was a notable Chef. We are introduced to Chas Wheatley, working for the Washington, D.C. newspaper, Examiner. Chas is a divorced woman with one child who is an adult. Chas is in charge of her life, she is still friends with her ex-husband, Ari, a famous chef himself. Chas is also in a relationship that is at that difficult stage of either committing or moving on. Chas' daughter, Lily lives in Philadelphia in the music world. Chas is not ready for her former lover and friend, Laurence to be murdered.Chas uses her lover, an investigative reporter to meet a homicide detective and get him working on the case. The detective is leaning towards believing Laurence's death to be natural causes, until Chas receives a death threat.The book is fast-paced, humorous, sexy, and clever. The murder is a mystery. I figured out the culprit but enjoyed watching Chas figure it out. I look forward to the next book in the series. This book is older but still up to date.",
          "Suppose one of the nation's best known, most trusted and widely read restaurant critics turned her writing talents to crafting a culinary mystery? Phyllis C. Richman was the food critic of the Washington Post for nearly thirty years. Known for her sometimes extravagant disguises, intended to prevent restaurateurs from recognizing her, she avoided being photographed to preserve her anonymity. Drawing on her insider's knowledge of restaurants, she wrote The Butter Did It: A Gastronomic Tale of Love and Murder in 1998. It introduces Chas Wheatley, coincidentally the restaurant critic for the fictitious Washington Examiner, who involuntarily becomes an amateur sleuth. Met with critical success (and an Agatha Award nomination), Richman churned Butter into a series with Murder on the Gravy Train in 1999 and Who's Afraid of Virginia Ham? in 2001. This is nobody's idea of great literature but it is pleasant reading for the culinarily inclined.",
          "The Butter Did It by Phyllis Richman is the first Chas Wheatley Mystery book. Chas Wheatley is a food critic and restaurant reviewer for the Washington Examiner. When her friend chef Laurence Levain dies, it is initially thought he has suffered a heart attack and Chas is instrumental in pointing the police correctly to murder, and she is herself then targeted by the murderer. I enjoyed this book very much, especially all the food descriptions. The murderer was a bit obvious and Chas seemed a bit slow in her sleuthing- even when being attacked by the murderer, it didn't seem to register with her. There was a lot of time spent on the background and past which made parts of the book drag a little, but overall it was an entertaining read. ",
          "As a first novel, this book was okay. There was nothing that made this book stand out from others in this particular genre theme. It became a bit boring at times but not overly boring. I enjoyed the many food references made through out the book. The main plot/story line was good but the characters were not all that interesting. This book is what I classify as an in betweener",
          "Maybe I fell asleep while reading, but why a certain character lied is never addressed. Our main character is a bumbling sleuth who walks around at night in the city, even though someone may be trying to kill her. There were some good moments in the book but overall it was just readable. I was bothered by a loose end left unanswered; but since I live near D.C., I enjoyed reading familiar names of places I have been to or know about.",
          "Did not guess who the guilty party was until the end. Remembered author from when she was the food critic at the Washington Post, so thought I would give the book a try. A bit dated but have to remember when it was written. Enjoyable book.",
          "Audiobook - I'd give this book a 3.5. It was entertaining enough to listen to.",
          " Chas (aka Charlotte Sue) Wheatley is the restaurant critic for the Washington Examiner writing the obituary for Laurence Levain, a well-known Washington chef. What is not known is that Chas and Laurence are friends and had been lovers back in Paris in their younger days. Laurence is found dead from an apparent heart attack the night before a big food gala called City¬Tastes. The death scene has been made to look as if he had been entertaining a woman before he died, but Chas has personal information about Laurence that makes her sure this is not true. Police detective Homer Jones, who loves to eat, Chas' daughter Lily, and various chefs all figure in the story of how Chas solves the mystery. Phyllis Richman is the restaurant critic for the Washington Post, which added to my enjoyment of the book."],
        "_version_":1719036482087288832,
        "score":1.1671169}]
  }}