{
  "responseHeader":{
    "status":0,
    "QTime":10,
    "params":{
      "q":"christmas gift",
      "defType":"edismax",
      "indent":"true",
      "qf":"reviews genres description",
      "q.op":"OR",
      "fq":["description: friends",
        "genres: romance"]}},
  "response":{"numFound":31,"start":0,"numFoundExact":true,"docs":[
      {
        "id":"686353",
        "name":["A Christmas Kiss and Winter Wonderland"],
        "ISBN":"0451217004",
        "rating":[3.7],
        "publishYear":[2005],
        "publishMonth":[1],
        "publishDay":[11],
        "publisher":["Signet"],
        "countsOfReviews":[10],
        "pagesNumber":[480],
        "description":["A Christmas KissA GIFT OF TREASURE...When James Everard announced that he had invited a young lady home for the Christmas holidays, his father, the Earl of Gyllford, was astounded -- and skeptical. Could it be that Jamie was finally showing an interest in something other than horseplay with his friends?But when lovely Miss Evalyn Pennington arrived at Gyllford Manor, it was the earl who found himself inexplicably drawn to her winsome beauty. Having been dismissed from her post as a governess, Evalyn would long remember the kindness of being welcomed at Gyllford Manor when she had nowhere else to turn. The elegant home was resplendent with the richness of holiday cheer -- the warm glow of the yule log, the sumptuous sights and smells of the Christmas feast, the glittering parties, and the laughter of children at play.But neither Evalyn nor the earl expected the light of love that filled their Christmas with some very special gifts...Winter WonderlandTHE SEASON OF FORGIVENESS...It took one stinging rejection to chill Barnaby Traherne's heart to love...At his first society ball, beautiful Miranda Pardew haughtily turned down his shy request for a dance. Since that disastrous night, Barnaby vowed that no woman would make a fool of him again. Love was for others, perhaps, but not for him.Over 10 years have passed since that encounter. But it seems like yesterday when Miranda comes into his life once more. She is still a stunning beauty, but time and circumstance have left her poor, alone and in need of employ. When she is hired as a governess for his brother's children, Barnaby must reconcile his painful memories-and his desire.For amidst the warmth and merriment of the Christmas season, Miranda's return may be the blessing of a lifetime..."],
        "author":["Elizabeth Mansfield"],
        "language":["English"],
        "genres":["Christmas,Regency,Romance,Historical Romance"],
        "reviews":["Both stories in this book are really lovely. Very well written, heroes to die for, and a real feel for the Regency period. So glad to come across another author for my Regency romance habit ;-) Will have to check out more of Elizabeth Mansfield's booklist, although most of them are out of print now. ",
          "These were my first stories by Mansfield and they wont be the last. Although not reaching a keeper status the stories were interesting and full of potential.GIFT OF TREASURE...When James Everard announced that he had invited a young lady home for the Christmas holidays, his father, the Earl of Gyllford, was astounded -- and skeptical. Could it be that Jamie was finally showing an interest in something other than horseplay with his friends?But when lovely Miss Evalyn Pennington arrived at Gyllford Manor, it was the earl who found himself inexplicably drawn to her winsome beauty. Having been dismissed from her post as a governess, Evalyn would long remember the kindness of being welcomed at Gyllford Manor when she had nowhere else to turn. The elegant home was resplendent with the richness of holiday cheer -- the warm glow of the yule log, the sumptuous sights and smells of the Christmas feast, the glittering parties, and the laughter of children at play.But neither Evalyn nor the earl expected the light of love that filled their Christmas with some very special gifts....A young man wants to help a governess in trouble. To find her another job he plans to take her home so his aunt can get to know her and give her a character. The problem is his father and the aunt believe he has brought her home as his fiancée thus starting a big misunderstanding when the father starts falling for the girl. I did like the main characters and their motivations, I felt the misunderstanding went on for a bit too long and especially that the hero and heroine should have spent more time together so we could see them falling in love. That’s the only way it would make sense for Evalyn to be so hurt when he decides to avoid her. But I did enjoy their relationship and thought that was an original hero, very kind and understanding and even lenient with his servants when they get in trouble. I did like the set of secondary characters and the secondary romances that were developed. I must say I’m finding that my favourite Christmas stories all seem to include more than one romantic couple so maybe this is a trend in my reading. Besides wanting more interaction between the Earl and Evalyn what didn’t work so well for me was the mystery plot, I don’t think we really needed a villain to bring those two together and the mystery wasn’t really all that developed with it ending almost before it’s begun and Evalyn not even knowing anything. Grade: 4/5Winter WonderlandTHE SEASON OF FORGIVENESS...It took one stinging rejection to chill Barnaby Traherne's heart to love...At his first society ball, beautiful Miranda Pardew haughtily turned down his shy request for a dance. Since that disastrous night, Barnaby vowed that no woman would make a fool of him again. Love was for others, perhaps, but not for him.Over 10 years have passed since that encounter. But it seems like yesterday when Miranda comes into his life once more. She is still a stunning beauty, but time and circumstance have left her poor, alone and in need of employ. When she is hired as a governess for his brother's children, Barnaby must reconcile his painful memories-and his desire.For amidst the warmth and merriment of the Christmas season, Miranda's return may be the blessing of a lifetime...I had a harder time with this story than the first one although it has one of my favourite themes – it’s a second chance at love story.My first problem is that the heroine really was mean and cruel to the hero 10 years before. Despite her having changed a lot we never really know much about that besides that she was unhappy in her marriage. It was just like she was a totally different person. Then the hero, despite having been deeply affected by her attitude, feels in love again as soon as he sees her. I just wasn’t convinced, both that he would still be in love with her and that she had conveniently changed into a totally different person. Other than that is was an enjoyable story, with the hero’s sisters in law planning to marry him off to a young girl and him being attracted to the governess who was the beauty of his youth fallen on hard times. At first she doesn’t recognise him and can’t understand why he is so rude to her. But when she is told she regrets her behaviour and does apologise to him. But it just didn’t seem enough, I needed to know more about her. I needed for them to talk more about the past and how they spent those 10 years.I did like the hero’s family, he had 4 older brothers that were intent on protecting him and his sisters in law were fun to read about. It made me wonder if they had their own books. Grade: 3.5/5 ",
          "These stories were delightful. No sex scenes but definitely romantic. Once I picked up the book it was difficult to set down. Her descriptions of Christmas traditions were fun to read. She put the Snap Dragon song in the book. I love that she puts a lot of words my mother used such as 'flibbertigibbet' and she has stuck with historically correct speech. This is one of those books you will want to keep on your shelf for a second reading!",
          "This was a little fun Christmas read. The book contained two different stories. I liked the second one better than the first one, but they were both good. Nothing like curling up on the couch with a Christmas love story this time of year.",
          "This was a very good story. It started strangely but as the book progressed it got better. There were several HEA in te book and I loved how each one unfolded. The author kept the suspense going throughout the book. Very well written.",
          "Both of the stories in this book were rather cute. Just a fun Christmas romance that goes great with a cup of hot chocolate and a nice warm blanket.",
          "Good, fun, romantic regency romance. ",
          "So far I have only read A Christmas Kiss, going to put Winter Wonderland on hold. ",
          "Very cute, clean stories. Great author.",
          "Both stories were entertaining and nice romances to read for the holidays. ",
          "Regency"],
        "_version_":1719032016982245376},
      {
        "id":"674438",
        "name":["Mistletoe Bay (Misty Harbor, #7)"],
        "ISBN":"0821780093",
        "rating":[3.95],
        "publishYear":[2007],
        "publishMonth":[1],
        "publishDay":[10],
        "publisher":["Zebra"],
        "countsOfReviews":[24],
        "pagesNumber":[320],
        "description":["Nestled beside the coastal town of Misty Harbor, Maine, lies the picturesque village of Mistletoe Bay. There, overlooking the clear blue sea, is a charming old house that's the perfect place to gather for the holidays and give thanks for family, good friends, and bright new beginnings...When Cooper Armstrong left California to return to Maine, he also left a cheating ex and all his plans for settling down. Now Coop concentrates on taking care of his ailing father and learning his route as the area's new UPS man. It's not just Coop's parents who need assistance—Jenni Wright, whose blossoming new business has him making daily deliveries to her property, could clearly use some help. With three young sons, her mother-in-law, and a teenage niece all sharing a rickety house that seems to be held together with duct tape, Jenni has her hands full. To Jenni, Coop is their UPS guy, handyman, and her boys' guardian angel all in one gorgeous package. She's sure he'd run a mile before getting involved in the chaos of her life. But as Thanksgiving gives way to Christmas, the lovely, resilient Jenni turns Coop's expectations of a cold, lonely winter upside-down, revealing the promise of warmth, love, and a lifetime of happy memories.\"The magic of everyday pleasures permeates Evanick's contemporary romance...Evanick has a gift for finding the humor in small details, and her story of opposites who attract unfolds with endearing warmth.\" —Publishers Weekly on Harbor Nights\"Evanick's enchanting series never skimps on humanity, warmth, and romance.\" —Romantic Times on Harbor Nights"],
        "author":["Marcia Evanick"],
        "language":["English"],
        "genres":["Romance,Christmas,Contemporary Romance,Contemporary"],
        "reviews":["Mistletoe Bay was in a word, wholesome. I was cracking up throughout the book, it was just fantastic!This Christmas romance followed Jenni, a widowed mother of three crazy, hilarious boys that were the source of most of my laughter, as she navigates starting a new business in a new town and meeting a new man. Living with her is her late husbands mother Dorothy and sister in law, Felicity, and the book follows their adjustments to the new town of Mistletoe Bay and new love.The highlight of this book was the three little boys, particularly Tucker, 5 year old with a vivid imagination for new ways to make trouble. He’s just hilarious and the highlight of this book.Coop, the UPS man with a darker past of his own can’t help but be drawn to Jenni and her crazy family. He helps around the house with fixer upper tasks and as everyone settles in, and Tucker continues to make trouble, Felicity starts to feel left behind. How the family handles this conflict could leave everyone miserable. I give this story 5 ⭐️⭐️⭐️⭐️⭐️ even though it felt wrapped up too quickly, it was just so wholesome and adorable and hilarious! The chemistry and love stories is just perfection. It’s so well done and I just can’t say how much I loved this story.My six word review:You’ll laugh so hard you cry!Steam rating:For a romance, there’s maybe only 3 pages of steam. It’s the perfect amount and not too graphic.If you want to laugh like crazy while reading about so many unique love stories, this is the book for you!",
          "Good, old fashioned love storyI read Ms. Evanick 's book many years ago and had forgotten how wonderful her stories were, how realistic her characters are. I also appreciated how low key the sex scenes were. It's a very nice change.",
          "Challenges of life with three active youngsters and extended family. Humorous love story. Loved reading this book.",
          "First time reading this author: and glad I picked her book up... all because the name implied it was a Christmas themed book that caught my eye.... loved the cover, the colour of it ... love blue covers. .... and the synopsis on the back cover made me want to know more of these people and their lives. Started this book yesterday... from the first page I couldn't believe how this flowed and held my interest. Real life everyday scenarios... in countryside small town living ... & a caring person doing his everyday because circumstance of his own life brought him to this place in time. A caring inquisitive man doing is job ... involving his instinctive self . How could not keep reading ?10:58 PM 19 August 2015 .. was searching to see what books had been written this series Misty Harbor ... I'm stifled ... but I just did a search to find out and am teeter-tottering with emotion.. she passed away this summer 2012. omg. Her words are so full of life in this book 2007 ... how sad. 21 Aug 2015 - An awesome finish to an awesome storyline ! had a hard time to put this book down. ",
          "So nice that I finished this on Christmas Day. It was one of the last books my grandmother read before her death. She read it 6 Christmases ago and I couldn't bear to read it until now. I gave it a 4 because I could hear her laughing at the little Boy tucker that resembled her grandson Jackson. It wasn't Austen or dickens but she loved it. She even wrote hysterical on the inside of the cover to remind herself. I love that I could have a small piece of her this Christmas. The book was funny and really a 3.5 but I could feeling her read it with me. That made it a 5! I was smiling and laughing as I read it. I can even see her little hands holding the binding. What a wonderful book that we finally shared. Thanks grandma for sharing one last book with me. ",
          "Cute story about a young widowed mother who recently moved to a quaint town with her three rambunctious boys, her mother-in-law, sister-in-law and a bunch of pets. Jenni runs a business out of her barn while Dorothy cooks and watches the boys. UPS deliveryman, Coop, never knew what to expect on his daily trip to her house and once he met Jenni he started coming over to fix things on the house and get fed delicious food.It is interesting to read how the household blends and the crazy things that happen. There are romances for all three women in the house and of course a HEA. I'm not usually that into romances with children, but I really enjoyed this one.",
          "Bummer. The last in the series (I think). I really enjoy Evanick's world and writing style. I picked this up after being disappointed by something else and was instantly sucked into an enjoyable story with nicely building interest and passion. My one complaint would be the lack of interaction with previous characters from the series. We heard about Daniel, Gwen, Dr. Sidney and a few others but really didn't see them at all. I enjoy seeing the continuing lives of characters from previous books, but as complaints go that's pretty minor. Also nice to see the 3 (well really 2.5) generations interacting. Actually 4 when you add in the boys.",
          "Jenni - widow, business owner, mother of 3, lives with her mother-in-law and sister-in-law is a run down / falling down home with a small zooCoop - single man, UPS driver, AKA Mr. BrownDorothy - Jenni's mother-in-law",
          "multi generational romance: widow with 3 young children falls in love with delivery man. Her mother in law falls in love with the father of her teenage daughter's boyfriend and of course, the teenager finds first love with young man but is upset that her mom is in love with the boyfriend's dad.",
          "The final book of the series, and just as enchanting as all the other stories in the series. There are moments of fun, moments of every day problems and a lot of love. I will always wish there were more stories to this series.",
          "Was the first book I read of hers and the series now I am determined to read them all. A really great read!",
          "Cute and feel good Christmas holiday read! ",
          "This is one of my favorites but if I remember correctly, there is quite a saucy scene that some of you might want to skip over. :) (It is a romance novel).",
          "dnf because the story was too simple and sweet. the kind of romance everyone wants to live not necessarily to read about. no tension or suspense.",
          "This book had a good solid story and a touching romance. I would recommend.",
          "it was cute and romantic. it is nice of evanick to give second chances to widows/widowers with children...who are her usual characters, at least with 2 of her books i've read so far.... =)",
          "Good story; liked that it was about a widow with young kids who finds love again!",
          "Omg this was so good and funny. Enjoyed all the characters. I hope there is more. ",
          "Cute story"],
        "_version_":1719032009118973952},
      {
        "id":"695344",
        "name":["The Loving Gift"],
        "ISBN":"026312780X",
        "rating":[3.33],
        "publishYear":[1991],
        "publishMonth":[8],
        "publishDay":[2],
        "publisher":["Mills & Boon"],
        "countsOfReviews":[8],
        "pagesNumber":[288],
        "description":["\"I'm going to marry her,\" he'd said.Just because David Kendrick fell in love with Jade at first sight, it didn't mean she had to go along with the idea!She had escaped to the sanctuary of a Devon village and a job teaching at her friends' school because she wanted some peace and quiet, and the last thing she needed was this impulsive, handsome man turning her life upside down and stirring up her emotions.But Jade couldn't resist David's single- minded pursuit of her, even though she knew she was not yet free from the terrible shadows of her London past...."],
        "author":["Carole Mortimer"],
        "language":["English"],
        "genres":["Harlequin,Harlequin Presents,Romance,Contemporary Romance"],
        "reviews":["Re The Loving Gift - here in HPlandia it is December 1989 and CM has been absent from the line up for a year. I suspect CM was busy doing CM things, but she kinda left us hanging right in the middle of her Bennett Family mini-series.  The preceding books in this series were One Chance At Love with Dizzy and her undercover Romance Author Greek God History Professor, To Love Again with Christi, Dizzy's friend and the Greek God's niece and her older, divorced, lurve lessons stud and this one is followed by December 1990's offering of A Christmas Affair, whose h is the best friend of the h we are talking about here.This one opens in appropriate Christmas fashion with the h, who has taken a temporary teaching contract in Devon to escape London for a bit, ( something bad happened, but CM is going to keep us in suspense about that,) supervising the student's holiday party before sending them off for Christmas Holidays. Everyone is anxiously awaiting the arrival of Father Christmas and he finally makes his appearance. The h's schoolteacher friend, whose husband is the Jolly Man in the Red Suite, appears to have fallen into a state of shock. The h is wondering what is wrong, but soon gets distracted by Father Christmas's borderline suggestive comments about what a cute girl like her would want in her bed for Christmas, right in front of all those google eyed children. The h is mortified and offended, she is doing her best to politely distract Santa without resorting to a skillet over the head and possibly traumatizing innocent, gullible students for life. When Santa sashays over to hang all over her person for a bit, the h can only conclude that her teacher friend's hubby, who is also the Headmaster, went overboard in the dry sherry drinking in an attempt to live up to the jolly part of being St. Nick. She is warning him off in an fierce undertone and Santa Baby's remarks are only getting more outrageous. Finally Santa takes the hint and attention is diverted as the children are gotten bundled up to go home. Santa corners her in the supply closet after the party clean up and announces he is in love and wants to marry the h. The h is furious and smacks him a good one on the side of the face. Instead of backing off",
          "The hero & heroine were so annoying that I dnf'd on page 62. Also the storytelling was too slapstick farcical comedy & forced in the telling. The only character I took seriously was Wellington the cat. It's story was told in a compelling manner.",
          "Couple of things:1- WHAT do I make of the instant attraction of the H for the h? It's cute in the beginning but it reminded me of a little kid who wants a new toy and keeps at it until he gets it...I can't help but wonder what's gonna happen when the novelty wears off cuz the H's first wife died before that happened.2-Despite that there was a cute little earnestness in the way he pursued her. It was different than other HPs for sure.3- I finished the book in 40 mins. That seems kinda weird for me to finish the story this fast, even though I am a fast reader. Could it be that the material is kind of - for a lack of better word - simplistic to the extreme? Possibly.4- Well at least the h is wearing a watch (yes, I notice the weirdest things on the cover) - I like people who wear watches - that's just me so...dunno why I mentioned that here but okay...5- There was humor in there so I'm upgrading the rating from 3 stars to 4 stars cuz it's quite rare to find humor in HPs... 6- In the end there were reference (seemed deliberate to me) of all the other people/couples that the Bennett series involves - Someone ought to tell these authors that a natural mention is welcome but not a forced summary - that just ruins it...",
          "Gah! My first read of the year and it was .....Meh!The h annoyed me. The H was an absolute darling. He deserved more than he got from the h for most of the book. The h’s ex used her in a horrible way and it left her traumatized, but she took on unnecessary guilt and wore it like a hair shirt. Just torturing herself for no reason. The girl needed therapy. It was a decent read. The reveal of the trauma she experienced took me by surprise. Didn’t see that one coming. But she was never thought to be responsible for her ex’s actions. She just liked carrying all that guilt. I made it through the book. Yay! But let’s hope I find a better read for book number two for the new year. ",
          "Good love story. The H is immediately besotted when he sees the h. And he doesn’t hide it. I like it when a H shows his feelings and is open about it and relentlessly pursues the h. And when he is so tender and caring as this H. ",
          "This one was better then the last ones I read. I think because the plot was great and it had some really funny scenes in it. No arguing about things, being upset yes but no really big arguments. Which to me made this one a lot better. The kirky side of the man David made this one more bearable finding each other in the end the way they did and letting us know what happened at the end was great. I think the surprise was her finding out who her favourite writer was. I think David would know that it would surprise her. It did me.",
          "Jade is working under another last name believing her mistake of falling for the wrong man is still ruining her life. David comes to Devon to visit family and plays Father Christmas for his brother's school. When he sees Jade he falls for her. After Jade slaps him twice and gives him a black eye, he declares he's going to marry her and that it was a sign. Jade can't help falling for David when he pursues her. In fear that she can't escape what her ex-fiancé did, she runs. With some wise advice from her friend, she goes back to find David. They finally get together and Jade realizes that her ex can't stop her from being happy.",
          "This story was cute and funny. But it didn't fell like an early Carol Mortimer with the H being totally adorably in love with the h! Would have liked more drama tho. CM missed the chance to create angst when the h's ex escapes from gaol. I waited for the ex to contact the h and that some drama would ensue. But you can't have everything I guess.",
          "Story was a bit slow at the beginning, then it became interesting and funny. The story is firstly about trust , Jade was badly betrayed in the past and had to go beyond that fear to accept love and trust from David and to believe in it.A good series can be read individually but to understand some names better start reading from book 1 One Chance at Love.Happy Reading.",
          "Couldn't finish.",
          "Seduced under the mistletoe!Just because spontaneous David Kendrick fell in love with Jade at first sight, doesn’t mean she has to go along with the idea! As the snowflakes starts to fall over her quiet Devon village, the last thing Jade thinks she needs is this impulsive, handsome man stirring up her emotions and turning her life upside down!But Jade can’t resist David’s passionate pursuit of her—even though she knows she is not yet free from the terrible shadows of her London past. Can David offer her a new future with a sizzling Christmas seduction, and a sparkling diamond ring?",
          "Forgettable.",
          "Esta la leí hace muuuuchos años y me había gustado mucho. Hoy la releí y no puedo más que decir que ¡Quiero un David Kendrick para mí solita! "],
        "_version_":1719032023556816896},
      {
        "id":"707579",
        "name":["This Year It Will Be Different"],
        "ISBN":"0385341784",
        "rating":[3.56],
        "publishYear":[2007],
        "publishMonth":[29],
        "publishDay":[5],
        "publisher":["Dell"],
        "countsOfReviews":[1],
        "pagesNumber":[272],
        "description":["From the New York Times bestselling author of Circle of Friends and The Glass Lake comes This Year It Will Be Different, a stunning new work that brings us the magic and spirit of Christmas in fifteen stories filled with Maeve Binchy's trademark wit, charm, and sheer storytelling genius. Instead of nostalgia, Binchy evokes contemporary life; instead of Christmas homilies, she offers truth; and instead of sugarplums, she brings us the nourishment of holidays that precipitate change, growth, and new beginnings.In \"A Typical Irish Christmas,\" a grieving New York widower heads for a holiday in Ireland and finds an unexpected destination not just for himself, but for a father and daughter at odds.  The title story \"This Year It Will Be Different\" also delves into the emotions of a person at mid-life--a woman with a complacent husband and grown children who are entering a season that can forever alter her life, and theirs.  In \"Pulling Together,\" a teacher not yet out of her twenties sees her affair with a married man at a turning point as Christmas Eve approaches--and she may be off on a new direction with some unusual friends.  And in the delightful tale \"The Hard Core,\" the four most recalcitrant residents of a nursing home are left alone at Christmas with the owner's daughter in charge: the result is sure to be disaster--or the kind of life-affirming renewal that only the spirit of the season can bring.The stories in This Year It Will Be Different powerfully evoke many lives--step-families grappling with ex's, long-married couples faced with in-law problems, a wandering husband choosing between \"the other woman\" and his wife, a child caught in grown-up tugs-of-war--during the one holiday when feelings cannot be easily hidden. The time of year may be magical, imbued with meaning. But the situations are universal. And Maeve Binchy makes us care about them all. As the Philadelphia Inquirer noted, \"Maeve Binchy's people come to life fully. They make you laugh and cry and disturb your sleep.\" They do precisely that in this extraordinary collection, on the night before Christmas when we are snug in our beds, or anywhere, any time of the year.From the Hardcover edition."],
        "author":["Maeve Binchy"],
        "language":["English"],
        "genres":["Fiction,Short Stories,Christmas,Romance"],
        "reviews":["Binchy's memorable stories touch on all the joys, and stress that Christmas brings about as family gathers together, sometimes reluctantly, to celebrate. We meet lonely middle-aged women, sullen teenagers, women involved with married men, women worn out from doing all the work involved with holiday preparations, and a man spending his first Christmas alone after the death of a beloved spouse. You'll recognize a lot of the people in these tales.A fine collection - highly recommended.",
          "Was an 'ok' book. Lots of short stories which were fairly simular and after a few they all started to merge into one.",
          "1996 Nov 1 2004 Dec 14 Big soft-spot in my heart for short stories about Christmas. Maybe it was all those Good Housekeeping magazines? I don't know. One of my favorite Christmas books. As in real life, people trying to make things better, and mostly much doesn't change, but they made the effort, and that counts, doesn't it? The title story slays me, and makes me stabby, too. Binchy has an underlying thread of feminism that is grounded in the real lives of modern women. It's not so much an idealistic stance as a pragmatic grounding.*** 2012 Dec 15 This time what really jumps out at me is how many stories feature characters having affairs with married men. Apparently I just don't hang with the crowd that has mistresses. It seems so old-fashioned to me.***2014 Feb 92014 Dec 15Read it twice in one year. I just don't think there's any better way to express just how much I love these stories.",
          "Maeve Binchy stories are often sniffed at by literary snobs, but they remind me of a cup of tea on a cold day; one of life's small pleasures. This particular book is a collection of short Christmas stories, some of them entertaining, like the story of a boy who breaks his granny's glasses and feeds his dog his grandpa's hearing aid in order to prevent them from complaining. Some are a bit bleak with the normal Binchy inclusion of wandering husbands and unappreciated wives, but all end with a nice hopeful note. Written in the simple unembellished Binchy style and focusing on everyday struggles around Christmas, the book is well worth the read. ",
          "Maeve Binchy’s short story anthology, “This Year It Will Be Different”, is fantastic from the first sentence! A mystery fan who seldom reads general fiction, I was blown away by how immediately her other compilations sucked me in: “The Lilac Bus”, 1982 and “Dublin 4”, 1984. It’s clear why this lovely lady is Ireland’s pride and famous the world over. Her passing this 2012 is too soon, my solace being I’ve only begun to experience her work. It remains, for all to enjoy.I’m amazed to find I’m even more entranced by this 1996 collection of Christmas short stories! Maeve’s inexplicable ability to captivate with commonplace chitchat has led me to declare time and again, that set parameters cannot judge the quality of books. Activity doesn’t have to be fast-paced, there needn’t be glorious scenery, one doesn’t require a dynamic plot, likeable protagonist, and it needn’t even be one’s chosen genre. If you find yourself losing track of the pages and engrossed in what comes next, you love the book.This author’s skill for sympathizing with any character is legendary. I imagine her success at drawing us in comes from her one-to-one narration style, illuminating us about the protagonist’s inner thoughts or making us privy to very natural dialogue. Plots are based entirely on the everyday nuisances and delights of regular people, which most of us relate to with ease. A reader of more exotic adventures, bears external witness to them. Maeve’s home life settings have you wincing about completely believable situations, pondering how you would handle them. Since the protagonist’s feelings drive the stories almost entirely, you are on their wavelength. You ride along in their mind, invested in whatever they’re doing: from a jilted schoolteacher who fulfills a trip to New York, to welcoming home an uneasy stepdaughter.",
          "This collection of fifteen short stories which all take place at Christmas is the most disappointing Christmas-themed book I have ever read. The few funny or heartwarming tales are sadly overshadowed by the multitude of whining, bitter, resentful, and self-centred characters whose notion of Christmas has been corrupted by the commercialised “me-centred” culture of the 20th century. This is the first work by Maeve Binchy that I have read. It will definitely be the last!",
          "Update as 12/19/20 at 12:01 AM: 15/15 stories reviewed! I don't actually expect anyone to read these. I just told myself I was going to finish reviewing all 15 stories and I'm practicing following through XD++++++++++++++++++++++++++++A collection of fifteen of Maeve Binchy's short stories, all with the theme of Christmas being a time for change -- hopefully for the better. This is not a favorite of mine as I think Binchy is at her best when working with at least fifty pages. A mini-synopsis/-review and star rating for each story are below with the overall book rating reflecting the average number of stars awarded (which turned out to be just over 2 out of 5).**Story 1/15: The First Step of Christmas**2/5 starsMini-synopsis: A broken and blended family tries to cope with each other and their disappointed expectations. A chance misunderstanding at Christmas creates an opportunity to heal their relationships and have a more positive future.What I think: I can't relate to any of the characters. They're all spoiled and blinded by their own privilege and... I just don't have much sympathy. I'm not sure if Binchy is intending us to feel sympathy for the adults, though. The kids are the real victims and I do feel something for them, though they're not in the story enough for the reader to become truly invested.**Story 2/15: The Ten Snaps of Christmas**4/5 starsMini-synopsis: A dysfunctional family, including a repressed mother who genuinely loves Christmas, lives in denial about their issues. Someone takes matters into their own hands after receiving a present that turns out to be the perfect tool for turning the tables on their toxic family members.What I think: This is probably my favorite story of the collection. Binchy conveys clearly in just a few pages how messy relationships can be between couples, parents and children, and friends. It has a very clever ending featuring an unexpected hero. I wish this story had been expanded into a novel.**Story 3/15: Miss Martin's Wish**1.5/5 starsMini-synopsis: Miss Martin, a London schoolteacher, experiences a romantic tragedy that overshadows the next several years of her life. She finds unexpected peace while spontaneously visiting NYC.What I think: This story has odd pacing. The narration begins with a lot of detail and then suddenly skips five years, after which we're back to lots of detail. Miss Martin herself is annoying and self-indulgent in her fragility. What she needs for Christmas are coping skills. The ending is supposed to be inspiring and instead I painfully rolled my eyes. It is just so unbelievable even by a feel-good book's standards.**Story 4/15: The Hard Core**3/5 starsMini-synopsis: A lonely divorcée runs an only-just successful retirement home, the staff of which is harassed by a nightmarish group of residents known as The Hard Core. Can these geriatric whingers scrape together enough Christmas spirit to help save their final earthly home?What I think: At least the first half of the story is meh. None of the characters are particularly interesting on their own and there are a lot of details about unhappy love lives that get wearying. As soon as the story did get interesting",
          "Going to have this count towards Melbourne Cup Day! Some of the stories take place in Australia! Lucky me! I will make sure that I identify them below. You all know that I love Maeve Binchy. She wrote some fantastic short story collections that I always recommend to people. I hit a nasty reading slump and started reading some of her collections/books that I have been meaning to get around to some day. The First Step of Christmas (5 stars)-revolves around a stepmother who is trying to deal with throwing her and her husband's annual Christmas party. We find out that Jenny (the stepmother) has not been able to get through to her husband's daughter (Alison). The story sets it up as if Alison has been a pain throughout her courtship and marriage. I honestly just felt badly for her especially when you find out that her mother died. I did like how this story ends though with Binchy showing that Alison is a lonely girl who misses her mother. The Ten Snaps of Christmas (5 stars)-Yikes. This one made me think of The Family Stone movie. Pretty much everyone is awful and you want it to be over. The mother (Maura) in this one pushes for her daughter (Orla) to get a voucher for clothes. The dad ix-nays that whole thing and they buy her a Polaroid camera. Why you would by a teen this is beyond me. Eventually Orla takes 10 pictures that shows what her family is really like when not pretending to be perfect for the holidays. Miss Martin's Wish (5 stars)-This one takes place mainly in New York though the story begins with Miss Martin as a teacher in Ireland. We eventually find out that she has left practically at the altar and the plan was for her and her ex-fiancee to go to New York together on their honeymoon. She eventually travels there and meets someone (not in a romantic sense!) and I liked how this story ended. The Hard Core (4 stars)-This one takes place in Melbourne, Australia. The main part of this story is that the owner of an old age home (Kate) is taken away during the holidays after her mother suffers an accident. The Hard Core refers to a group of elderly residents who cause no end of suffering by the staff cause they are pretty much jerks. Kate has to ask a staff member about staying behind to watch The Hard Core. I don't know if I found this one very realistic, but I still enjoyed it all the same. Christmas Timing (5 stars)-I maybe laughed through this whole story. We have two people, Chris and Noel (guess which is the woman and which is the man) who are engaging in an affair. They think that the other one is the love of their lives, but Noel is not ready to leave his wife and children, because the children are too small. Sure Jan. These two fools love to take magazine quizzes that affirm their love for each other. This Christmas is different though when they both take a quiz that forces you to fill out answers. I maybe laughed hysterically about what the answers revealed. The Civilized Christmas (3 stars)-I really didn't like this one. The stepmother in this one (Jen) is just a martyr through and through and I got tired of it. She has a stepson (Stevie) who she is constantly taking back and forth to her husband's first wife's home. Jen is jealous of Tina and thinks that Martin and Stevie are comparing their lives at the home they share with Tina. I mostly felt pity for Stevie cause I can see in future stories Jen being angry if Martin shows more affection and love for Stevie than for her. Pulling Together (5 stars)-It doesn't take place in Australia, but the main character Penny writes a weekly air mail to her friend Maggie in Australia. Kangaroos are mentioned. This is another short story about adultery though. Penny never goes away to see her family or friends since she wants to be on call in case her married lover can come and see her. When she pushes back about being there for the holidays he makes her feel guilty about leaving him to his family. Yeah. He sounds like a jerk. Penny eventually ends up finding out surprising things about a student of her's (called Lassie) and a fellow teacher (Ms. Hall). I liked how the three of them end up needing each other for the holidays. A Hundred Milligrams (5 stars)-This short story shows the aftermath of an affair on a couple and the woman's mother. Having this mess go on during the holidays makes me yearn to hide from people. The Christmas Baramundi (4 stars)- This one takes place in Pyremont"],
        "_version_":1719032028570058752},
      {
        "id":"612402",
        "name":["Return to Promise (Heart of Texas #8)"],
        "ISBN":"1551666138",
        "rating":[4.06],
        "publishYear":[2000],
        "publishMonth":[22],
        "publishDay":[9],
        "publisher":["MIRA"],
        "countsOfReviews":[73],
        "pagesNumber":[256],
        "description":["In her eighth book featuring the residents of Promise, Texas, Debbie Macomber reunites us with the family and friends of this cattle ranching community for a year as they face new challenges, celebrate their triumphs and find love and joy with one another."],
        "author":["Debbie Macomber"],
        "language":["English"],
        "genres":["Romance,Fiction,Contemporary Romance,Christmas"],
        "reviews":["This is a romance, and this is the 8th book in the Heart of Texas series. This is a short book, and I listened to the audiobook for this book. The narrator was good but not great. I really feel this book was more like a novella. This book was all about a wife and husband not talking out their problems, and they almost get divorce because of them not talking out their problems. I liked this book, but it is not my favorite Debbie Macomber. This is also one of Debbie Macomber's older books. (*)",
          "Um livro muito pequenino mas amoroso e, parece-me, bastante real a mostrar como coisas sem jeito nenhum podem criar problemas. ",
          "Cal Patterson and his wife Jane live in Promise, Texas. Everything in their life seems to be going ok. Well until Jane has to fly to California because her father has fallen and broken his hip. Also Nicole Nelson has come back to town to break up their happy marriage.",
          "Cute light hearted reading. Love all of Macomber's books.",
          "Annoying, surface level characters in an otherwise good plot.",
          "Return to Promise ( Heart of Texas #8) was another great read by Debbie Macomber. Cal and Jane live in Promise, Texas and believe that it is a great place to raise their family. They never thought that anyone in Promise would become a threat to their marriage. They start to have disagreements that escalate when an attractive young woman has her eyes on Cal. After months of this they decide to separate and Jane takes the kids back to her childhood home in California. Cal is alone on the ranch and has to decide what exactly he wants and needs in life. I enjoyed reading Cal and Jane’s story and can’t wait to read more by Debbie Macomber.",
          "This book was a tad awkward to get into because I haven't read any of the other Promise books. This book was a part of a two book Christmas book so I didn't realize that one of them was part of a series. Regardless, after I figured out who everyone was, I enjoyed it. The story is so reflective of most (if not all) marriages and the problems that can occur. I loved how truthful it was and the way the author brought the story to an end. Thankfully, this Christmas story had a happy ending!",
          "Although I liked this story, I couldn't quite accept the premise that the argument between Cal and Jane escalated to the point that it did. A total and complete lack of communication, with no effort on either part. That said, not having read the previous books in this series (which is why I dislike and try to avoid series!), perhaps I would have bought into it more if I had more character background. Nevertheless, it was a good book. ",
          "Love Triumphs!!!A wonderful story of love in Promise, Texas!!!I'm sad that this is the end of the series, but it's never really the end because I can go back to the beginning and start the adventures all over anytime. Thank You, Debbie Macomber for bringing us the people of Promise, Texas!!!",
          "No substance, I must have missed something. Beginning and end where is the story. I did not enjoy this book, there was no story line at all..No substance in this story, I kept going back to see if I missed something. Wish there was a body to this book beginning and end,nothing in between",
          "Faith Renewed Cal and Jane Patterson must overcome pride and stubbornness to save their marriage. Although they love each other, outside influences come between them. The people of Promise offer support and advice. If you've read the earlier Heart of Texas books you will especially enjoy this one.",
          "disappointing ending to a wonderful series. this short novel is unlike the rest of the series, and not up to Macomber usual standard. too much stubborness and just not that interesting of a story line. ",
          "Return to PromiseThis story has a cautionary tale. A marriage that seemed to be great...Until someone from his past wants him. What happens next to the marriage was a wake up call for him.",
          "Debbie Macomber is one of my favorite authors and it was good to visit Promise again. It had been so long since I read any of this series that it took me a bit to remember the characters, so this could also be read as a standalone. ",
          "Love Endures A TestThis book is about a woman trying to break up a marriage. But in the end the husband and wife find their way back to each other. Recommend to all who like love stories.",
          "Loved this bookThere’s never a Debbie Macomber book that I don’t love & this one is just awesome. I love how she expresses love in her stories. Its almost as if Its happening to me. ",
          "It only took me two days to read, though it was a short story and even though I love the characters they dragged on the whole fight with Cal and Jane for too long. I’m glad they stay together wish a producer would make a series on promise Texas.",
          "What a dramatic story. Many things happen, but most of the focus is on Jane and Cal. Nicole tries to break them up. I can't believe Annie doesn't know what is going on. She is not only Jane's best friend but she lives in a town where gossip moves like lightening.",
          "Wonderful!Debbie Macomber has written the perfect ending to her Promise , Texas series! Of course any sequels would be most welcome, too.",
          "This wasn't very Christmassy which was disappointing. The story in itself was ok and it wasn't a problem for me that I hadn't read the other books in the series. ",
          "it was alright",
          "Nice Christmas story w a happy ending",
          "Small town gossip, dense husbands, wives pulled in all directions, I could relate. It was a nice read for a relaxing winter night. "],
        "_version_":1719031959362994176},
      {
        "id":"986060",
        "name":["I''s, Volume 10: To You..."],
        "ISBN":"1421506513",
        "rating":[4.01],
        "publishYear":[2006],
        "publishMonth":[7],
        "publishDay":[11],
        "publisher":["VIZ Media"],
        "countsOfReviews":[2],
        "pagesNumber":[208],
        "description":["At first it seems like a dream come true--Ichitaka has a Christmas Eve date with Iori. But just as he is about to confess his love, Izumi's psycho boyfriend shows up looking for a fight. Then Ichitaka finds out that Izumi is waiting for him at the train station. And one of Iori's friends shows up after her own date goes sour, asking Iori to take her home. But just as it seems the evening will end in disaster, Ichitaka figures out a way to salvage the evening--if only he has the guts to do it."],
        "author":["Masakazu Katsura"],
        "language":["English"],
        "genres":["Manga,Comics,Romance,Shonen"],
        "reviews":["Man, Ichitaka frustrates the hell out of me.",
          "One of my 3 favorite volumes. I love the structure of it, the way that you get the intense emotions in vague flashbacks because all Ichitaka remembers are the feelings not the specifics of the events. And as minor of a character as Yuka was, I still felt for her. This is also the first time I noticed the title of this volume, and I love it. It comes from quite possibly the best 2-page spread in the series. It's so nice to see payoff to all the efforts that Ichitaka had put in. And it feels so real that he still doesn't get a perfect ending.",
          "Le parti Ricordo n.1"],
        "_version_":1719032146497110016},
      {
        "id":"858973",
        "name":["Once Upon a Blind Date"],
        "ISBN":"044661176X",
        "rating":[3.53],
        "publishYear":[2004],
        "publishMonth":[1],
        "publishDay":[3],
        "publisher":["Forever"],
        "countsOfReviews":[0],
        "pagesNumber":[368],
        "description":["Maggie is best buddies with Dominic. Charlie is best friends with Julie. Through the magic of the Internet, they set up their pals on the most romantic blind date ever. Naturally, Maggie and Charlie tag along for moral support-what are best friends for? Yet when the two matchmakers meet, their concerns for their charges take a backseat. As Maggie looks at Charlie, she thinks she feels the earth move. Laying his eyes on his fellow Cupid, all Charlie can think about is kissing her delectable mouth. Shes involved with someone. Hes Manhattans most committed bachelor. What will it take for a pair of modern matchmakers to realize this simple truth: that when it comes to finding a soul mate, true love can be found when you least expect it?"],
        "author":["Wendy Markham"],
        "language":["English"],
        "genres":["Chick Lit,Romance,Contemporary Romance,Contemporary"],
        "reviews":["First book of Markhams I read...made me want to read more. This romance was great. I didn't want to put the book down.",
          "Overall, the book is well written and has a cute plot. It's a bit corny at times, with the characters talking about love after 5 minutes of meeting and annoying at times, with them constantly trying to convince themselves they're all wrong for each other. Part of me likes the characters and another part doesn't. Maggie can get annoying really fast. And I don't quite buy the my best friend is of the opposite sex and neither of us feels any attraction towards the other bit. But the book is an easy read, especially if you're looking for a predictable, fun little story. ",
          "This was a fun read while lounging poolside on our cruise over Christmas 2014. Characters were a little crazy, but it made me laugh and was light enough for people watching at the same time... It also made me thankful that I am happily married and don't need to date as it can be crazy before you find the person you are meant to be with.",
          "cutesy, romantic drivel, but it was fun and kept my attention. ",
          "Fun book to read. The story takes place in NYC. Two friends want their friends to settle down even though they aren't settled down themselves.",
          "My review can be found here:http://romancebookie.blogspot.com/201...",
          "Fun romance. "],
        "_version_":1719032096836550656},
      {
        "id":"896595",
        "name":["An Affair Before Christmas (Desperate Duchesses, #2)"],
        "ISBN":"0061245542",
        "rating":[3.59],
        "publishYear":[2007],
        "publishMonth":[13],
        "publishDay":[11],
        "publisher":["Avon"],
        "countsOfReviews":[414],
        "pagesNumber":[400],
        "description":["Magic under the mistletoe...One spectacular Christmas, Lady Perdita Selby, known to her friends and family as Poppy, met the man she thought she would love forever. The devilishly attractive Duke of Fletcher was the perfect match for the innocent, breathtakingly beautiful young Englishwoman, and theirs was the most romantic wedding she had ever seen. Four years later, Poppy and the duke have become the toast of the ton... but behind closed doors the spark of their love affair has burned out.Unwilling to lose the woman he still lusts after, the duke is determined to win back his beguiling bride's delectable affections...and surpass the heady days of first love with a truly sinful seduction."],
        "author":["Eloisa James"],
        "language":["English"],
        "genres":["Romance,Historical Romance,Historical,Historical Fiction"],
        "_version_":1719032111030075392},
      {
        "id":"711727",
        "name":["The Gamble"],
        "ISBN":"0425195813",
        "rating":[4.12],
        "publishYear":[2003],
        "publishMonth":[5],
        "publishDay":[8],
        "publisher":["Berkley"],
        "countsOfReviews":[5],
        "pagesNumber":[480],
        "description":["A story of honesty and humor for anyone who has ever lived and loved from New York Times bestselling author LaVyrle Spencer.Agatha was the picture of primness and propriety, but her green eyes could blaze with anger--or sparkle with humor.Scott was the picture of lazy charm and happy indifference to what others thought was right and wrong.They were enemies, then friends. Then the sweet innocence of a child opened their eyes and their hearts--and they were reborn in each other's arms by the soft, wondrous gift of love."],
        "author":["LaVyrle Spencer"],
        "language":["English"],
        "genres":["Romance,Historical Romance,Historical,Westerns"],
        "_version_":1719032029758095361},
      {
        "id":"871914",
        "name":["The Summerhouse"],
        "ISBN":"0671014196",
        "rating":[3.95],
        "publishYear":[2002],
        "publishMonth":[30],
        "publishDay":[4],
        "publisher":["Pocket Books"],
        "countsOfReviews":[109],
        "pagesNumber":[416],
        "description":["  Have you ever wanted to rewrite your past?Three best friends, all with the same birthday, are about to turn forty. Celebrating this turning point at a summerhouse in Maine, Leslie Headrick, Madison Appleby, and Ellie Abbott are taking stock of their lives, their loves, and their choices. But none of them expects the gift that awaits the trio at the summerhouse: the chance for each of them to turn their \"what-might-have-beens\" into reality... when a mysterious \"Madame Zoya\" allows them to relive any three weeks from their pasts. Will the road not taken prove a better path? Each woman will have to decide for herself as she follows the dream that got away..."],
        "author":["Jude Deveraux"],
        "language":["English"],
        "genres":["Romance,Fiction,Time Travel,Chick Lit"],
        "reviews":["So The Summerhouse series by Jude Deveraux is pretty popular. I have the first and second book in my collection",
          "The level of suspension of disbelief it takes to get through this book is staggering. The reader is expected to believe that 3 women meet one afternoon in line at DMV. The bond the forge there is so strong {snort} that 19 years later they reunite... having never kept in touch during the interim. Uh-huh. Then of course there's the ability to travel back to relive any 3 weeks of their life, courtesy of Madame Zoya. {double snort} The fact that the three women seemed to take the going-back-in-time-reliving-the-past so instride and without question had me further rolling my eyes. That being said",
          "If you could go back in time - would you? While this book is a serious summer/ice tea read, it stayed with me longer than I expected. If you could go back in time - for three weeks - change one thing - one day, one conversations, would you? When/where/what would it be. Would you be willing to risk what you have now to do so? Or maybe because of what you have now you would? Which prompts my own question - if you could change one thing -- the first credit card you ever got, the first diet you ever when on, or your first love....which would it be? ",
          "Engaging. I didn’t want to stop reading. Very feel good ending.STORY BRIEF:Three women travel to a summerhouse in Maine for a reunion to celebrate their 40th birthday. They share the same birthday. They haven’t seen each other for nineteen years and tell each other about their lives. Terrible and depressing things happened to Madison. A terrible injustice happened to Ellie. Leslie is unhappy and disappointed with people and things. Then a mystical woman offers them a chance to go back in time and spend three weeks there, with their current memories in tact.The first 2/3 of the book is the story of each woman’s life up until her 40th birthday. The last third is what each of them did during those three weeks and how their lives changed afterwards.An important part of the story is men who cause heartbreak and ruin. Men also cause happiness. But this is not a “romance novel.” To be romance, more would be needed on the relationships with men. I see this as womens fiction with romantic influences.OPINION:Madison’s life was too depressing for me, too much heartbreak. I started thinking I don’t like this book. But the ending reversed it and more than made up for it. It was a wonderful ending. Neat things happened to all three women as a result of their do-overs. This was a creative way to explore the road not taken.My main complaint was wanting more details and events during each woman’s three week do-over and resulting life.A second complaint was that during the last third the author jumped around among the three stories too much. She told part of what happened to Ellie, then jumped to part of what happened to Madison and Leslie. Later she returned to finish the Ellie story. It was an “artificial device” to create suspense. The stories were naturally good and didn’t need this.The narrator Melissa Hughes was good.DATA:Narrative mode: 3rd person. Unabridged audiobook length: 10 hrs and 46 mins. Swearing language: none that I recall. Sexual language: none. Number of sex scenes: one, vaguely referred to. Setting: 1981 to 2000 various U.S. locations. Book copyright: 2001. Genre: womens fiction with fantasy time-travel and romance.",
          "Comecei a ler o livro e ainda pensei em deixá-lo de lado, a história começa de uma forma deprimente, 3 mulheres que se junta vinte anos depois e começam a queixar-se de como foram maltratadas pela vida e de como estavam velhas e acabadas. Ora ler um livro destesm no final de Setembro, com o Outono a chegar e nós a passarmos por esta fase que já de si é deprimente, não seria a melhor leitura pois não?Mas e há aqui aquele MAS... a história sofre uma reviravolta incrível que nos deixa vislumbrar a vida daquelas mulheres se tivessem enveredado por outro caminho.E depois sim, foi uma história boa, mas boa de se ler, apenas achei um pouco curta e que no fim depois se precipitou, a autora poderia ter-nis dado mais um bocadinho das histórias de Madison, Ellie e Leslie porque ficamos com um vislumbre apenas no final.Recomendo a leitura desta boa história!",
          "Pre-Read (4/10/15): My mother in law got this book for me for my birthday. Even though I'm basically done with Deveraux's books, but what the hell? :)Abandoned (1/16/16): I'm being honest with myself in the fact that I don't want to read this and I probably never will.",
          "Esperava muito mais deste livro!",
          "Adorei cada momento deste livro. Um livro que fala no poder da vida, da amizade e especialmente do amor. Precisamos de amor na nossa vida. ",
          "Uma leitura leve e viciante. Um romance muito bonito com um toque de magia."],
        "_version_":1719032102269222912}]
  }}