{
    "responseHeader":{
      "status":0,
      "QTime":80,
      "params":{
        "q":"christmas gift",
        "defType":"edismax",
        "indent":"true",
        "qf":"reviews genres description",
        "fl":"*, score",
        "q.op":"OR",
        "fq":["description: family",
          "genres:romance"],
        "rows":"10"}},
    "response":{"numFound":108,"start":0,"maxScore":5.81211,"numFoundExact":true,"docs":[
        {
          "id":"696676",
          "name":["A Gift to Last (includes Angels Everywhere #4)"],
          "ISBN":"1551669307",
          "rating":[4.01],
          "publishYear":[2002],
          "publishMonth":[25],
          "publishDay":[10],
          "publisher":["MIRA"],
          "countsOfReviews":[45],
          "pagesNumber":[240],
          "description":["A Gift to Last is a compilation of two of Debbie's beloved holiday stories, Can this be Christmas? and Shirley, Goodness and Mercy. Both novellas, set during the Christmas season, convey the importance of family and community that have become a trademark of Debbie's writing.Can this be Christmas? is the story of strangers stranded in a shabby New Hampshire train depot on Christmas Eve, away from the families they love and homes they miss. Together, with the help of some local residents, they open their hearts to each other and discover the real magic of Christmas.In Shirley, Goodness and Mercy, three angels are determined to create a miracle for a man who is full of regrets and all alone at Christmas. In their unique ways, they set out to show him what life, joy and Christmas are really all about."],
          "author":["Debbie Macomber"],
          "language":["English"],
          "genres":["Christmas,Romance,Fiction,Holiday"],
          "reviews":["Sweet story of train passengers stranded Christmas Eve, who find the Christmas spirit with a damaged tree, and carolers.Angels Everywhere is the story of Greg Bennett who is divorced, friendless and about to lose his vineyard. Three, prone to trouble, angels help him to find the Christmas spirit.Probably more like 3.5, but fun, light reading.",
            "ForgivenessShirley, Goodness and Mercy, the three Christmas Angels had a hard one this time that required all three of them. Greg had gathered a son, left the girl who fathered his son, married three times ( each of them looked like Janet), put his vineyard before everything else. Was there a chance to turn his life around, maybe with the help from heaven.",
            "Two sweet Christmas stories from Debbie Macomber go so well at the holiday season. I truly enjoyed both stories with Can This Be Christmas being my favorite.The 2 stories are quick reads and bring the spirit of Christmas.",
            "very uplifting I like Debbie’s works, I’ve read MANY of her books and series over the years. They are predictable but in a good way. I’m at a place in my life that I want to look at the better side of life with hope and growth in the right direction. Thank you Debbie MacComber. ",
            "Easy read, very predictable.",
            "Not a fan of either book. too many stories going in inside a small book",
            "fun",
            "Light, feel-good holiday read. Perfect for stress-escape and unwinding at the end of a hectic shopping day.",
            "too predicable - I usually enjoy Debbie's book - but not this one.",
            "Another sweet one (well, two). ",
            "Good book. Light",
            "Love it .a very heart warming story.",
            "Can this be Christmas? 3 starsShirley, Goodness and Mercy2 stars",
            "This book combines two stories from Debbie Macomber: a stand alone focused on a group of stranded travellers and the fourth story in her Angels series (after A Season of Angels, The Trouble with Angels and Touched by Angels).***Can This Be Christmas?***A mismatched group of travellers have ended up on a packed train to Boston on Christmas Eve. Submariner Len is determined to get back to Texas to propose to his long-term girlfriend, recently widowed Cathy is heading to her daughter's for her first Christmas without her husband, salesman Matt is heading back to his family...if they're still waiting and Kelly and Nick are taking their baby daughter home. But when the train becomes stranded at a small New Hampshire station, the travellers must band together to recapture the true meaning of Christmas.This is a cute story and is apparently inspired by an experience of the author's parents. I love snowbound settings so I was excited to read this. The whole story takes place over the course of two days as the travellers are stranded in a small town and opt to stay in the train depot so they won't miss the train leaving. The story is well written with a clever plot, but there are a lot of characters introduced very quickly so I found it a little hard to keep track. This is also a very short story (only 100 pages or so) so it's a very quick read. It is a great story for showing how the Christmas spirit can be captured by anyone regardless of circumstance if only they try. Plot: 8/10; Characters: 8/10; Ending: 8/10; Enjoyment: 8/10***Shirley, Goodness and Mercy*** The irrepressible angels are back in the role of prayer ambassadors again. This time the case is so dire all three have been assigned to work together. Greg Bennett hates Christmas. Mid-way through a divorce, friendless and on the brink of losing the vineyard he's spent 50 years building he has no time for sentimentality or the Christmas spirit. But Shirley, Goodness and Mercy are determined to help him recapture the joy of the season and fix his life.I've really enjoyed the previous angel stories and was a little surprised to realise that the three angels would only have one prayer to answer. The previous books have dealt with three cases, but this is significantly shorter so I can understand the single focus. While I enjoyed the story it wasn't on par with the previous installments. Greg's backstory is presented briefly and ended up being info-dumped on the reader. I found his brother's attitude was incredibly annoying and stuck up. Shirley, Goodness and Mercy also don't get up to as many antics as usual which I really missed. I did like the ending as, while some parts were predictable, one aspect was unexpectedly realistic.Plot: 8/10; Characters: 8/10; Ending: 8/10; Enjoyment: 7/10****************************************************************************************************All in all, this is a quick and easy read that's great for the Christmas season.Average plot: 8/10 Average characters: 8/10 Average ending: 8/10 Average enjoyment: 7.5/10 Cover: 8/10 Overall: 39.5/50",
            "This book had two stories in it.Can This Be Christmas? It is Christmas Eve and all are trying to get home but are stuck in a train depot. Len, a navy sailer, wants to propose to his girl in Texas. Cathy is heading to spend Christmas with her daughter and grandkids, her first Christmas without her husband. Matt hasn't talked to his family on the west coast for a couple of days because of a spat with the wife about him traveling so close to the holidays. Kelly and Nick are on their way to her parents to show their off their new daughter, discovering that parenting isn't always easy. So here they are and what do they do? Read to see how the Christmas Spirit creeps in each of their hearts.Shirley, Goodness and Mercy. My favorite three angels at it again. Greg is as low as he can go but ends up in a church so the three girls are sent to earth again to see what they can do to help him. He's losing his winery, his family and three wifes are gone, does he have anything else? God loves him is just about it. So maybe Greg can change some wrongs into rights and find his son.Another Debbie book that I love--especially reading Christmas stories during other times of the year.My favorite line pg 134: Where else in the universe would anyone assume God is dead and Elvis is alive?234 pages",
            "This book had two stories. The first, Can This Be Christmas, was about a group of travelers stranded at a train station waiting for tracks to be repaired. This group of strangers will become friends after a day and night of waiting. Some questions and observations: when the snow stopped, why couldn't Cathy's daughter come and pick her up at the station since she was about an hour or so away? Shouldn't there be a station master always on duty? How can Clayton just leave? Memories flood back as to how it used to be with no cell phones for communication or entertainment. Also pay phones, calling cards, and disposable cameras are used! I was continuously thinking of food and how these people didn't complain more. No pizza delivery? Chinese? McDonald's? Thank goodness for the Veteran's Women's Auxiliary!  Shirley, Goodness, and Mercy help a man who has lost his wine making vines due to a disease, and his relationship with his wife, brother, and cousin in this story. ",
            "Two interesting Christmas stories. The first Can This Be Christmas? is absolutely wonderful. Strangers stranded coming together to celebrate Christmas is the base of this tale. It short, sweet and amazing. The other story Shirley, Goodness and Mercy is one of the authors tale about three angels sent to help someone become a better person. Set at Christmas time this story too is nice but not as compelling as the first.",
            "Cute little quick read of two stories set around Christmas. The first story is a bunch of random people that you learn about and witness the Christmas spirit as they are all stuck in a train depot on Christmas Eve, very Hallmark moment. The second story is a bit more It's a Wonderful Life where an a-hole gets three angels that come down and try to teach him about being a better person and how it alters multiple lives in the end including his.",
            "Greg Bennett dislikes Christmas, he has a very troubled past and an even more troubled present and future. It takes Shirley, Goodness and Mercy to help him figure out what this Christmas stuff is all about.A quick heartwarming read.Sara FitzgeraldRediscover the True Meaning of ChristmasAuthor of Saving Savannasarafitzgerald.com",
            "This was a great story about a bunch of strangers who are travelling on Christmas Eve and end up having to stay the night at a Train Depot. In the beginning they are angry and upset, but in the end they make the best of their situation. It turns out being one of the best Christmas's of their lives. ",
            "Two Christmas stories-people are stranded in NH trying to get home and sleep in a train station and vintner on the brink of losing his winery donates his bone marrow to his son but he didn't know it was his son. Shirley, Goodness, Mercy were angels. Hokey Christmas stories."],
          "_version_":1718999581410197504,
          "score":5.81211},
        {
          "id":"935154",
          "name":["Underneath The Mistletoe"],
          "ISBN":"082176070X",
          "rating":[3.37],
          "publishYear":[1998],
          "publishMonth":[1],
          "publishDay":[12],
          "publisher":["Zebra"],
          "countsOfReviews":[2],
          "pagesNumber":[256],
          "description":["Yule log blazing on an open hearth, an angel-topped tree sparkling in all its holiday finery, Christmas is a time for dreams to come true, for longings to be fulfilled, and for three young ladies to find the extraordinary gift of love in an anthology brimming with merriment and romance.In Alice Holden's Beneath the Mistletoe, an accident on an icy road brings a dashing young army officer to Megan Wyndom's remote little cottage, igniting bitter memories of a family disgrace and sweet kisses stolen in happier times. In Monique Ellis' The Year Father Christmas Came Calling, a bold burglary at a country inn brings a handsome world-weary Lord to Sarah Forte's doorstep, where he soon finds him-self playing Father Christmas to a disarming group of orphans and the enchanting young woman he longs to make his Lady. In Paula Tanner Girard's Lady Emelia's Christmas Party, a raging snowstorm strands five strangers at Badger Hall, where an eccentric old housekeeper playing the grande dame entwines the hearts of two reluctant lovers."],
          "author":["Monique Ellis"],
          "language":["English"],
          "genres":["Regency Romance,Christmas,Historical Romance,Anthologies"],
          "_version_":1718999722508681216,
          "score":5.171025},
        {
          "id":"682563",
          "name":["Santa Baby"],
          "ISBN":"0821772945",
          "rating":[3.52],
          "publishYear":[2002],
          "publishMonth":[1],
          "publishDay":[10],
          "publisher":["Zebra"],
          "countsOfReviews":[28],
          "pagesNumber":[416],
          "description":["This title contains stories including \"A Baby for Christmas\" by Lisa Jackson, \"Under the Mistletoe\" by Elaine Coffman, \"Holiday Stud\" by Kylie Adams, and \"Merry, Merry Mischief\" by Lisa Plumley. \"A Baby for Christmas\" - It's turning out to be a Christmas of surprises for lonely Annie McFarlane. First, there's the adorable baby left on her doorstep, followed a day later by the angry, dangerously attractive man claiming to be the child's father. Liam O' Shaughnessy may be intimidating, but this is one precious gift Annie isn't giving up without a fight...\"Under the Mistletoe\" - Dr. Stanley Levine keeps his house like his life - orderly, predictable, serene - until the day eccentric Southern belle Holly Noel moves in next door with her brood of seven girls. It may be Christmas, but that doesn't mean the dedicated bachelor has to kow-tow to an unruly clan defended by one maddening, sultry mama...\"Holiday Stud\" - The only way single, successful career woman Audra Jarecki can face a Christmas homecoming - and the pitying eyes of her family - is with a gorgeous boyfriend on her arm. Hiring hunky Colby Douglas may be the worst mistake of Audra's life...or the answer to everything on her Christmas wish list. ..\"Merry, Merry Mischief\" - Flirty Katie Moore is the ultimate good-time girl. Too bad she's held up at the office, helping nose-to-the grindstone architect Jack Brennan with a very special project: emergency babysitting for the boss' tiny daughter. Now, the party girl and the workaholic are joining forces to give the little bundle of joy a Christmas she'll never forget..."],
          "author":["Lisa Jackson"],
          "language":["English"],
          "genres":["Christmas,Romance,Anthologies,Contemporary Romance"],
          "reviews":["Loved all the stories but my favorite was the third story. Under the Mistletoe by Elaine Coffmann, featuring two unlikely people who fall in love and find closure for what is missing in their lives. Laugh out loud comical with 7 children, one cat, a nanny and a housekeeper. These neighbors will keep the good Dr. perplexed until he decides he has a hole in his life just him and the dog Plato. I love Lisa Plumley so her story would be the next favorite -- Merry Merry Mischief. A former couple who team up to babysit his baby cousin when the boss and wife are stuck overseas with a snow storm. Lisa Jackson's story, A Baby for Christmas, was cute but felt rushed; nevertheless I enjoyed it very much. Kylie Adams, Holiday Stud was a bit unbelievable and corny and yet I found myself smiling at the end.",
            "Four Christmas love stories to get you in the spirit! Humour, Hope, Dreams, and Love for the holiday season.",
            "This was a book with 4 romance Christmas stories in it. All very easy to know what will happen, the typical romance novel.",
            "This title contains stories including A Baby for Christmas by Lisa Jackson",
            " A group of 4 contemporary Christmas stories from authors I've never heard of & never heard of since. Lisa Plumley 3 stars - A light hearted Christmas romp involving a happy go lucky party girl & her co-worker/former boyfriend who is a workaholic. They get stuck watching the boss's baby daughter over Christmas & reconnect. I liked it!Kylie Adams - 1 star - The only turkey in this bunch. Female lead, who is a lawyer for a modeling agency has to go home for Christmas with a handsome boyfriend (& is hoping for some HOT sex). Male lead, who is friends with a celebrity gigilo agrees to stand in for his friend when a scheduling snafu occurs. It's as nasty as it sounds!Elaine Coffman - 4 stars - You wouldn't think I'd like a story about a woman who's been married 3 times (divorced twice, widowed once). However, this is the best story in the book! I really liked Holly & I LOVED Stanley! Holly is mother to 7 (!!!) little girls, 4 of her own & 3 of her dead sister. Stanley is a confirmed bachelor who hates kids (when they get into his yard & destroy his garden). Over the course of 6 months they fall in love. The heroine & hero are both older (35 & 40)& that's a nice change.Lisa Jackson - 3 stars - interesting twist on the caught in a blizzardin a cabin in the woods story. There is a crime background story involving the hero & the heroine's sister. In fact",
            "Lisa Plumley's Story sucked really bad. I couldn't wait to finish it. Kylie Adams, story was funny and amusing also a lot better than the first. There were good steamy parts. Elaine Coffeman's Story was the best of all four and funny. I found myself really rooting for Stanly and Holly. very enjoyable story. Last story by Lisa Jackson was good as well and was fun to read. Thus story also had seamy sex as well. All the stories had a common theme babies or young children in them. Only if you like romance this book is good for you thought I would skip the first story all together. ",
            "Like watching a hallmark channel movie, only worse. The stories go like this:Story 1--ehStory 2--ughstory 3--oh god please stopStory 4--better, but is that just because the last one was so awful?",
            "This was not my kind of book. While I don't mind passionate scenes, this was a little too risque for me. The title should have clued me in that it was more like the Christmas song and not a whimsical choice. Definitely not on my recommendation list.",
            "The Plumley one was OK; one was unfinishable (nice idea, horrible writing); and the others were so-so--weak, but not awful.",
            "Good stories. Liked the characters and the storylines.",
            "Fast and fun, I love Christmas anthologies!",
            "Cute stories with lots of romance and happy ending. I suggest you read this during the holiday season. It was okay.",
            "Really cute. Predictable, but heart-warming. :)",
            "Have looked my old copy,but can't find it. Avery funny and romantic read.",
            "Each story was completely different. Yet I was interested in all of them and able to read the book very quickly.",
            "Four contemporary stories are in this Christmas themed anthology. I can't really recommend any of these stories, though the Coffman and Adams stories do have some funny moments. My rating: 2.5 Stars.",
            "Cute Stories for the holidays!",
            "meh. very meh. one was so awful I could barely start it, much less finish.",
            "All four stories were very good and a great start to kick-off my Christmas reading!",
            "Four good holiday short stories. I enjoyed the last one, A Baby for Christmas the best.",
            "Really enjoyed the Elaine Coffman story"],
          "_version_":1718999571611254785,
          "score":4.9693136},
        {
          "id":"884423",
          "name":["Christmas Rendezvous"],
          "ISBN":"0821735896",
          "rating":[3.72],
          "publishYear":[1991],
          "publishMonth":[1],
          "publishDay":[11],
          "publisher":["Zebra"],
          "countsOfReviews":[3],
          "pagesNumber":[383],
          "description":["Kiss of the Christmas wind by Janelle TaylorAs newlyweds Carrie Sue and Thad Jamison plan their first Christmas together, Thad must leave to track a gang of vicious bank robbers through the Montana wilderness. Will he return in time to receive a very special Christmas gift?Circle of love by Carol FinchStruggling to survive in the aftermath of the War Between the States, Pilar Maguire feels nothing but envy toward her handsome neighbor and his grand house on the hill... until he helps her remember the true meaning of Christmas.Texas magic by Emma MerrittHannah Driscoll only married Wade Carmichael to help save the town of Mistletoe, Texas. But will the holiday spirit turn their business arrangement into a whirlwind of passion and joy?Cheyenne mistletoe by Georgina GentryThe first winter after the land run, Genevieve Malone barely has enough to keep her family going, but when a half-breed drifter seeks shelter on a snowy December night, she welcomes him into her home— and her heart.Tidewater promise by Jo GoodmanVirginia beauty Courtney McClellan has lost her faith in happily-ever-after... until a childhood friendship blossoms into a once-in-a-lifetime love.Cactus and thistle by Evelyn RogersWhen Mattie Campbell leaves her Texas ranch to share a white Christmas with her late husband's family, she never ' expects to find sizzling romance instead of snow!"],
          "author":["Janelle Taylor"],
          "language":["English"],
          "genres":["Anthologies,Christmas,Romance,Historical Romance"],
          "reviews":["KISS OF THE CHRISTMAS WIND (Janelle Taylor)Briefly: This is an illogical and convoluted plot. Thad Jamison has to chase bank robbers (and such) since the government did not keep his new wife, Carrie Sue in prison for her crimes. He's paying for her crimes by chasing robbers and murderers. Go figure.CIRCLE OF LOVE (Carol Finch)Pilar Maguire is envious of her neighbor, Grayson Hart. It is after the Civil War and times are hard. Grayson lives in a large, stately home, is handsome and has money. Pilar, on the other hand, lives with her grandfather and siblings. Grayson is lonely and enjoys Pilar's family. She is constantly surrounded by family and would like to have some independence and wealth.I did not like Pilar; she spent too much time whining about her circumstances. Grayson must REALLY have been lonely.TEXAS MAGIC (Emma Merritt)Wealthy widow Hannah Driscoll married Blade Carmichael to get him to come to Mistletoe, Texas as town marshal. Blade had insisted on it. Now he would like to renegotiate their terms of marriage -- away from one of convenience to a loving relationship.CHEYENNE MISTLETOE (Georgina Gentry)Genevieve Malone is trying to save her starving family by selling mistletoe in a saloon. A half-breed (Hawk) saves Genevieve from the taunts and bold behavior of the saloon's inhabitants. Later, Hawk gets lost in heavy snow and eventually travels toward a light. Genevieve invites Hawk in for the night.TIDEWATER PROMISE by Jo GoodmanCourtney McClellan has just announced the end of her third engagement -- days before the wedding. While her family is dissecting her behavior, Courtney sees a childhood friend. Cameron Prescott encourages Courtney to talk about her broken engagements. While enumerating the problems with each man, Courtney starts to see the problem. She understands why each is the wrong man ... and who the right man is.CACTUS AND THISTLE (Evelyn Rogers)Mattie Campbell has come from Texas to England. While traveling, she decides to visit her late husband's family in Scotland. She is shocked to find her husband's cousin, Robert, a rigid and cold man. He wants to know what she wants -- after all, she has traveled hundreds of miles just to see folks she's never met before. But the trouble really starts when Mattie announces that she wants to have a big celebration with Robert's tenants and their families.---I thought most of the stories were marginal, at best. The first story had an illogical plot. The second story had an interesting plot but the heroine was unlikable. I enjoyed TEXAS MAGIC; the characters and plot were entertaining. The incidents in both CHEYENNE MISTLETOE and TIDEWATER PROMISE were so outlandish for their time, I lost interest. However, there was lots to like about CACTUS AND THISTLE. It is a story with complex emotions and stubborn pride.",
            "OVERALL:Kiss of the Christmas wind by Janelle TaylorCircle of love by Carol FinchTexas magic by Emma MerrittCheyenne mistletoe by Georgina GentryTidewater promise by Jo GoodmanCactus and thistle by Evelyn Rogers",
            "JANELLE TAYLOR = KISS OF THE XMAS WIND"],
          "_version_":1718999686035013633,
          "score":4.760358},
        {
          "id":"968356",
          "name":["Comfort and Joy"],
          "ISBN":"0821780484",
          "rating":[3.77],
          "publishYear":[2007],
          "publishMonth":[1],
          "publishDay":[11],
          "publisher":["Zebra"],
          "countsOfReviews":[42],
          "pagesNumber":[478],
          "description":["Curl up by the Yuletide with these heartwarming stories that add a touch of wonder to your holidays. . .\"Comfort and Joy\" by Fern MichaelsEver since Angie Bradford took over her mother's gift wrap business in the Eagle Department Store, she and handsome store chief Josh Eagle have been at odds. When Josh threatens to give up on the business and move to London, and a devastating storm may destroy their Christmas season, Angie never expects help to come in the form of a holiday miracle. . .\"A High-Kicking Christmas\" by Marie BostwickAfter ten years as a Rockette at Radio City Music Hall, Kendra Erickson needs a break from Christmas. But when an injury lands her in small-town Vermont where she finds herself directing the local holiday pageant alongside the charming new pastor, Kendra reconsiders her views on life, love--and the most romantic season of all. . .\"Suzanna's Stockings\" by Cathy LambWhen an accident lands Suzanna Everts in the hospital for Christmas this year, she'll need a little magic to save the holiday season. Enter sexy, but Scrooge-like, land developer Jack Benson to the rescue, proving to Suzanna that the best gifts are those that take you completely by surprise. . .\"Family Blessings\" by Deborah J. WolfTired of dealing with her squabbling family, Kacey would rather not be home for the holidays. But Christmas memories hold a special power that is enough to remind a family of the blessings they share--and awaken Kacey to the promise of new love. . ."],
          "author":["Fern Michaels"],
          "language":["English"],
          "genres":["Christmas,Romance,Fiction,Anthologies"],
          "reviews":["This is a collection of stories by four authors. Stories that the characters overcome problems in their lives. This book is fiction but gives you good feelings for the upcoming Holiday Season. Who doesn't need some good feelings this time of year? I recommend this book to anyone looking for a bit of happiness for Christmas. Enjoy. Merry Christmas!",
            "Popcorn book. Quick and easy to read. The first 2 stories were just what you expect - light, fluffy, with a little bit of substance. The 3rd story was, strange. Not bad, just a little odd. The 4th one was a little like Return to Bountiful meets a bit of a love story. And all the 2ndary characters made me angry.",
            "Four stories - 1. Fern Michaels - Comfort and Joy - Angie Bradford and Eagle2. Marie Bostwick - A high-Kicking Christmas - Kendra Erickson and a charming new pastor3. Cathy Lamb - Suzanna's Stocings - An accident lands Susanna in the hospital for Christmas. Jack Benson comes to the rescue.4. Deborah J. Wolf - Family Blessings - Kacey's reunites her family.",
            "As silly as you would expect. I would have given two stars, but the last story was actually better written and had complex characters.",
            "Good book to get into the holiday spirit best story for me was Suzanna's stocking",
            "some of the stories were good some of them were strange.",
            "Easy quick read story for an evening entertainment "],
          "_version_":1718999742485102592,
          "score":4.75598},
        {
          "id":"674438",
          "name":["Mistletoe Bay (Misty Harbor, #7)"],
          "ISBN":"0821780093",
          "rating":[3.95],
          "publishYear":[2007],
          "publishMonth":[1],
          "publishDay":[10],
          "publisher":["Zebra"],
          "countsOfReviews":[24],
          "pagesNumber":[320],
          "description":["Nestled beside the coastal town of Misty Harbor, Maine, lies the picturesque village of Mistletoe Bay. There, overlooking the clear blue sea, is a charming old house that's the perfect place to gather for the holidays and give thanks for family, good friends, and bright new beginnings...When Cooper Armstrong left California to return to Maine, he also left a cheating ex and all his plans for settling down. Now Coop concentrates on taking care of his ailing father and learning his route as the area's new UPS man. It's not just Coop's parents who need assistance—Jenni Wright, whose blossoming new business has him making daily deliveries to her property, could clearly use some help. With three young sons, her mother-in-law, and a teenage niece all sharing a rickety house that seems to be held together with duct tape, Jenni has her hands full. To Jenni, Coop is their UPS guy, handyman, and her boys' guardian angel all in one gorgeous package. She's sure he'd run a mile before getting involved in the chaos of her life. But as Thanksgiving gives way to Christmas, the lovely, resilient Jenni turns Coop's expectations of a cold, lonely winter upside-down, revealing the promise of warmth, love, and a lifetime of happy memories.\"The magic of everyday pleasures permeates Evanick's contemporary romance...Evanick has a gift for finding the humor in small details, and her story of opposites who attract unfolds with endearing warmth.\" —Publishers Weekly on Harbor Nights\"Evanick's enchanting series never skimps on humanity, warmth, and romance.\" —Romantic Times on Harbor Nights"],
          "author":["Marcia Evanick"],
          "language":["English"],
          "genres":["Romance,Christmas,Contemporary Romance,Contemporary"],
          "reviews":["Mistletoe Bay was in a word, wholesome. I was cracking up throughout the book, it was just fantastic!This Christmas romance followed Jenni, a widowed mother of three crazy, hilarious boys that were the source of most of my laughter, as she navigates starting a new business in a new town and meeting a new man. Living with her is her late husbands mother Dorothy and sister in law, Felicity, and the book follows their adjustments to the new town of Mistletoe Bay and new love.The highlight of this book was the three little boys, particularly Tucker, 5 year old with a vivid imagination for new ways to make trouble. He’s just hilarious and the highlight of this book.Coop, the UPS man with a darker past of his own can’t help but be drawn to Jenni and her crazy family. He helps around the house with fixer upper tasks and as everyone settles in, and Tucker continues to make trouble, Felicity starts to feel left behind. How the family handles this conflict could leave everyone miserable. I give this story 5 ⭐️⭐️⭐️⭐️⭐️ even though it felt wrapped up too quickly, it was just so wholesome and adorable and hilarious! The chemistry and love stories is just perfection. It’s so well done and I just can’t say how much I loved this story.My six word review:You’ll laugh so hard you cry!Steam rating:For a romance, there’s maybe only 3 pages of steam. It’s the perfect amount and not too graphic.If you want to laugh like crazy while reading about so many unique love stories, this is the book for you!",
            "Good, old fashioned love storyI read Ms. Evanick 's book many years ago and had forgotten how wonderful her stories were, how realistic her characters are. I also appreciated how low key the sex scenes were. It's a very nice change.",
            "Challenges of life with three active youngsters and extended family. Humorous love story. Loved reading this book.",
            "First time reading this author: and glad I picked her book up... all because the name implied it was a Christmas themed book that caught my eye.... loved the cover, the colour of it ... love blue covers. .... and the synopsis on the back cover made me want to know more of these people and their lives. Started this book yesterday... from the first page I couldn't believe how this flowed and held my interest. Real life everyday scenarios... in countryside small town living ... & a caring person doing his everyday because circumstance of his own life brought him to this place in time. A caring inquisitive man doing is job ... involving his instinctive self . How could not keep reading ?10:58 PM 19 August 2015 .. was searching to see what books had been written this series Misty Harbor ... I'm stifled ... but I just did a search to find out and am teeter-tottering with emotion.. she passed away this summer 2012. omg. Her words are so full of life in this book 2007 ... how sad. 21 Aug 2015 - An awesome finish to an awesome storyline ! had a hard time to put this book down. ",
            "So nice that I finished this on Christmas Day. It was one of the last books my grandmother read before her death. She read it 6 Christmases ago and I couldn't bear to read it until now. I gave it a 4 because I could hear her laughing at the little Boy tucker that resembled her grandson Jackson. It wasn't Austen or dickens but she loved it. She even wrote hysterical on the inside of the cover to remind herself. I love that I could have a small piece of her this Christmas. The book was funny and really a 3.5 but I could feeling her read it with me. That made it a 5! I was smiling and laughing as I read it. I can even see her little hands holding the binding. What a wonderful book that we finally shared. Thanks grandma for sharing one last book with me. ",
            "Cute story about a young widowed mother who recently moved to a quaint town with her three rambunctious boys, her mother-in-law, sister-in-law and a bunch of pets. Jenni runs a business out of her barn while Dorothy cooks and watches the boys. UPS deliveryman, Coop, never knew what to expect on his daily trip to her house and once he met Jenni he started coming over to fix things on the house and get fed delicious food.It is interesting to read how the household blends and the crazy things that happen. There are romances for all three women in the house and of course a HEA. I'm not usually that into romances with children, but I really enjoyed this one.",
            "Bummer. The last in the series (I think). I really enjoy Evanick's world and writing style. I picked this up after being disappointed by something else and was instantly sucked into an enjoyable story with nicely building interest and passion. My one complaint would be the lack of interaction with previous characters from the series. We heard about Daniel, Gwen, Dr. Sidney and a few others but really didn't see them at all. I enjoy seeing the continuing lives of characters from previous books, but as complaints go that's pretty minor. Also nice to see the 3 (well really 2.5) generations interacting. Actually 4 when you add in the boys.",
            "Jenni - widow, business owner, mother of 3, lives with her mother-in-law and sister-in-law is a run down / falling down home with a small zooCoop - single man, UPS driver, AKA Mr. BrownDorothy - Jenni's mother-in-law",
            "multi generational romance: widow with 3 young children falls in love with delivery man. Her mother in law falls in love with the father of her teenage daughter's boyfriend and of course, the teenager finds first love with young man but is upset that her mom is in love with the boyfriend's dad.",
            "The final book of the series, and just as enchanting as all the other stories in the series. There are moments of fun, moments of every day problems and a lot of love. I will always wish there were more stories to this series.",
            "Was the first book I read of hers and the series now I am determined to read them all. A really great read!",
            "Cute and feel good Christmas holiday read! ",
            "This is one of my favorites but if I remember correctly, there is quite a saucy scene that some of you might want to skip over. :) (It is a romance novel).",
            "dnf because the story was too simple and sweet. the kind of romance everyone wants to live not necessarily to read about. no tension or suspense.",
            "This book had a good solid story and a touching romance. I would recommend.",
            "it was cute and romantic. it is nice of evanick to give second chances to widows/widowers with children...who are her usual characters, at least with 2 of her books i've read so far.... =)",
            "Good story; liked that it was about a widow with young kids who finds love again!",
            "Omg this was so good and funny. Enjoyed all the characters. I hope there is more. ",
            "Cute story"],
          "_version_":1718999567106572288,
          "score":4.1121874},
        {
          "id":"669647",
          "name":["The Christmas Basket"],
          "ISBN":"1551669447",
          "rating":[4.0],
          "publishYear":[2002],
          "publishMonth":[24],
          "publishDay":[9],
          "publisher":["MIRA"],
          "countsOfReviews":[273],
          "pagesNumber":[240],
          "description":["No one tells a Christmas story like Debbie Macomber. The Christmas Basket is filled with gifts for the reader -- gifts of warmth and laughter . . . and emotional truth. This Christmas, let Debbie make you smile! That summer -- more than ten years ago, while they were still in high school -- Noelle McDowell and Thomas Sutton fell secretly in love. Secretly because their mothers had been locked in a bitter feud for decades. But despite the animosity between Sarah McDowell and Mary Sutton, Noelle planned to elope with Thom. Until he jilted her. This Christmas Noelle McDowell is home to celebrate the holidays with her family. (After all, December 25 is also her birthday.) Unfortunately, Noelle's feelings about home -- or rather, her hometown of Rose, Oregon -- were changed forever the day Thomas Sutton broke her heart. This Christmas the feuding mothers find themselves working together to fill Christmas baskets for charity. What irony! And what an opportunity for reconciliation . . . if only they could see it. This Christmas Noelle and Thom discover they're still in love. Regardless of their mothers' reactions, they want to be together. Is that possible? Can old rivalries be set aside? Will Sarah's Christmas daughter have a second chance with Mary's charming son? Maybe she will . . . this Christmas!"],
          "author":["Debbie Macomber"],
          "language":["English"],
          "genres":["Christmas,Romance,Fiction,Holiday"],
          "reviews":["Debbie Macomber is the queen of cozy contemporary romances. Her books are Hallmark movies in book form. They are sweet, wholesome and completely G- Rated. I'm not usually into this type of book but at Christmas time I fucks so hard with it! The Christmas Basket is about Noelle and Thom, who were high school sweethearts until Thom ghosted her. Now many years later Noelle is back in town for Christmas and things with Thom are about to heat up. Noelle and Thom's romance was fine. It was nothing special but I didn't hate it. The relationship I loved was the relationship between Noelle and Thom's mothers. Its not romantic, they're frenemies. Mary and Sarah were hilarious and their fights were so petty and dumb. I loved it. Mary and Sarah should have been the main story. If they had been this book would have been a 5 star book. But I still enjoyed it overall and I would definitely recommend it to any who wants to fit one more Christmas book in before the big day.",
            "Christmas 2017 - NaughtyI've been so cranky and Scrooge-like lately, as I attempt to find a Christmas themed novel that I like. I've added three books in a row to my Couldn't Finish list and I hate doing that. So I was determined to finish this one. I probably shouldn't have because it did nothing to sell me on this genre.This was a slight",
            "This delightful Christmas tale is a lesson in forgiveness and hope. Two best friends have a falling out when one won’t forgive the other for a lapse in judgment and a deception. The husbands, being golf buddies, remain in a secret friendship, and their kids plan to elope. Alas, a miscommunication results in a severing of that romance. But now, it’s ten years later, and it’s Christmas- the season for miracles. This story will give you a warm fuzzy feeling, with its likable characters and Christmas setting. But the way things work out may surprise you a bit!",
            "Predictable, embarrassingly ridiculous at times and not quite the touchy-feely Christmas book I was hoping for. Nice for the romanctical elements though. ",
            "Cute Short StoryThis is definitely a book that can read in one sitting...there isn't a lead up...it just starts right out in the action and drama. ",
            "Read for a Dec challenge. Silly story. One dimensional characters. You could see the ending a mile away. Thank goodness it's an easy & quick read.",
            "Noelle is on her way home for Christmas - not too unusual, except she hasn't been home for over 10 years. She left her hometown of Rose behind because the memories of her breakup with Thom were to painful to stay. She decided to come home because her sister Kristen is getting married and wants her to be home to help plan the wedding. Things haven't changed to much at home, her mom Sarah and Thom's mom Mary are still feuding over a misunderstanding that destroyed their friendship. Sarah does her best to avoid Mary, but if she wants to use the Women's Century Club's hall for her daughter's reception, she is going to have to work with Mary on a project - putting Christmas Baskets together for some families that really needed some help during the holiday.This was a great holiday story. Seeing how misunderstandings can wreck a relationship that seemed so solid made me think about my relationships and how valuable they are to me and how I will always seek out someone when it seems there is something wrong. Different perceptions of situations can cause rifts that will never heal unless someone talks about it.I really enjoyed this story. A good message.",
            "This book is a rewrite of the Romeo and Juliet story. Two families that have been at odds for years due entirely to the Moms of these families not getting along. It is a fun read with likable characters and crazy situations. My kind of book! The story is perfect for Christmas with forgiveness, second chances, redemption and a long time coming marriage proposal. Debbie Macomber continues to entertain. ",
            "This was a cute fast read. I rated it a 4 because I didn't care for the ending, and it seemed to center around the tea service a little to much, with no closure. But I did like the story line about Noelle and Thom. It was a heartwarming Christmas miracle but not what you expected the miracle to be about.",
            "Nice Christmas romance, but a little to cheesy for my liking & Oh the Mothers!!!! Annoying, overbearing drama queens.",
            "The Christmas Basket is a sweet book by Debbie Macomber, revolving around a sweet romance and two rivalling women making baskets during the Christmas season.Ten years after Noelle and Thomas fell in love and broke up, they are coming back together again. But, their Mothers are constantly at each other's throats. Their rivalry is big and wicked, especially with them making the same Christmas Baskets together. Will their families accept their love even though they're feuding? This second chance romance is super sweet, with a lovely setting of Christmas. This is far more of a romance book than a Christmas book, but it's still a great read. It's soft, simple and easy to just lie back and read a tea with. It's super cozy! If you want a relaxing read with a predictable storyline, this is perfect. Honestly, it was just what I needed. A sweet, easy read with Christmas themes in July! Three out of five stars.",
            "http://ceceliadowdy.com/blog/2013/11/...When Sarah McDowell visits the exclusive women's country club in town, she has a mission. She must reserve the club for her daughter, Kristin's, wedding. She's hoping she doesn't run into her worst enemy for the last 20 years, Mary Sutton. Long ago, Sarah was a real estate agent. She borrowed her best friend's, Mary's, family heirloom tea set to supposedly display at a house she was showing. However, Sarah lies to Mary, the silver tea set was not used for Sarah's showing, but, for a showing for one of Sarah's co-workers. The tea set is stolen, and Mary has never forgiven Sarah for lying to her and mishandling her tea set.Sarah's daughter, Noelle, was Mary's son (Thom's) high school sweetheart. Part of the reason Thom and Noelle broke up was because of the family feud between their mothers. Now, about ten years after that nasty breakup, Noelle is back in Rose (her hometown). It was too painful for her to return to Rose after Thom stood her up the night they were supposed to elope.It's Christmas, and Noelle is finally going to be spending the holiday with her family...the only problem is, the first person she runs into is Thom. Can they work through the past and heal from their pain? Thom was hurt, too, that awful night and he finds it hard to forgive Noelle for all that's happened.This story was extremely light Christmas reading. It was sort of pleasant, but, very predictable. I found it hard to read about the hostile animosity between Mary and Sarah. The two women were so immature that they acted like children. Acting like that for twenty years would wear me down...I'd think I'd get tired of it after awhile. I'd probably end up moving away (to avoid my enemy), or, risk having a heart attack!I enjoyed reading the story, and I also loved the nice, whimsical Christmas atmosphere. However, I did not enjoy it AS MUCH as Macomber's other books.Many thanks to Harlequin MIRA for providing me a free review copy through Net Galley.http://ceceliadowdy.com/blog/2013/11/...",
            "This is a delightful little read that incorporates the best of Christmas--romance, forgiveness, and redemption. Noelle McDowel is home for Christmas for the first time in nearly a decade. She and her fiance had planned to meet in a park in their town and go from there to wherever they could pull off a quick, clandestined marriage. But he went to the park, and she didn't show up; she also went to the park, and he wasn't there. So painful was the experience of being stood up for her that she left the small Oregon town where she grew up and vowed never to come home again. But it's Christmas, her sister is getting married in the upcoming summer, and Christmas day is also her birthday. She risks a trip home, hoping to never run into Tom Sutton, the guy who stood her up.To make things worse, the couple's respective mothers have been feuding for years. They were once best friends, but a stolen tea service and a misundrestanding drove wedges into the friendship that ultimately turned it into a nasty feud. The secretary of the country club to which they both belonged assigned them to work together on the preparation of Christmas baskets for delivery to the Salvation Army.Open this book to read about the two families and the sometimes-painful, sometimes-humorous journey they took to be reunited in friendship and love. There's a small amount of profanity here early on in the book, but there are no explicit descriptions of sexual activity, so if you enjoy a Christmas-based romance that includes a lot of forgiveness, this will likely fill the bill for you. None of these characters are memorable for long, but this is a bit of Christmas fluff that will make you smile and give you a warm dose of the seasonal spirit.",
            "“The Christmas Basket by Debbie Macomber is a quick read, set in modern-day small town Rose Oregon. It's a frothy, happy-ever-after tale that is fun and satisfying to read, which of course is what you expect from a Christmas story, especially one written by Debbie Macomber.I enjoyed the funny side joke renames: 'Curtains' OS, Value-X with blue light specials. ***SPOILERS***From the first chapter, it's quite obvious Noelle and Thom will get back together. I was certain that Kristen had sabotaged their elopement, thinking it was for the best. Having the time on the note smudged by spilled soda is really weak. Instead the author could have written that Kristen altered the note, thinking she was saving her sister from a mistake; that would have provided a stronger plot thread, more in line with the family feud. The mothers' antics in the stores were not very credible. Both trying to buy the same toys at the first store would certainly have alerted them they each had the same list. I can see bumping carts out of temper, but buying 250 candy bars? How does that hurt your opponent in an argument? I think the second store and the candy bars were just added to 'pad out' the story.If Thom had not immediately identified the young boy with him at the movies as his nephew, instead just introduced him by name, it would have created more suspense as to his relationship status.The tea set that was so critical to the feud seemed to be a forgotten loose thread by the end of the book. Noelle said she was going back to buy it, but it's never mentioned again. It's also pretty obvious that Cheryl stole it, and not credible that the best-friends mothers never suspected Cheryl or attempted to recover it from her, before becoming enemies",
            "In this story, Noelle McDowell and Thomas Sutton keep getting pushed together by fate. It would be a good thing, but unfortunately, neither one of them wants anything to do with the other. You see, they used to be high school sweethearts and they had planned to runaway together because their mothers can't stand one another. Unfortunately, he went to the park at 3pm to meet with her and she went at 8pm all because of a spilled soda (I didn't like this explanation at all). Fast forward 10 years, and the mother still hate each other over a stolen heirloom tea set and a lot of petty childish rivalry. Just before Noelle arrives home from Dallas, Tx, her mother is forced to work with Thom's mother on a volunteer Christmas Basket project for their country club. If she doesn't then her daughter, Kristen, can't marry at the club. To come together in the story, the characters experience finding the wrong antique tea sets, a blizzard, a minor car wreck, some scotch on a freezing night, some popcorn throwing in a theater and a few store scenes including one that leads to both mothers being banned from shopping at the Value-X. In the end, the story ends just where you hope it will with Noelle and Thom together planning their future and their mothers finally breaking their childish cycle of bitterness toward one another. A delightful read for the holidays. ",
            "The Christmas Basket by Debbie MacomberNoelle MacDonald was returning home. She hadn't returned since Tom Sutton had jilted her because of their mothers.She writes in her journal, she booked the flight to Rose, home...She even lost some weight and she's prepared to see Tom. Sarah and Mary are the mothers and Sarah wants to book the club for next summer. Problem is Mary is in charge of all that now...there are new rules in place and she must do 10 hours of community service before the end of the year.She and Mary are to work together-buy toys for the baskets together. The story comes out about the tea service the mothers had words over and about her and Tom's to be wedding mishap that made her leave.At the Christmas Club dance they are dancing and they hash over what happened that night they were to wed...Tom and Noelle do get to talk, many times to help solve the problems their families and themselves have. Is it going to be enough....When the ice storm throws the women together we wonder if they will become friends once again...I received this book from National Library Service for my BARD (Braille Audio Reading Device).",
            "More than 10 years ago, while still in high school, Noelle McDowell and Thom Sutton fell in love. They kept it a secret though, because their mothers had been in a bitter feud with each other for several years. When they were both 18, Noelle planned to elope with Thom, but then he jilted her.This Christmas, after avoiding her hometown for a decade because of painful memories, Noelle is home to celebrate the holidays with her family. She can't avoid running into Thom though, and they discover they are still in love, and regardless of the animosity between their mothers, they want to be together.Both mothers find themselves working together to fill Christmas baskets for charity, which would be a perfect opportunity for reconciliation, if only they could see that!This was a quick, feel good read",
            "What a tale! As usual, Macomber melds emotions with more than a few laughs to create a heartfelt tale that really connects you with the characters. The completely over the top reactions from the characters were priceless. Noelle’s mother was absolutely ridiculous. She was so absorbed in an age old feud that she didn’t take anyone else’s wants into consideration. Thom’s mom wasn’t much better. Together they served to create an interesting backdrop for the emotional reunion between Thom and Noelle. I really enjoyed the way that the characters all played into the intimate second chance romance that Macomber has created.This novel is absolutely hilarious year round. It’s great for those looking for a quick, sweet read that will give you more than a couple of laughs. ",
            "This was a holiday read about forgiveness, friendship and love. I actually saw this as a Hallmark movie but based around Halloween instead of Christmas and with quite a few creative liberties - though I did enjoy the movie. It is about a man Thom and a woman Noelle who were childhood friends and high school sweethearts but who had a terrible misunderstanding that separated them for 10 years. Their mothers also used to be very close but had a falling out and now it is a ridiculous rivalry that explodes in all areas from gossip to value mart fights. When Noelle comes home for the first time in 10 years she and Thom are thrown together again and again as are Mrs. Sullivan and Mrs. McDowell.",
            "What a delightful read. More than ten years ago, Noelle and Thomas fell in love, but with their feuding families both feared how each family would respond. So, Noelle and Thom planned to elope... that is until Thomas jilted her at their designated meeting place, or so Noelle thought. Angry and hurt, Noelle moves away and stays away for 10 years. She is one her way home Christmas when runs into Thom on the plane. Both discover they are still very much in love and work together to heal the pain of the last 10 years and restore their families friendship. A great read for any Debbie Macomber fan or anyone looking for a Christmas romance. ",
            "Great story of 2 women who have hated each other for last 20 years. They let some petty thing come between their friendship. They are thrown together at local club to do charity work on preparing Christmas baskets for Salvation Army. They despise being together but in the end realize good friendship can overcome anything.",
            "Cute Christmas read. I enjoyed the sweet story of Noelle and Thom and the scene in the movie theater was hysterical. "],
          "_version_":1718999562835722240,
          "score":4.00142},
        {
          "id":"828922",
          "name":["Unwrapped (Sex & Candy #4)"],
          "ISBN":"0373791674",
          "rating":[3.38],
          "publishYear":[2004],
          "publishMonth":[24],
          "publishDay":[11],
          "publisher":["Harlequin Blaze"],
          "countsOfReviews":[2],
          "pagesNumber":[256],
          "description":["Mills & Boon Blaze series promises scorching hot reads...Karina Sutter is famous for her decadent chocolates. Thanks to a secret family recipe, no one can resist the candy’s sexual effects. After one bite, men and women can’t keep their hands off one another. As happy as Karina is for her very satisfied customers, just once she would like to experience the benefits. In fact, a gorgeous, mysterious man recently moved in across the street. Maybe it’s time to let loose and indulge. When Karina shows up on Alex Anderson’s doorstep with a box of truffles, she’s sure that after one bite, he’ll be hers! It may not be true love, but who said a hot, steamy night was a bad thing? But Alex isn’t as easy to convince as she thought. But Karina’s not giving up. Besides, its Christmas—isn’t sex just the perfect gift to giveand receive?"],
          "author":["Carrie Alexander"],
          "language":["English"],
          "genres":["Romance,Harlequin Blaze"],
          "reviews":["Karina owns a chocolate shop. One that's very popular as the chocolates have an aphrodisiac effect. The mysterious Alex Anderson moves across the street. Karina noticed the good looking hunk, but he doesn't seem to notice her. So she goes over to his apartment with a box of the special chocolates. Hoping to have a steamy encounter with him. They start a steamy affair. Of course the course to love, isn't an easy one. As Alex is holding a big secret, which could alter the course of the affair and his life. ",
            "Hot enough to melt chocolate!One of them might be in hiding, but the other draws them together through passion that is never ending!"],
          "_version_":1718999650670739456,
          "score":3.8739946},
        {
          "id":"765384",
          "name":["Some Kind of Wonderful"],
          "ISBN":"0312987277",
          "rating":[3.85],
          "publishYear":[2004],
          "publishMonth":[5],
          "publishDay":[1],
          "publisher":["St. Martin's Paperbacks"],
          "countsOfReviews":[40],
          "pagesNumber":[352],
          "description":["Holiday shop owner Carol Baker infuses her business and her life with peace and good will. But she has secrets from her past that make her all the more determined to someday have a family of her own. She never expects a sweltering July heat wave to bring the gift of a baby girl who needs a mother's love...and a man who needs to heal his wounded soul.Ex-LAPD copy Jack Reilly's back in town--temporarily--to fill in for the ailing local sheriff. Haunted by the tragedy that made him leave Los Angeles, Jack doesn't believe in \"forever.\" His sassy landlady Carol, with her year-round Chistmas spirit, gorgeous smile, and adorable little foster daughter, Liz, begin to bring him back to life. But the past has a way of coming back again, and the dark places of the heart have a way of staying hidden. Still, good things have a way of happening in Christmas--and if the Reillys have anything to say about it, what develops between Carol and Jack will be some kind of wonderful..."],
          "author":["Maureen Child"],
          "language":["English"],
          "genres":["Romance,Contemporary Romance,Contemporary,Fiction"],
          "_version_":1718999622886621185,
          "score":3.6073794},
        {
          "id":"900773",
          "name":["The Gift"],
          "ISBN":"0739315978",
          "rating":[3.93],
          "publishYear":[2004],
          "publishMonth":[28],
          "publishDay":[9],
          "publisher":["Random House Audio"],
          "countsOfReviews":[2],
          "pagesNumber":[0],
          "description":["On a June day, a young woman in a summer dress steps off a Chicago-bound bus into a small midwestern town. She doesn't intend to stay. She is just passing through. Yet her stopping here has a reason and it is part of a story that you will never forget.The time is the 1950s, when life was simpler, people still believed in dreams, and family was, very nearly, everything. The place is a small midwestern town with a high school and a downtown, a skating pond and a movie house. And on a tree-lined street in the heartland of America, an extraordinary set of events begins to unfold. And gradually what seems serendipitous is tinged with purpose. A happy home is shattered by a child's senseless death. A loving marriage starts to unravel. And a stranger arrives--a young woman who will touch many lives before she moves on. She and a young man will meet and fall in love. Their love, so innocent and full of hope, helps to restore a family's dreams. And all of their lives will be changed forever by the precious gift she leaves them."],
          "author":["Danielle Steel"],
          "language":["English"],
          "genres":["Romance,Fiction,Chick Lit,Adult"],
          "reviews":["Ovaj roman je moj prvi prevod... I moje prvo iskustvo s lošim nepismenim lektorom... Nažalost nikako da dođe do drugog izdanja i da se sve greške isprave... Otada nijedan moj prevod ne može da ode u štampu a da ja prethodno ne pogledam i ne odobrim lektorske intervencije... Valjda sam zbog tog prvog lošeg iskustva kasnije kopala oči lošim lektorima koje je sudbina povezala sa mnom (kod raznih izdavača) i koji su bili skloni da prevodiocima prčakaju neovlašćeno i nepotrebno po tekstu a da im s druge strane slonovi promiču... Ali posle ovog romana gospođa Stil me je godinama slatkim lebom hranila... Ona ima brojnu vernu publiku... Dešavalo se da objavimo njenu knjigu",
            "Very touching,beautifully written,with strong and lovable characters.....(paperback!)",
            "This is a heart warming, compassionate and yet inspirational book about two families that have suffered tragedies and are trying to get their lives back. Loss is part of this book and unfortunately in life everyone at some point will face loss of their loved ones. In the first part of the book you meet a perfect and happy family of Whittaker that loves each other very much. Whittaker’s are a family of four: John, Liz, Tommy and Annie. Tommy was an only child until he was ten. The parents, John and Liz, then had Annie after having miscarriages three times. Annie and Tommy got along very well and always loved to be around each other (unlike most siblings). However, on one Christmas the family is torn apart by an unexpected loss. Second part of the book switches settings featuring Maribeth, a young struggling teenager who got pregnant. She runs away from her family, and starts working in a restaurant as a waitress, where she meets Tommy. The two immediately got to know each other and become good friends. While all of this happening, John and Liz are still very upset about Annie. They barely even talk to each other or Tommy. They never have meals together, and that's why Tommy is always at the restaurant. When Tommy founds out Maribeth is pregnant, he tells his parents, and with the parents wanting a child, they are willing to adopt the baby. Seven months later, John and Liz Whittaker are the parents of a baby girl, Kate. After the birth is over, Maribeth, goes to her home. She has to go back for school and her worrying family. Danielle Steele did an excellent job when she wrote this book. It is a wonderful drama that puts warmth in your heart, and a tear in your eye. This is a very touching book that covers a very touching subject. Overall, I really enjoyed this book. It was like an emotional rollercoaster, it made me laugh and it made me cry. I would recommend this book to women of all ages; this book taught a lot about family, love and how to cope with pain and how to support each other.",
            "As I was perusing the Rockridge library in search of a romance novel for my month of trash, I felt unexpectedly out of place turning the revolving paperback romance shelves, like I had found one of the many hidden exits from well-adjusted, socially accepted sanity into the hazy fringe. This, I felt, was taboo. Which is exactly what this month was supposed to be about. But I had a mission, and that mission was to find Danielle Steel. I was a little disappointed to discover her shelved with the hardcover fiction: nice, conventional, pastel-colored novels wrapped in worn library plastic like every other normal book on the shelf. No torn clothing, no heaving chests, no pirate flags, no flesh tones. Was this really romance?It quickly became apparent that, yes, this was really romance, which I have come to define thusly: novels about very boring people destined to engage in very boring courtship culminating in very boring expressions of mutual affection liberally sprinkled with awkward, hammy sex and physicality. Let me talk about the boring some more. In the first couple pages, we meet a perfect American family who love each other very much and live in a world where nothing could possibly go wrong. Hm, how can we turn this into drama? After Steel kills off one of the kids and the family implodes over the loss of that oh-so-precious gift",
            "Danielle Steel never fails me ending up in bed, sobering myself to sleep! The words are very simple yet it can absolutely pain a reader's heart.This story is family-based; about a young love that blossomed into something really foolish. She got pregnant and was nowhere to go thus the decision of going somewhere else and start anew.There she met this guy who changed life's meaning. They were ok. In fact, very in love. The guy knew she was pregnant from a previous love and it was rather a romantic acceptance.The twist of giving up her Baby to a family who once lost a child was just soul crashing. I cried a damn brook of tears! She was too young; she can absolutely give no care.Yeah.It might be so stupid for a Mother to give up her child but what good is to raising one if life would mean hunger and death.Her baby was given to the Guy's family (the guy from her renewed life),then a promise that if she will be all stitched up and well, she'll be back for him and her Baby.It was one dissatisfying ending but it filled me soooo much in my bucket! Now where's Book 2? :)",
            "This book is about a family who has a child after 10 years. Finally having a child was the best gift for them, they named her Annie. Everyone was happy because of her, she was the joy of the family, she was only five years old when she died, a senseless death.Everything was shattered from then onwards, her parents and her brother, Tommy didn't talk to each other for months. They used to get into constant fights, everything had for them since Annie left them.In another part of the story this girl called Maribeth a sixteen year old who belongs to a strict family,becomes pregnant by a high school senior who she met for the first time. Her family, especially her dad gets really mad at her, and tells her to leave the house at once and live in a convent until the baby is out, and she could come back, but without her child. She goes to live in the convent but hates it there so she runs away and gets a job as a waitress.There she meets Tommy and they become good friends and later Tommy starts liking her and finds out that she's pregnant. He still loved her and didn't mind having the baby, but Maribeth wanted to give the baby for adoption and continue her studies. They both go meet Tommy's family and tell her about Maribeth, she feels like they are the people she should give the baby to. She gives her baby to them, and promised them that she would come back after she has completed her studies.They found Annie back from Maribeth's child, which was the greatest GIFT ever!",
            "The Gift is a message for us to look around in our life and love what we have. A family that was reaped apart after their daughter Annie died of meningitis at the age of five. Annie had give the family the meaning of love. After her lost the family spend the next year isolated from anybody grieving their lost. Until their son Tommy start a relationship with a girl which happened to be pregnant. Maribeth had got pregnant in her first time and with no luck the father rejected her and the baby. Maribeth's family was devastated, humiliated with the honor of their name. She was sent to a convent until the baby was born then she would give away. After running away, she met Tommy who become best friends. Their relationship grow each day stronger and deeper. But she was decided to give the baby away. Tommy's family was alive again with the presence of Maribeth. She decided to give away the baby to the family; she knew they would take care of the baby really well. Annie, Tommy, John, Liz, Maribeth"],
          "_version_":1718999696182083584,
          "score":3.4970527}]
    }}