{
    "responseHeader":{
      "status":0,
      "QTime":335,
      "params":{
        "q":"\"world war II\" emotive holocaust",
        "defType":"edismax",
        "indent":"true",
        "qf":"reviews genres description",
        "fl":"*, score",
        "q.op":"AND",
        "rows":"10"}},
    "response":{"numFound":1,"start":0,"maxScore":11.965375,"numFoundExact":true,"docs":[
        {
          "id":"616705",
          "name":["The Hiding Place"],
          "ISBN":"0800792475",
          "rating":[4.42],
          "publishYear":[1996],
          "publishMonth":[1],
          "publishDay":[9],
          "publisher":["Chosen Books"],
          "countsOfReviews":[36],
          "pagesNumber":[221],
          "description":["A Chosen Books commemorative edition of Corrie ten Boom's wondrous story. Love overcomes inhumanity in the concentration camp and heals lives in the war's aftermath."],
          "author":["Corrie ten Boom"],
          "language":["English"],
          "genres":["Nonfiction,Biography,History,Christian"],
          "reviews":["If you consider reading this book, be warned. When John and Elizabeth Sherrill wrote the memoir of Corrie ten Boom, they clearly had an agenda. The first half of the book was okay. That's the reason I gave it 2 and not 1 star. The second half, set during the war years and Corrie's imprisonment in Ravensbruck, was all about worshipping God and Jesus, praying, miracles and prophecies. Even for all the cruelties that happened, there was a higher divine plan. At some point, In Ravensbruck, they were thanking god for being naked (in front of SS guards) because Jesus was naked on his cross too. And they thanked god for the fleas and the lice, so the guards wouldn't enter the barracks and they could read the bible and worship god. Obviously they were ignorant of the diseases caused by the vermin. There was also a miraculous, never ending bottle of vitamins, that allegedly was smuggled into the camp by Corrie, together with her bible. The authors made saints of Corrie and her sister Betsie, instead of writing a believable memoir. And in the appendix to the book, you can put this book to work in your own life. I can only recommend this to deeply devout people. This is not a biography, it’s a hagiography. There are over 7.000 reviews of this book and I have never seen that much 5 star ratings. But only a handful of reviewers understood the ultimate purpose of the book :it's rather insulting to the millions of Jews and others who died that fervent prayer to Jesus is all that was necessary to avoid death ; made me feel the tone was rather subtly supremisthttps://www.goodreads.com/review/show...Just one of many examples of how this book turns a story about World War II into a platform for evangelical tripe.https://www.goodreads.com/review/show...The unspoken theme is that they were saved because they were Christian",
            "When I was adding every book I could remember ever reading to my Goodreads shelves, I automatically slapped three-star ratings on all the nonfiction books (unless I'd disliked them, or they were specially influential for me) without thinking much about it; I'm more apt to reserve four or five star ratings for fiction --and I'm miserly with the five star ones! But this was a case where, when I sat down to do the review, I decided to change the rating. Corrie's personal narrative of her World War II experiences genuinely are amazing",
            "Every human being should be required to read this book. I guarantee it will change forever the way you look at life. The memoir is a true account of Corrie Ten Boom's experiences in German-occupied Holland during WWII (and afterward in prisons and concentration camps). The most amazing thing to me is that she was not Jewish. She was a Dutch Christian who freely sacrificed her own life, and the lives of those she loved most, to fight against cruelty and hate. I read the book aloud to my husband, taking a break at some point in each chapter just because I couldn't read for the tears. I can understand overcoming amid tragedy, but thanking God for the fleas that are eating your flesh? Praying for the guard who beats you? Two questions kept going through my head in the journey with Corrie: Are there really people in the world who are this GOOD? and Why am I such a selfish",
            "Most people have started 2018 with parties and fireworks. I've started it by finishing a five star book!I've read The Hiding Place a few times before but not in recent years. With so many Christian friends on Goodreads, it is the book that I see most often on people's 'favourite' shelf. During this re-read I was reminded that it deserves to be there.Most of you will know the story; Corrie ten Boom and her sister Betsie are the unmarried daughters of Casper, a Christian watchmaker in Holland during the early 1900's. They could be running a successful and profitable business but, as Christians, are prone to charity and acts of kindness leaving them comfortable but not well-off. The scene is set by the author, Corrie, and a picture of a happy family life emerges. The everyday details and the author's humour are what make the book, indeed she is a marvellous story-teller and none of it is in any way monotonous.During the Nazi occupation in the late 1930's, the ten Boom family adapt their business to harbour Jewish refugees as they become involved in the underground movement of the period. Corrie, in particular, devotes her time and attention to caring for and helping these persecuted people and takes great risks in the process.Eventually, their happy family life, which had gradually been eroded by events on the horizon, is shattered as the entire family are captured and led off to Germany. Corrie and her sister Betsie end up in Ravensbruck, a notorious concentration camp. Here, Corrie faces up to her spiritual weakness as her physical body suffers:Selfishness took on a life of its own...Oh this was the great ply of Satan in that kingdom of his:To display such blatant evil that one could almost believe that one's own secret sins didn't matter....I came to Paul's account of his thorn in the flesh...the real sin lay in thinking that any power to help and transform came from me. Of course it was not my wholeness, but Christ's that made the difference.The breakthrough comes when Corrie, following the example of her never wavering sister who even praises God for the fleas, realises that all is not in vain and life has a purpose again:But as the rest of the world grew stranger, one thing became increasingly clear. And that was the reason the two of us were here. Why others should suffer we were not shown. As for us, from morning until lights out, whenever we were not in ranks for roll call, our Bible was the center of an ever-widening circle of help and hope. Like waifs clustered round a blazing fire, we gathered about it, holding out our hearts to it warmth and light. The blacker the night around us grew, the brighter and truer and more beautiful burned the word of God. 'Who shall separate us from the love of Christ? Shall tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword...Nay, in all these things we are more than conquerors through him that loved us.What an incredible picture of true faith in the face of such hardness and suffering. Anyone going through trials will benefit from this book. Likewise those seeking to be content in all circumstances and to rejoice in the Lord always.The Hiding Place is clean: there is no swearing or blasphemy, there is no sexual content, there are some graphic scenes relating to the treatment of prisoners and the suffering in the concentration camp. These are relayed factually without embellishment or sensationalism.An incredible testimony of a family completely sold out for God whatever the cost.",
            "By far one of the best and most inspirational books I've ever read. I've underlined so many parts of this book! I first read this with my first book club almost 10 years ago and read it back in October with my current book club -- still find it absolutely amazing and one I want to read and re-read. One of my favorite themes of the book is stated by the author on page 31: the experiences of our lives",
            "If you haven’t read this book recently or ever, pick it up right now and read it. I know of no other book that demonstrates this well the depths of God’s love a grace to sinners nor his provision and kindness to use us for his kingdom. Also you’re going to need some tissue.",
            "The Hiding Place is a story about how the depths of faith and spirituality can get a person through even the darkest nightmare. Corrie ten Boom and her family led the Dutch Underground during the Nazi occupation of Holland, aiding and hiding Jewish people in a secret room in their home above their watchmaker shop. Their efforts eventually cost them their freedom and in some cases, their lives. Corrie and members of her family are arrested and sent to a concentration camp. This is not exactly a new story; we have heard numerous inspirational stories of people who have suffered monstrosities beyond our imagination. What sets Corrie’s story apart from many, though most surely not all, is that her family had the capacity for allowing their faith to grow even more throughout these times of torment. They shared their love, their hidden Bible, and their love of God with all those who would listen. They looked at the smallest things as a gift. Most of all, they understood the true meaning of forgiveness and how it can set one’s soul free. Upon meeting one of her former S.S. jailers at a church service years after these events, Corrie struggled to eventually accept the hand held out to her by this man. “As I took his hand the most incredible thing happened. From my shoulder along my arm and through my hand, a current seemed to pass from me to him, while into my heart sprang a love for this stranger that almost overwhelmed me.”What I struggled with the most in this account is the idea that Corrie and her sister Betsey attributed all of their strength to God alone. They did not personally take credit for any of their courage or capabilities. Corrie later states “If I had ever needed proof that I had no boldness or cleverness of my own, I had it now. Whatever bravery or skill I had ever shown were gifts of God – sheer loans from Him of the talent needed to do a job.” I don’t believe these gifts are taken away from us. I do believe she had these gifts all along and should congratulate herself on having the knowledge and strength to use these gifts in such a powerful way. Her feelings that these gifts were later absent were possibly a result of a bit of natural fear and vulnerability due to all she endured, not because something was given and then taken away from her. Despite the fact that I found this memoir informative and the ten Booms admirable, there was a bit something lacking in the storytelling. It fell a bit flat for me and was maybe due to the span of time between when these events occurred and when this story was written. It perhaps lacked a bit of the urgency and poignancy I have come to expect. On the other hand, it still remains a very interesting book. I gave this 3.5 stars rounded to 4 stars for the heroism shown by the ten Booms and for my admiration of their undying faith and the inspiration they offered to hundreds of individuals during their time of need. ",
            "Two stars. That's the best I can do on a book that came highly recommended and that I read with relish as I had just been to Amsterdam and surrounding areas, visited the Museum of the Resistance and the old Jewish Synagogue referred to in the book. So why two stars? I just didn't believe a lot of what I read. Here's what I do believe. I think Corrie, her sister Betsy, her father and other family members were courageous, passionate, religious, pro-active and bold. They did what many in Holland did, but what many chose not to do. They put their lives on the line to help with a very unpopular cause. They risked their necks to hide jews, feed them, comfort them and resist the authority of their German invaders. In that I find them commendable. The father figure was an admirable man, a man of principle who lived truly an exemplary life and imparted his teachings to not only his family, but all who surrounded him. A man of peace, but of strong determination. A man of immensely strong faith which he passed along to his children. So far, so good. So what's my squabble? The book was written a full 25 years after the facts, and I think it shows. Corrie was in her late 70's when the book was written, and it was written by two people who weren't there. The narrative at times becomes too convenient, too sugar coated. There were no fights amongst the throngs of people living in the beje. I think the old saying that time heals everything clearly applies to this book",
            "The Hiding Place, Corrie ten BoomCornelia Arnolda Johanna Corrie ten Boom was a Dutch Christian watchmaker and later a writer who worked with her father",
            "Okay, so the many five stars all around on this here book page were warranted. It’s a heartbreaking, painful read. It’s also full of faith, strength, kindness and perseverance. I’m very glad I gave it a listen. The narrator is terrific and emotive and has the ability to draw you into the time and place instead of taking you out of it! Corrie ten Boom is a 40 something spinster at peace with her quiet life. She is a watchmaker in her father’s shop and lives with her older sister and their kind father. She never expected to become embroiled in an underground revolution but when German soldiers invade her homeland and friends and neighbors start to disappear because they are Jewish or lending Jewish families safe harbor, she can’t stand by and do nothing. As conditions become increasingly worse for the unfortunate people in her beloved town, she decides to put her life in danger in order to save those of others. Her family has a hidden room built and they take in the desperate. Eventually she is imprisoned, along with most of her family. She recounts the long, grueling days of hellish conditions in prison and in concentration camps. The sickness, the starvation and the everyday cruelties inflicted. I’m not religious but these characters are and they walk with a strong belief and unwavering (for the most part) faith and a gratitude for everything, even ants and fleas, yet I never felt preached at. Their faith makes up a big part of who they were and how they managed to make it through the inhumane conditions. If you read this account, it will leave a mark on you for certain. It’s not a book I will easily forget.",
            "This is a profound book, and one that will not leave you unmoved. I was even inspired to write a poem before I finished reading it (it does contain a few spoilers for those who don't know Corrie's story):Victory Songby Melissa M.May 16, 2010Golden glimpses of the sun,Bits of clouds between the bars.Coughing blood, matted hair,Questions, memories, leaving scars.Making friends with tiny ants,Spilling crumbs to bring them out.Crossing days off on the wall,Wondering what this is all about.Planned by God, even this?Yes, and rejoicing still,Corrie ten Boom lying there,Knowing that this is God's will.Father died--no, was releasedTo Canaan's fairer land above.Jews in hiding did escape,This the outcome of God's love.Will we sing in trials now,Fight the sin and lonely days?Will we bravely others reach,And remember God's holy ways?Lord, we ask for strength and grace,Love for others true and strong,Love for You above all else,And to sing Your victory song!",
            "This is the story of Corrie ten Boom, a self-described spinster watchmaker who lived with her father and sister and was pushing fifty when she became part of the Dutch Resistance helping to hide Jews from the Nazis. Eventually betrayed",
            "This book though. 333 😍💖",
            "This book had such an impact on me. How would I respond if I was faced with such intense trials and persecution? Every Christian should read this book, so powerful and encouraging! <3",
            "There's more work to be done...Corrie ten Boom's story is incredible",
            "What makes this particular book different from other (better) stories about the Holocaust is that it's from the perspective of a Christian woman who was interned. While it's extremely important for us not to forget that one group of people was specifically targeted (Jews) it's also important for us to realize that this horrible thing went beyond that. This horrible thing didn't just affect them/those other people (oh isn't that sad?",
            "Slow in spots but overall, a good, sad book.",
            "The Hiding Place by Corrie ten Boom was actually a very good book, much to my surprise. I expected it to be very boring, very depressing, and very preachy. At times it did drag a little - especially at the beginning - and it was sad, but it could be called preachy, and the hope won out in the end. It won out through much of the book, actually; I never felt truly depressed. I just knew God was there. Corrie and Betsie both showed their belief in this truth in the way they dealt with difficult situations.The story starts with a recount of important moments throughout Corrie’s childhood and young adulthood. It gives a history of her family’s business which is a watch repair shop. It gives a good viewpoint of where Corrie’s thought processes, opinions, and beliefs come from. Parts of it didn’t seem important at the time, but I became convinced later that it was important - because it all turned Corrie into the woman she grew into, the woman who lived through what she did.At last the book arrives at the Nazi occupation of Holland. This is when the story really starts to pick up. In their own quiet way, the ten Booms stand up to the Nazis - first by keeping their radio from being confiscated … and slowly through becoming involved in the Resistance and saving people. They become deeply involved in the Resistance. The book gives us many examples of them risking their lives to save a few people.After having helped many people escape Holland and kept many hidden in the special room behind Corrie’s bedchamber, the ten Booms are found out and raided by the Nazis. Though the people in their ‘Hiding Place’ stay safe, she and her father and sister and a few others are taken away to a prison camp where most of the remainder of the story takes place.There, Corrie’s father and sister Betsie both die - her father shortly after they arrive and her sister just days before they are released. Over many months in prison and in concentration camps, Betsie and Corrie both minister to others. They are a support and guide to the women there - hosting a Bible study and prayer meeting of sorts, encouraging and lifting up others whenever they can.I wonder if Betsie was a little white-washed in Corrie’s mind by her death, as she seems like one of those too-good-to-be-real characters - another Elsie Dinsmore, if you will. But she was definitely very noble - if a little too optimistic for her own good, methinks.Corrie was the narrator and the main character, of course, and I found myself liking her more than other characters. She had a lot of common sense and gumption.Later I found out that she was just released because of an error and the rest of the women in her group were killed shortly afterwards. Well, of course we know it wasn’t an ‘error,’ exactly. It was God!The point of this book is, of course, that God is there even when things are dark - even when it seems like there is no life, there is no hope. He is our hiding place in time of trouble.This book can teach you so much … about history, about people, and most of all, about God. It’s really an incredible work - and the fact that it’s a true story makes it even more impressive.The author was very honest about the tough things she went through and the things she saw others go through. And yes, it was horrific … but the message of seeing God in it all was incredible! I wish everyone who had to go through anything traumatic or horrific could read this book. It would do them a world of good!Since these are real life people, not characters, and since this is a real life story, not a plot, I won’t critique this book on those points. The writing style was excellent - it was plain and truthful while getting the point across without preaching.My mom got emotional about this book. I did not. Not much upsets me. But it was very emotional what with everything they had to go through and then how it all wrapped up. I can see how some people might cry when they read it.I really enjoyed this book and would definitely recommend it.Kellyn Roth, Reveries Reviews",
            "This book touched me in a way that few books do. It made me want to work to become a better person. I was definitely in awe of the unwavering and deeply held faith of this inspiring Dutch Christian family before, during and after WWII. They assisted in the Dutch underground movement helping several hundred Jews and others in peril to escape imminent arrest, persecution and execution that would have inevitably come to those they were helping all the while realizing that these activities were likely to be reported to the authorities. But even more so, I was struck by the forgiving natuure within this family even for their persecutors. It is easy to pray for the sick, the needy, the downtrodden. But to pray for those who were behind the terrors and daily tortures of their incarceration - the kinds of torture often found during times of war - takes faith in God to a level above that of even the most devout Christians. But that is the kind of faith found in this family. They even found a reason to be thankful for the fleas infesting their prison halls. And their faith in God brought about daily miracles in spite of the most horrific circumstances. Truly an inspiring read!",
            "And so I discovered that it is not on our forgiveness any more than on our goodness that the world's healing hinges",
            "It would be fair to say that the most famous story of the Holocaust is the story of Anne Frank. Yet, in many ways, we are taught the incomplete story of the Frank family and thier hiding mates. While we know in great detail about the risk that the Frank helpers took by hiding and protecting their friends, the helpers seem to get short shift. While everyone knows of Miep, not that she seemed to have wanted it, many forget that Victor Kugler (Mr. Kraler in the diary) and Johannes Kleiman (Mr. Koophuis) were imprisoned for aiding the Franks. Mr. Kleiman was released after about six weeks, and Mr. Kugler was transfered a few times, actually escaped and went into hiding. While neither was at a conceration camp, Nazi prison camps were not nice places, and Mr. Kraler was actually housed with prisioners who had been given the death sentence. The risk and scarifcie that helpers and rescusers took to help thier friends or complete strangers should be remembered regardless of the age, sex, or beauty of said helper. This is difficult because it seems that many people, regardless of the country France, the Netherlands, Germany, helped because it was the right thing to do, and do not want to be overertly singled out. The stories, however, are important and should be known. Anne Frank should be taught in such away that students know the before and after as well as the diary, that they know the truth about the denist, for instance.The Hiding Place is about another Dutch family during the Holocaust. Unlike most stores set in wartime Netherlands, regardless of being fact or fiction, it takes place in the town of Haarleem. I've been there. It was a very cold and wet day. I want to go back so I can see Corrie's house, the Beje. The fact that the story takes place outside of Amsterdam or Rotterdam (which was violently bombed by the Germans) is good because not only does it present the rescuers but another city's experience as well.The ten Boom family at the time of WW II consisted of Corrie, her two older sisters (Betsie and Nollie), her older brother Willim, her father Casper and the various child of Nollie and Wilhelm. While the reader gets an idea of what the ten Boom family was like prior to the outbreak of WW II (there is a particularlly chilling story about a worker from Germany), the book of the bulk concerns thier experience, in particular Corrie who was interviewed, during the war. Corrie and her father were clock and watch repairers, Betsie took care of thier house, Nollie and her husband were teachers, and Willim was a preacher in the Dutch Reformed Church then later he ran, with his wife Tine (a nurse) a nursing home. As a whole, the family was deeply religious.The whole family was also involed with the Dutch resistance, passing messages, obtaining food coupons, and hiding people. Corrie, Betsie, and her father seemed to have almost stumbled into it, for a lack of a better word. They did it because helping people was the right thing to do. And they paid for it. Eventually the whole family was arrested, some members were arrested twice, and Corrie and her sister Betsie were the last to be released. The second part of the book is focused on Corrie's experiences during her imprisonment, including her struggle with faith, which seems to be a selling point for this book. Actually, it is a bit refreshing because Corrie is by no means a saintly Christian and she doesn't try to make herself one. Part chroncile of war time experience, part struggle with faith, this book is worth reading.",
            "If you have not read the book, it is the true account of a Dutch woman in her 50s who sets up an underground Jewish haven during the Nazi rule over Holland. I love reading about the Holocaust, but this was the first time I could sense such a chasm between a sweet, elderly, epitome-of-Christian woman and the cruel hatred of the Nazi camps.Even before the war, the family's charity and service was inspiring. During the war, their optimism, stalwartness, and charity was amazing. Corrie would trust her instincts as being directed by God, and sure enough they were protected from harm around every corner. When they were finally discovered, her amazing sister not only was filled with nothing but sympathy for the Nazis' hatred, but looked at every evil as opportunity: the more crammed the camp became the more women they had to teach the gospel, the dirtier the conditions the less intrusion from the guards, etc. I like to think I am optimistic, but I have my breaking point and then I'm irritable. The true test of our character comes under stressful times and their willingness to search for service in the trenches of hatred was heart warming.I have often wondered if I would risk my family's life to protect another, but I have never questioned whether or not I would lie. I would have lied to the Nazis and had no moral regrets about it. Connie's sister-in-law was so dedicated to honesty she told her children they would be rewarded for their honesty. And sure enough, when they told Nazi enquirers dangerous information, they were always protected. That made me question my own commitment to honesty.The family experienced their share of sadness and loss, but even after the war, Connie opened her heart and home to those displaced by the war, including the Nazis. I am not a crier and yet as I reached the close of this book, I found my eyes watering, not out of sorrow, but out of sheer awe at the hand of God in their lives and the power of love in their hearts. That sounds so cheesy, but what an uplifting read.",
            "The Hiding Place is one of my favorite books. Corrie ten Boom was 48 years old when Hitler invaded her hometown in Holland. She had spent her life caring for the family home and working in her father’s watch shop. But at 50 years of age, she became one of the leaders in the underground resistance in Holland. For 2 ½ years, she helped many Jews go into hiding. Not only did she risk her life for this mission, but she also lived her life for it. She spent nearly a year imprisoned in the concentration camps. During that year, she ministered to the other prisoners and the Nazi officials trying to bring them peace and joy. After the war was finally over, she worked to catalyze the healing of both the victims and those who had joined the Nazis. She turned a former concentration camp into a bastion of healing. She traveled around the world teaching people how to forgive and be healed.While lecturing in Germany, she came face to face with one of the guards from the concentration camp. He thanked her for her words and the healing they brought to his soul. As he reached out his hand to shake hers, she was put to the ultimate test. Could she practice what she preached? The anger and hurt swept through her and she despised him. But after she turned it over to God, she was able to touch his hand. And as they shook hands she found that “into [her] heart sprang a love for this stranger that almost overwhelmed [her].What made Corrie become great? It was 50 years of preparation—years of study",
            "Second Reading - September 2016First Reading - August 2015In a genre that really tests our limits to endure the dehumanization and suffering of others, this text stands out as entirely different. WWII Holocaust literature is critically important to the story of Western Civilization and it is essential that we all have a few titles get through us so that we never forget what hate and godlessness can do to entire nations. While The Hiding Place has some genuinely tough passages, it is totally unique in that it is never ever hopeless. The very worst moments are lightened up the beautiful witness of Betsey who truly understands the Gospel. Like the Old Testament lamp that never ran out of oil and the Ravensbruck vitamin bottle that never ran out of medicine until new medicine was provided, this story is miraculous in it's ability to keep you filled with just enough hope and just enough awe to keep reading without feeling gutted. To be thankful for the fleas - because they provided incredible miraculous protection from something much worse - is the epitome of the message of the ten Booms and their beautiful true story. Reader who does not think that they can read one more Holocaust book, I understand. I resisted this one for years. Now I understand. I wish that I had read this at the same time that I had read In My Hands and others - it would have given me a healthier helping of hope. 75% of this book is not about the concentration camps. Most of this story is about the real people and their real lives before, during and after the war. This is a classic. A healing and hopeful classic."],
          "_version_":1718999501329399808,
          "score":11.965375}]
    }}