{
    "responseHeader":{
      "status":0,
      "QTime":7,
      "params":{
        "q":"history family",
        "defType":"edismax",
        "indent":"true",
        "qf":"genres description reviews",
        "q.op":"AND",
        "rows":"10"}},
    "response":{"numFound":31,"start":0,"numFoundExact":true,"docs":[
        {
          "id":"855040",
          "name":["Everything You Know"],
          "ISBN":"0375407243",
          "rating":[3.2],
          "publishYear":[2012],
          "publishMonth":[11],
          "publishDay":[1],
          "publisher":["Knopf"],
          "countsOfReviews":[4],
          "pagesNumber":[224],
          "description":["Willy Muller is an embittered writer of celebrity bios and an equal-opportunity misanthrope. At fifty, he has survived imprisonment for murdering his wife, years of venomous hate mail from the British public and, most recently, the suicide of his daughter Sadie. Willy needs a break, but he's not going to get it. While recuperating from a heart attack in a Mexican resort with his magnificently silly girlfriend Penny and his vodka-drenched friend Harry, Willy finds himself drawn into a troubling confrontation with the past. As he becomes engrossed in Sadie's tragic diaries, he reluctantly considers his chaotic family history and the notion that \"only when you die do you run out of chances to be good.\" With her scathing wit and brilliant ear for dialogue, Zoë Heller has created a darkly humorous story of love and loathing, sex and death, and filial relations gone horribly awry. Acidly funny and deeply affecting, Everything You Know marks the debut of a brilliant and immensely stylish young writer."],
          "author":["Zoë Heller"],
          "language":["English"],
          "genres":["Fiction",
            "Contemporary",
            "Novels",
            "Family"],
          "reviews":["The first Zoe Heller novel I read, The Believers, left me manically scouring the library for more of her work. I found Everything You Know; a novel with characters easily as cringe-worthy as the Litvinoffs who feature in The Believers. It is the story of Willy Muller whose life has a delightful awfulness about it. Written in the first person narrative, Heller treats the reader to Willy's sarcastic, witty outlook, his superbly droll thoughts and wry observations. He has a dim-witted girlfriend, one daughter just wants to fleece him, the other has recently posted him her diaries and then committed suicide. He's been commissioned to write the screenplay for his book based on a most unfortunate incident in his life and to top it off, he's just had a heart attack. Willy deals with all these trials in a manner which is comically unrelenting: he has some truly memorable experiences in Mexico to where he escapes to write the aforementioned screenplay and some equally sad and pathetic moments in London when he visits to attend the funeral of his German-born English-resenting mother. Some of Willy's observations of his fellow characters were uproarious and had me laughing out loud:“ The first person to greet us was Sissy Yerxa, looking like a lipsticked ferret in a very short skirt and an electric pink halter-neck.”“He had a long arrow mouth and almost no lips – his mouth was just an unannounced slit in the final third of his face, like a muppet's.”Belatedly, Willy is offered the thought:  “Only when you die do you run out of chances to be good. Until then, there is the possibility of turning yourself around”. And this is indeed a thought that Heller poses for the reader to consider. Even if your life situation is not as precarious as is Willy's, just when do your chances to redeem yourself run out? Ostensibly, I love Heller's warts and all portrayal of her character and that she provides no pretty window dressings in her novel. Everything You Know is indeed a tragi-comedy; a story which charmed me and made me wince in equal measures. A definite 4★. Note: my copy was Large Print.",
            "Willy Muller is a truly horrible person. His wife died from a fall that may, or may not, have resulted from him shoving her. One of his daughters won’t talk to him, and the other one, also estranged, committed suicide. One of her last acts before ending her life was to send Willy 11 years of her journals, and he responds to the posthumous package with deep callousness. “She had succumbed to the sentimentalities of leave-taking,” he says. “Christ, isn’t life hard enough without that sort of hokey melodrama?”Yet Willy’s very horribleness is part of what makes this novel so entertaining. He walks through the world in a haze of self-absorption, making mean-spirited observations about the people around him that are also quite funny.He had a long arrow-nose and almost no lips—his mouth was just an unannounced slit in the final third of his face, like a muppet’s. OrShe was flushed and fat and she wore a big, peasant style dress that looked as if it had been blown on to her by chance during a violent storm. He doesn’t even spare himself from his own cruel wit.I have grown obsessed with my withering body…My belly, oh God, my belly. I have noticed it swerving away, settling in a puddle of flesh at my side. In the mornings, I wake to find it lying next to me, gazing up at me, like an affectionate haggis. Willy’s curmudgeonly rantings might get too one-note if it weren’t for the novel’s other protagonist: his deceased daughter Sadie. As Willy reads her journals, we see someone as shiny and innocent as he is jaded. In later entries, she begins making the series of choices that will lead up to her suicide, and the tension between Sadie’s guileless optimism and the death that we know is coming gives the novel a lot of its momentum.Zoe Heller is a powerful writer with a gift for creating unsympathetic characters moving toward imperfect redemption. Everything You Know is her first novel, and while it lacks the depth of her later work--Notes on a Scandal and The Believers—it’s a highly enjoyable read. ",
            "Only when you die do you run out of chances to be good.Until then",
            "Willy Muller is a great character, the anti-hero at the diseased heart of Zoë Heller's debut novel. What makes the book so satisfying is not its originality; rather, it is the delicate and wickedly funny way that Heller makes her germophobic protagonist sympathetic even as the situation gets worse. Willy might have been gleefully played by Jack Nicholson in his prime. We cringe to watch him, but we peek through our fingers to see what he will do next. Also, we hope against hope that he might suddenly find redemption -- which he does, perhaps, in his own Willy way. Like Martin Amis, Heller's worldview is brilliantly scathing. You might not want to live there, but it's certainly worth the visit.",
            "Heller is a beautiful and very talented writer and story teller. And her ability to write such a complex main character, who’s male, is exceptional. But despite that I struggled to completely enjoy the book as it’s just so depressingly sad and the characters are not hugely likeable (that normally doesn’t bother me) but the combination of the hopelessness and darkly sad characters makes it a book that I struggled to really enjoy. In saying that I read it in 24hrs. This however does not put me off reading the one other of her books I haven’t read - The Believers - as she’s an excellent writer!",
            "Liked it.",
            "Moja prvá ozajstná recenzia, ak by bol niekto taký dobrý a chcelo by sa mu to prečítať a povedať, čo si o tom myslí, budem rada :)Everything you know - Zoe Heller Hodnotenie : 3.5/5Cover : 2.5/5Dátum čítania : 5.4. - 23.4. 2011Chudák Willy má ťažký život. Jeho neveľmi príťažlivá priateľka Penny ho neustále štve svojou hlúposťou. Po finančnej stránke to veru nie je bohviečo (ak možno takto označiť dlžobu cca. 200 000 $). Ak chce svoju situáciu zlepšiť, musí knihu o manželkinej smrti, ktorú nezapríčinil (alebo snáď áno ?), a jeho živote pred aj po nej, ktorú napísal, prepracovať do filmového scenára. To by hádam nebolo až také zlé, keby mu z vyšších miest nekázali pridať zopár “vylepšovacích” scénok, aby bol film síce menej pravdivý, ale o to zaujímavejší. Veď koho už dnes zaujíma nejaká nudná životopisná dráma bez štipky akcie?Navyše mu zo starostí neuberajú ani jeho dcéry Sophie a Sadie. Prvá žije s drogovo závislým bláznom a Willyho skontaktuje, len keď potrebuje peniaze. Tá druhá, Sadie, je už po smrti. Tesne pred ňou Willymu poslala svoje denníky. V nich rozoberá svoj osamelý život od útleho detstva bez matky, cez problémy s jej prvou veľkou (teda prvou) láskou až … až po samovraždu, ktorú spáchala.Z knihy som mala najprv dosť zmiešané pocity. Čítanie mi trvalo neskutočne dlho, ale nemyslím, že kvôli angličtine. Knihu možno rozdeliť na dve časti : Súčasnosť, kedy Willy rieši svoj milostný život, scenáre, cestuje z LA do Mexika a z Mexika do Londýna a naopak. Čiže práve tá časť, ktorá ma v čítaní toľko brzdila. Potom tu ešte máme minulosť, zápisky zo Sadiinho denníku, Willovo rozprávanie o mŕtvej manželke Oone, o tom, ako sa spoznali a o tom, ako sa niečo v ich vzťahu strašne pokašľalo. Jeho rozprávanie ma zopárkrát dosť dojalo, najmä ku koncu. Túto časť vidím ako veľký poháňač dopredu. V posledných stránkach autorka prechádza do prítomného času, samotný koniec vnímam dosť vlažne.Knihu som čítala v podstate len kvôli zdokonaleniu sa v angličtine. Môžem povedať, že sa mi celkom páčila, aj keď je to niečo úplne mimo môjho obľúbeného žánru kníh.(Pozn. - Úplne prvá kniha, ktorú som čítala a úspešne dočítala v angličtine, kto zdieľa moje nadšenie? :D)  "],
          "_version_":1718999207295057920},
        {
          "id":"616585",
          "name":["Nebraska! (Wagons West, #2)"],
          "ISBN":"0816133158",
          "rating":[3.96],
          "publishYear":[1982],
          "publishMonth":[1],
          "publishDay":[4],
          "publisher":["G K Hall & Co - Large Print Edition"],
          "countsOfReviews":[0],
          "pagesNumber":[552],
          "description":["NEBRASKA! This is a story of fearless devotion to a hard-won ideal, of betrayal from within, and of sabotage that reaches as far as Britain's and imperial Russia's shores. And, above all, it is the story of \"Whip\" Holt, the ruggedly quiet leader of this leg of the perilous migration, and of Cathy Van Ayl, who leaves her family behind in Missouri to continue on with Whip Holt's train...perhaps, to win his heart."],
          "author":["Dana Fuller Ross"],
          "language":["English"],
          "genres":["Historical Fiction",
            "Westerns",
            "Fiction",
            "Historical"],
          "reviews":["“A caravan could travel ten to twelve miles per day in good weather, but that progress was slowed to a crawl when it rained, and when the rains were heavy, it sometimes became necessary to call a complete halt.” I read these words, imagining what such a scene might look like if I were actually there…I can see the courageous wagon master, his skin of his face leathery from the exposure to the elements, he’s tired to the core and soaked to the bone after leading the caravan through a gale force rainstorm. His eyes, however, are blazing with fire, a fire that cannot be extinguished when a man does the work he is born to do. He’s a man who loves the thrill of pitting himself against the unknown. A man who has found a way to marshal the forces of nature in such a way that they have become his allies. He glories in his ability to act quickly and instinctively when dangers threaten the caravan. He’s a man who surveys the great plains with a sense of awe and wonder, knowing that the time will soon come when they will never again look as they do now. I look past the wagon master and now see the sideways glances from the men in the caravan. Their eyes are steely and focused, they’ve learned to be on alert. They’ve learned to keep their families, systems of communication and rifles, close by. Falling prey to the forces opposing their progress is not an option for these men who often travel with the women who are the loves of their lives, the children they cherish and all their worldly possessions, tucked away in the trunks and wagon holds. I then see the wise, courageous and beautiful women of the wagon train. They look a bit haughty, but it’s not out of vain pride, but rather a way of holding one’s head high in dignity when feeling unsafe in the accidental company of the roughest frontier drifters and outlaws with their leering looks and bad intentions. An air of dignity, they know, can intimidate men who might wish to take advantage of them. I could see the way these women comfort their crying children as frightening winds batter the canvas of their home on wheels. I watch as they cover their little ears against the boom of ear-splitting thunder that rolls across the plains. I see these women stand firmly by the men they love. I’m inspired as I see how they strengthen their husbands through love. I’m amazed as I see the occasions when they use cosmetics, purchased in Independence, to enhance their already beautiful faces. I see them riding, on a Sunday, rather demurely, (as many of them are superb horsewomen), parading their subtly applied makeup, snug fitting dresses of linen, (instead of buckskin), with attractive necklines. This reminds their husbands of their lithe, trim figures and the promise of uniting at the end of a hard day. They take the time to remind the men they love that while life is hard on the wagon trail, in their hearts they are still the young, vibrant women who fell in love with them years before. To me, the image I see of these women were the most impressive and amazing of all the character groups in this story. I see the children, the ones least mindful of the rigors of the perilous journey. They will cross the plains while being taught school by their mothers, horseback riding, fishing and shooting by their fathers, and the mysterious ways of the great prairie by the scouts. The fields, streams, boulders, hills, ravines, and later the majestic buttes will be the playground of these children. I imagine that they will hold these memories in their hearts, and years later, after arriving in the promised land of Oregon Territory, will be the ones to write of their memories. Theirs may become some of the greatest of the American frontier storytelling, because all readers, young and old, still hold within themselves the wonder of a child. And what greater story to tell than that of being the first to cross this majestic wilderness? The children, I believe will be the ones best equipped to tell the stories, since their parents and other relatives will be transferring their laborious efforts from making a great journey, to carving out homesteads out of rough hewn and wild land. The children will work, but, thankfully for us, will not be so overly burdened that the stories would be erased from their memories. Finally, I see the great company of the caravan, those who work alongside the wagon master in an effort tot push forward through the wilderness. I see the native guides and wily scouts, the former army men whose marksmanship and survival skills would prove life saving on many occasions on the journey. I also see the blacksmiths, wood gatherers, water carriers, the doctor and veterinarians that took care of the human and animal needs. I see the carpenters who are skilled in axel and wheel repair who play a key role in keeping the wheels of the wagons turning. The quote on the top of this review came at page eight of a 382-page story. It was a grand tale, revealing the events, happy, sad and tragic, that hundreds of courageous souls experienced while travelling into unknown territory as the three great columns of wagons moved along across Missouri and into the expansive Oregon Territory. So richly told was this story, that I couldn’t help as though I too, was one of the pioneers when I read of this important “point of no return” for our storied band of travelers:“Routines were reestablished by the third day out of Fort Madison. The men, women and older children knew what was expected of them and, for the most part, performed their tasks cheerfully. By now they realized they had entered a new phase of life; they had put the last outposts of civilization behind them, and they would see no towns, no villages and no forts hereafter.” As I read, I too felt excitement at the adventures and breathtaking scenery ahead, I also felt the apprehension, knowing that the great wagon train faced many perils and hardships ahead. Man alive, was I hooked!Previous to reading this book, I’d known something of the weather problems and attacks by warring Indian parties that presented serious obstacles and real danger to the pioneers. But I had little knowledge of the resistance that came from armed frontier drifters, and none about the presence of the British and Russians who’d attempted to sabotage the wagon trains on behalf of their respective nations. Each country had staked a claim on the rich and promising lands of Oregon Territory. I wasn’t even done the first chapter and already felt a powerful connection with this story. As I read on, scene by scene, chapter by chapter I was introduced to: A courtly and cunning British spy, a stubborn and gutsy Russian peasant girl who snubs a czar, a hardworking and wise young heiress unaware of her beauty, opportunist frontier scum, a wealthy Austrian noblemen who finds new purpose as a member of the wagon train, a lovesick blacksmith, a girl transformed from spoilt southern belle to a wise and discerning woman of substance, a wagon master who is a true leader, the awe inspiring tale of one of the greatest buffalo stampedes in history, a former slave of the south who becomes a valued contributor and great friend to many, a friendly army colonel who strikes a life saving deal with the members of the wagon train, a concerned and nervous but committed president, an ingenious solution to an infant medical emergency, a war hungry Ponca Tribe, an evil bounty hunter, greedy horse thieves, a Paiute Indian attack that is thwarted and becomes the reason for a lifelong bond between two men, an uneasy partnership between a British and a Russian spy, a spy catcher riding alone across the plains with a rifle a good horse and a crumpled letter of orders from the President of the United States of America in his pocket, a destructive river wave, a colorful and amazingly adept clergyman from the east, an amazing medical discovery and a devious personal representative of the Czar of Russia. This may seem unbelievable, but I’ve only scratched the surface of this amazing and varied story. I’m only to thrilled to realize that it is part of an expansive book series. I cannot wait for the next one! ",
            "Finished the second in the series. Really enjoyed! Can’t wait to start the next volume. Love how the characters continue from one story to the next and new chateau are added to advance the story.",
            "Book one of the Wagon's West series was a delight, one of my favorite books I've read this year. It was predictable with character archetypes more than developed plot or people, but it was executed well enough I really didn't care. Book two was not as fun, but overall not a bad reading experience either. My favorite character from the first book, Sam Brentwood, still got to show up and have some action but the new central character is Whip Holt. Similarly, Claudia is no longer at the forefront, but her younger sister Cathy is.In addition to all the surviving characters from the first book, Dana Fuller Ross (the pen name for the author) adds a few new characters. There's a set of southern aristocrats down on their luck who bring some new attitude problems to the wagon train. There's a new scout named Mack who reminded me of Gary Busey. There's a new Russian spy aiming to take down Toni. There's also an escape slave named Hosea who was kind of problematic (and that's coming from a guy who really doesn't care if my literature hasn't aged well). Hosea is kind of the magical negro you'd find in a Stephen King book. He is deadlier than any man in the wagon train",
            "Very exciting read really enjoyed this book",
            "The narration in this audiobook was fine. The story itself was a disappointing sequel. Many of the elements I winked at in the first book began to grate--treating 19th century Russia like 1970s Cold War Soviet Union (among other things, there was discussion about defecting...? Did immigrants defect in those days?)",
            "so far i am really enjoying the wagons west series.",
            "After reading Independence!",
            "Another great book! Love these wagons west books. ",
            "rereading the Wagon West series: Nebraska! introduces Eulalia Woodling and Lee Blake, two very important characters in this series. ",
            "This is book #2 in a series about the first wagon train heading to the Oregon Territory in the 1830's. Very readable, it contains interesting interesting historical references which may or may not be true, may or may not be cliché, may or may not be offensively sterotypical....While a little predictable and formulaic, the author does a good job balancing the need to retain characters from the previous book, while adding a few new ones. Not exactly shortlisted for Man Booker, but still a fun diversion....",
            "Our favorite Oregon pioneers continue to head west, despite the great challenges facing them - freezing winters, hostile Native Americans, buffalo stampedes, crazy weather, etc.. Anyone remember playing the old Oregon Trail computer game in the 80s? I feel like this is the book form. I've really enjoyed reading about their adventures and will definitely continue on with the series. There are some great new characters in this book, along with favorites from the first in the series. ",
            "Great characters! I am really enjoying rereading this series and enjoying the fictional history lesson. God, they had to work so hard. This one had a lot more killing than the previous one but I guess that is to be expected now that they are in the wilderness. It really creeped me out when ____________ was scalped alive!",
            "Just finished book 2 and it was basically more of the same from the first book... which was expected. Don't know why I have started this series (because I remember it as a child???), but it's a fun, quick, no thinking kind of book that just sets me up to read something else. Kind of like a mind purge. Will read a couple of other books and then back to Wagons West.",
            "May sound somewhat repetitive here but I got hooked on the first book and it was like an addiction.The author shows how the westward movement affected families and individuals while placing them within history itself.",
            "The pioneers continue west. I'm a little behind, this series is kind of old but I love American history and I am amazed at the bravery of folks who went out in a little wagon with a cloth roof and the hardships they endured. The stories are so-so but I like the history.",
            "An excellent adventure. Every time I travel west across the vast plains of Kansas and Eastern Colorado towards the Rockies and beyond, I imagine what life would be like as an American pioneer. This series gives great insight to those that bravely explored before us.",
            "In spite of myself I am caught up enough in this story to continue reading the series. Love the historical parts and the how people lived parts, but, the romance parts, not so much. Although I realized love and marriage happened along the way, it was just too predictable. ",
            "Although this Series suffers a bit from it's Age, I still found it an enjoyable Read, as was the first book, Independence! A vivid portrayal of the experience of the First Pioneers to settle the West, with interesting characters & entwined plots.",
            "Ross, Dana Fuller PB",
            "The books in this series give ore than history..they explain the details of people's lives in this era...fascinating",
            "Fun western. Second in the series.",
            "Interesting book. I enjoyed the details of the daily life that the pioneers faced. At times I wished for a deeper look into the thoughts of the characters. ",
            "Intrieging - keeps the reader engaged and ready to go on to the next book in the series!"],
          "_version_":1718999206748749824},
        {
          "id":"979265",
          "name":["Dia's Story Cloth"],
          "ISBN":"1880000636",
          "rating":[4.02],
          "publishYear":[1996],
          "publishMonth":[1],
          "publishDay":[4],
          "publisher":["Lee & Low Books"],
          "countsOfReviews":[13],
          "pagesNumber":[24],
          "description":["For centuries, needlework has been part of Hmong culture. But it has only been since the war in Vietnam and Laos, which displaced many Hmong, that the new, narrative form of 'story cloths' has emerged, a bridge between past and present.Dia Cha and her family experienced this displacement. Born in Laos, Dia fled with her family to Thailand as a child, spending four years in a refugee camp before arriving in the U.S. Her story is shared by many Hmong Americans.As told through the story cloth stitched by her aunt and uncle, the Hmong people's search for freedom began long ago in China. Dia's Story Cloth explores many aspects of the Hmong experience from peace and war in Asia to new beginnings in America. Through Dia's story, young children can see that the search for freedom transcends all cultures.This book includes a compendium of Hmong culture: their history, traditions, and stitchery techniques."],
          "author":["Dia Cha"],
          "language":["English"],
          "genres":["Picture Books",
            "History",
            "War",
            "Nonfiction"],
          "reviews":["Dia’s Story Cloth by Dia Cha is a children’s book about the author and her family’s journey and hardships of escaping Laos and emigrating to America. The Hmong people have a tradition of needlework, and it wasn’t until the displacement of Hmong people from war that the narrative form of story cloth emerged. The story doesn’t just include her family’s search for freedom in America, but also the history of Hmong people’s search for freedom from China long ago. Through Dia’s story, the readers can learn about Hmong culture, tradition, and stitchery techniques. The readers can also see that the search for freedom is always common no matter what culture. This book is suitable for ages 7-9 and the themes include wartime experience, immigration, refugees, and memories.",
            "Dia Cha shares her family's story cloth in this book. The story cloth tells the tell of the Hmong people and their travel from China to Laos looking for freedom to practice their beliefs and continue their culture. Dia Cha shows the entire cloth and then explains it in small snapshots. It is a beautifully told story and I love how she explains small portions of the cloth, but also shows the complexity of it as a whole. I would definitely be interested in hearing more about Dia Cha and her life in the United States and her work with Hmong refugees.I would have given this book 5 stars except the information about Hmong American dress at the end was so terribly boring. Written just like a textbook. Such a shame that part was handled so poorly. ",
            "Absolutely lovely book, with a lot of great contextual information in the back.",
            "This is the story of Dia and her family as they were forced to leave their home in Laos. She describes the war that tore her people apart, and how she and her family had escaped to avoid communist soldiers. In addition to her own experience, this book describes the life of the Hmong people and their fight for freedom over the years. We see the challenges they faced as men were sent to war, they experienced bombings that destroyed villages and the overall fear that people had. They had to embark on a dangerous journey across harsh terrains in order to be free, and how people ended up in refugee camps. Many people are not aware of the history of the Hmong people. Dia Cha provides insight into the difficult lives that Hmong people had, and how hard they fought to be free. The story is told through embroidered story cloths that show Dia and her family’s experience. These vivid and detailed story cloths are a huge part of Hmong culture, making it an important element to include in this story. ",
            "Beautiful, gentle introduction to the Hmong people and their history. The story is similar to other refugee stories, but the illustrations (all come from a Hmong story cloth) are breathtaking and add authenticity and emotion to the author's voice. Recommended!",
            "Love the way this cultural group gives permanence to their lives by embroidery.",
            "Red 1st",
            "This book is amazing, great story illustrations and so wonderful to read this book."],
          "_version_":1718999207445004288},
        {
          "id":"751979",
          "name":["Nefertiti: Unlocking the Mystery Surrounding Egypt's Most Famous and Beautiful Queen"],
          "ISBN":"0141017244",
          "rating":[3.89],
          "publishYear":[2005],
          "publishMonth":[26],
          "publishDay":[8],
          "publisher":["Penguin Books"],
          "countsOfReviews":[27],
          "pagesNumber":[256],
          "description":["For over a decade, Nefertiti, wife of the heretic king Akhenaten, was the most influential woman in the Bronze Age world: a beautiful queen blessed by the sun god, adored by her family, and worshipped by her people.Her image and her name were celebrated throughout Egypt and her future seemed golden. Suddenly Nefertiti disappeared from the royal family, vanishing so completely that it was as if she had never been. No record survives to detail her death, no monument serves to mourn her passing, and to this day her end remains an enigma—her body has never been found. Fully revising her classic biography of Egypt’s sun queen, historian Joyce Tyldesley draws on a wealth of scholarly and archeological evidence to investigate the truth behind the life, times, and mysterious disappearance of the legendary Nefertiti."],
          "author":["Joyce A. Tyldesley"],
          "language":["English"],
          "genres":["History",
            "Nonfiction",
            "Biography",
            "Egypt"],
          "reviews":["The bust of Nefertiti that is housed in Berlin’s museum is one of the most famous icons in popular culture. Because of her beauty, she has become the symbol of Ancient Egypt. Her face is on key-rings, iphone cases, post-cards, t-shirts, etc. Aside from her image, who was the mysterious Nefertiti? How much power and influence did she actually have? What were her accomplishments besides being merely beautiful? Joyce Tyldesley’s biography seeks to answer these questions. There are few known details about the life of Nefertiti. This is not only because of the long gap of time between our world today and Nefertiti’s world, but because she is mostly in the background in Ancient Egypt. Nefertiti does not only stand behind the pharaoh, but she is glimpsed over by her formidable mother-in-law, Queen Tiy, who has much more power and influence as the Akhenaten's mother. However, Nefertiti gained some influence as the pharaoh's wife, she took on duties of priesthood, that was usually assigned to the pharaoh. She was also known as a dutiful and faithful wife. Overall, the novel gives us a tiny glimpse into the life of Nefertiti. Because not much is known about her, the author mostly focuses on Akhenaten and his reign. This novel is more of an archeological work and how Nefertiti has been interpreted. Tyldesley mentions the popular theories about Nefertiti and then debunks them as she goes along. I felt that she gave us thorough and comprehensive answers and did her best with the evidence she had. The conclusions about her birth and disappearance made sense. However, after reading this book, I found myself more interested in Queen Tiy than I was in Nefertiti. I felt that this biography knew more about Queen Tiy than it did of Nefertiti because of her prominence at court. I found it fascinating how Tiy, a commoner, had risen to become one of the most powerful women at court. While the writing is dry as a textbook, it is very comprehensible to the reader. The book has a lot of interesting pictures of Nefertiti. I also like how she incorporates how Nefertiti has been perceived in popular culture. This novel is a great introduction for those who want to learn about the Armana period of Ancient Egypt.",
            "Writing about icons is a difficult business. Even biographers of modern stars like Marilyn Monroe or Elvis Presley must wade through a morass of secrets, theories and fantasies. How much more difficult to choose a subject who lived 3,500 years ago, who emerged from nowhere, disappeared back into obscurity, and whose brief, glittering existence has been the subject of fierce iconoclasm! Thanks to the glorious portrait bust in Berlin (see below), Nefertiti is one of the most recognisable figures from Ancient Egypt, but the facts of her life remain tantalisingly elusive. As Joyce Tyldesley teases out the meaning of symbols, inscriptions and sculpted reliefs, Nefertiti’s lost world blossoms into life, in an archaeological story that reads like a detective novel. This is a tale of religious revolution, intrigue, iconoclasm, romance, and mysterious, powerful women. What’s not to like?For the full review, please see my blog:https://theidlewoman.net/2019/01/05/n...",
            "Skillfully researched, wonderfully illustrated/photographed and utterly captivating biography on one of Ancient Egypt’s most intriguing and fascinating leading ladies. One of the most meticulous scholarly examinations on the life of a queen, wife, mother and warrior who changed the future of her nation. Tyldesley is one of my favorite Egyptologists and I found her interpretations of the many pieces of evidence from Ahketaten (Amarna) to be introspective, credible and thought-provoking.It convinces me that Nefertiti was highly influential on Akhenaten's initial decisions (Moving to the area where Akhetaten was built) and played a collaborative and strong role for Akhenaten while at Akhetaten. She certainly had to have been one of the few people in her husband’s court whom he could trust absolutely. Nefertiti's influence and stature grew immeasurably with the birth of her Daughters, as well as her omnipotent status (a powerful allure that she has not lost",
            "Thoughtful and well researched, but we just don't know much of anything about Nefertiti, so the book ends up speculating a lot about Herself and talking a lot more about the previous ruler, Nefertiti's husband, and then her husband's successor.",
            "Blah. I love Egypt, and I love history. But this book nearly bored me to death.",
            "This has been a very interesting read and yet again Joyce has been unbiased in her evidence given, she has placed in the theories from both past and the then present at the time of publishing. I, however, would like to see an updated version of this as new things have come to light such the DNA and modern scanning of the mummies. While I did enjoy the book and I will say this is not my first time reading it, I would point out to a first time reader that it is not just about Nefertiti of her own accord. In fact, I would say there is more about her husband Amenhotep IV or Akhenaten than Nefertiti, I suppose to be fair that may because what we know of Nefertiti is through him which leads me to Seti I and Rameses II.I think one thing that is showing to be clear in not just Joyce Tyldesley's books is that Seti I and Rameses II were the main culprits in systematically destroying what they could what they did not agree with from the 18th dynasty. Hatshepsut, Amenhotep IV, Nefertiti, Tutankhamun and Ay were erased in form or another and Joyce is great in the fact she lays blame to the locals looking to make a quick buck.It would seem that Akhenaten is seen by many as the father of monotheism but Joyce I think rightly points that he couldn't totally be as Nefertiti and his children were part of his vision of the divine ennead and given the evidence to support this from Akhenaten himself it would be hard to dispute. Again I love to see an updated version of this book and I hope that the publisher or Joyce see fit to do so, the views given are just how I see them from what I have read and you should the book for yourself to draw you own conclusions.",
            "It really is ironic how we can write a complete book on a historical figure about whom we truly know almost nothing. Don’t get me wrong, Tyldesley writes in a way that is well-informed, engaging, and seeks to paint a picture. However, in order to discuss ancient figures surrounded by mystery, it is necessary to discuss much that comes before and after the person of interest, in order to even gain an outline of the picture. So, if you are looking for a book on the life of Nefertiti, you will get a lot more information than you are seeking.If you are looking for likely possibilities of life over a three generation span of the 18th dynasty, this is a great place to start. I respected that Tyldesley honestly acknowledges areas where the information is in doubt, as well as drawing conclusions about the most likely option. Given the nature of the portrayal of Egyptian reigns, as well as the knowledge we have lost over millennia, that seems the fairest approach to studies like this.It seems like Nefertiti landed herself in a pretty good position, with a fairly positive home and public life. The pictures of the Stella and sculptures referenced in the writing were beautiful—as was the queen.",
            "You know you love the subject,person or area if you read absolutely everything you can get your hands on and see if there is any new snippet of information you can get your hands on and this book did not disappoint in the slightest and I am still sad that they still have not found her mummy and I think that it may be behind the walls of Pharaoh Tutankhamun's crypt and here is hoping that we find her soon."],
          "_version_":1718999207067516928},
        {
          "id":"837010",
          "name":["The Prince of Mathematics: Carl Friedrich Gauss"],
          "ISBN":"1568812612",
          "rating":[3.74],
          "publishYear":[2006],
          "publishMonth":[1],
          "publishDay":[1],
          "publisher":["A K PETERS"],
          "countsOfReviews":[5],
          "pagesNumber":[237],
          "description":["Learn about the boy who - could read and add numbers when he was three years old, - thwarted his teacher by finding a quick and easy way to sum the numbers 1-100, - attracted the attention of a Duke with his genius, and became the man who... - predicted the reappearance of a lost planet, - discovered basic properties of magnetic forces, - invented a surveying tool used by professionals until the invention of lasers. Based on extensive research of original and secondary sources, this historical narrative will inspire young readers and even curious adults with its touching story of personal achievement."],
          "author":["M.B.W. Tent"],
          "language":["English"],
          "genres":["Biography",
            "Science",
            "Mathematics",
            "History"],
          "reviews":["What I wanted from this book was more information about Gauss's discoveries, but it barely scraped the surface. Instead it's mostly filler material: fake conversations, useless trivia etc.The characters keep saying I wonder if -this- and -that- will happen in the future",
            "This is a brief description about the life of one of the greatest mathematicians that ever walked on Earth: Carl Friedrich Gauss... The author begins describing Gauss's family from an early stage; when he was still in elementary school. He describes how his family treated his talent in Maths, how Carl advanced in his education, his love interests, his life with his children and at last, his death... This is a must-read for everyone, because this book tells the story of one of the greatest men ever alive...",
            "In reading some of the other books on mathematics I've been reading of late, Carl Frederich Gauss' name came up often and I was eager to learn more about him. Sadly, very few books exist on him (biographies that is).The book was interesting those it is somewhat fictional especially with the fake dialogues that occur between Gauss and other people in his life. Also, many of those dialogues were somewhat silly.Aside from this gripe the book was engaging and a quick read. It's amazing to learn how many discoveries Gauss had in the fields of mathematics",
            "The actual retelling of Fred from Life of Fred! I loved it and so did the kids. His life was absolutely inspirational. He was so blessed to have had the opportunity to live out his life passion and effect such beautiful changes in our world. I also loved that he told his mother early in his life what he wanted and then he got it. A fabulous Law of Attraction story. I was in tears several times through the story.",
            "Absolutely magnificent and highly digestible read, with accurate and extensive information on Gauss' life, skills, and work. It flows like a common book, but is something more than just a story. I enjoyed it to the greatest extent. Highly recommended to people interested in Maths and History. My only concern",
            "The book is clearly meant for younger readers, which the blurb unfortunately neglects to mention. The fake dialog felt really ridiculous at first, but it grew on me, somehow. The author also made up for it with quotations that must have been drawn from actual correspondence. I look forward to learning more about Gauss! (Measuring the World/Die Vermessung der Welt"],
          "_version_":1718999207107362816},
        {
          "id":"740572",
          "name":["The Angel with One Hundred Wings: A Tale from the Arabian Nights"],
          "ISBN":"0312325991",
          "rating":[3.44],
          "publishYear":[2004],
          "publishMonth":[2],
          "publishDay":[1],
          "publisher":["St. Martin's Griffin"],
          "countsOfReviews":[24],
          "pagesNumber":[272],
          "description":["The story opens in the City of Peace, as Baghdad was once called. It is a fabulously wealthy city, receiving tribute from an empire that stretches from modern day Afghanistan to Spain. Abulhassan Ibn Thaher is an old pharmacist and alchemist who is an intimate friend of the Sultan. When the young prince of Persia falls in love with Schemselnihar, the Sultan's beloved mistress, they beg Abulhassan to help them elope. Even though it could mean death for all of them, Abulhassan relents and agrees to help. As rumor and gossip spread, different factions at court try to use the impending scandal for their own ends, and the story climaxes with the lovers' flight into the desert. With engaging characters and rich imagery drawn from alchemy, the Koran, and the early Islamic mystics, The Angel with A Hundred Wings is a literary masterpiece that captures all the magic and romance of the Middle East once upon a time."],
          "author":["Daniel Horch"],
          "language":["English"],
          "genres":["Fiction",
            "Historical Fiction",
            "Fantasy",
            "Historical"],
          "reviews":["Abulhassan, an elderly pharmacist and favorite of the sultan, assists the Prince of Persia and the sultan's favorite mistress Shemselnehar to escape to Spain.Set in 800 AD in the City of Peace (today's Baghdad!) in the reign of sultan Harun, known for his appreciation and patronage for architecture, art, textiles, science and literature, this novel is rich in imagery. The bazaars, streets and palaces of Baghdad, then one of the largest cities, are exotic and mesmerizing and finely drawn. Horch has done his research and presents a compelling picture of customs, religion, superstition, clothing, and peoples.I did struggle, however, with the characters and their motivations, namely Abulhassan, the protagonist; thus my lower rating. The sultan was his oldest friend; he was trusted implicitly by the sultan, who in his way displayed his love for Shemselnehar. We're meant to understand that his newest friend, the Prince of Persia, was like a son to him and thus his motivation for aiding the betrayal of the sultan, but it wasn't convincing. Are we meant to believe that he was living vicariously through his young friend and finding true, romantic love, something he hadn't had w/ his wife of 50+ years? That he was making up time, that he was throwing his traditional caution to the wind and having one last blowout? This didn't ring true; he wasn't sympathetic and his honesty via omission grated.",
            "This book is what happens when I wander into a bookstore with eleven dollars in my pocket and this strange desire to buy something. It is the story of an aging pharmacist in an arabic country, set in the distant past, and how he fell back in love with the concept of love while double-crossing an old friend to help to lovers elope. Convoluted? A little. It's also a bit slow at times. But it's an elegant little story with a bit to say on love in the later stages of life/marriage. ",
            "When you find yourself on a bridge halfway between hell and the place where your judgment awaits? I'll try and explain exactly what I mean; this story is narrated from Abdulhassan's view, he's an old pharmacist, the best friend of the Sultan with whom they play chess and discuss life. The Sultan trusts only him and as a man with the power to take life and pardon people, he's most gracious towards his friend.Now, the Prince of Persia, while at Abdulhassan's shop meets the Sultan's mistress and it's love for the two young people and now Abdulhassan finds himself caught between betraying the trust of his friend and letting the two young people elope and start a life outside the country. Whatever decision he takes he can surely pay with his life and that of his family and the story is more in line with him trying to make peace with himself while deciding what to do.It's beautifully narrated and you cannot help but love how the author spins the webs of palace intrigue, servants gossip and a rich culture.",
            "Interesting to hear the context of the city in the background.",
            "There are never enough books on my shelf or at least Goodreads profile that are taken from the 1,001 Nights/Arabian Nights/I don't actually know the proper accepted title. To be fair, I've only read a couple of the legit ones myself, and that was years and years ago. Still. I'm about up to here with Greek retellings. I was in the mood for some good old-fashioned Arabian Nights fun. This both satisfied the craving and made me want more.I hesitate to commend the realism/detail of the book because, as far as I know, Horch is neither native to the regions he's writing about nor does he have an impressive PhD or anything in the subject. But a guy can do research, and I hope his (apparently abundant) research is all legit, because I haven't felt so immersed in a historical fiction novel in a couple Middle Earth ages. The alchemy, the stories-within-stories, the religion, the social customs. It all felt so /real/, both similar to some stereotypes but also smashing some stereotypes to bits. Complicated, real, messy, but also heavenly in a way.Shemselnehar is a wonderful character, and I wish the prince had her level of characterization, because they would really have been precious if I had known the prince better. But he's not even present for a lot of the book, so it's hard to get a read on him as the story progresses. I love, however, Abulhassan's entire family. Fatima is wonderful. It's true that the women in this story are all wives or mothers or both, but that doesn't restrict how great they were. In a relatively short novel, it's hard to get in-depth character development, but it didn't matter, because they felt /real/ anyway, real and complex and human. Along those lines, the sultan! This book managed to make the crusty, lusty old sultan a mildly sympathetic character, while retaining his... well, his patriarchal grossness. I don't know. His story made me sad, because it's obvious that he could have been better; could have deserved better. But people are what they are and sometimes things and people just can't be fixed.All in all a great story - a bit rushed, perhaps, but that's part of its 1,001 Nights charm, I think - it has the fairytale aura. A book I want on my real physical shelves, and a book which will hopefully lead me to other such stories (especially ones written by actual real-life Muslims and people from the Middle East). ",
            "Set in Baghdad many centuries ago, this was mostly a sweet story about a respected pharmacist trying to help a young couple who are in love be happy together forever after. Unfortunately, one of the couple is already the sultan's favorite concubine, and the sultan is the pharmacist's friend and a good man. The pharmacist does his best to be true to all, including his own wife and family, and there's a happy ending for many characters, but as happens in any love triangle - someone will be left alone. It was one of the better fiction books I've read in the past year, although there were occasional points of confusion (did Jafar sleep with the queen?) and I was hoping they'd all somehow find a happy ending.",
            "This gorgeous tapestry of a story, set in the fabled and magical City of Peace of a 9th century that never was, is about love, and alchemy, and death, and faith. The atmospheric detail is rich and striking, from the wonders of the sultan's palace gardens to the incense and rosewater with which the men perfume their beards. Abulhassan the pharmacist, in many ways a secondary character to his own story, is wonderfully sympathetic and real. His inner struggle between the loyalty he owes to his oldest friend, who is also his lord, and the love for his newest, whom he regards as a son, is profound. This was a beautiful book-- it was like having a novel-length Arabian Nights tale.",
            "Rich and vivid descriptions. Easily you can picture the setting and feel it through your senses. Yet at times I found myself getting bored with the old man's dreams. I also felt frustrated that the mistress waited so long, it seemed to stupid to me. Her reluctance and disregard was so immature. I felt glad that everything worked out so happily"],
          "_version_":1718999207521550336},
        {
          "id":"976024",
          "name":["Abe Lincoln Goes to Washington 1837 - 1865"],
          "ISBN":"0792269063",
          "rating":[4.13],
          "publishYear":[2008],
          "publishMonth":[14],
          "publishDay":[10],
          "publisher":["National Geographic Children's Books"],
          "countsOfReviews":[1],
          "pagesNumber":[48],
          "description":["Now with an updated paperback cover, Abe Lincoln Goes to Washington paints a vivid picture of the Springfield, IL years, when Abe met and married a pretty Kentucky woman, and made his name as a lawyer and politician. Cheryl Harness gives readers a moving account of Lincoln’s rise and the tensions that dragged the nation into conflict; brilliantly detailed maps and battle scenes deepen our understanding of the Civil War; and the book’s richly imagined illustrations recreate the life of the man who will always be regarded as one of our greatest presidents."],
          "author":["Cheryl Harness"],
          "language":["English"],
          "genres":["History",
            "Biography",
            "Picture Books",
            "Childrens"],
          "reviews":["It drove me crazy that the author called him Abe throughout the book. He hated the name Abe and refused to go by it. It also feels too casual to call a president a nickname throughout a book with occasional formal names and titles. Additionally, I felt the author was often negative in some of the story telling. I doubt that General Grant was puffing cigars the entire war. Mentioning that some saw his Gettysburg Address as a “wet blanket” was unnecessary nor helpful in explaining the importance and significance of his speech. Those are just a few examples. I wasn’t impressed.",
            "As a huge Lincoln fan - I like this book. Not the best picture book about him but I really enjoyed the art work. The writing was at times a bit off-putting but the facts were there. The author refers to Lees army as “gallant” - but gives no praise for the Federal Troops. ",
            "Grade/interest level: Middle School (6-8)Reading level: Lexile, 790LGenre: Picture Book, Biography, Informational Book Main Characters: Abraham Lincoln Setting: Various settings that correlate with Lincoln's storyPOV: Third personThis book is an informational text about Abraham Lincoln. It covers the years 1837-1865. The book features beautiful, detailed illustrations that support the dense written text. The book is written in story format, but includes dates and specific historical facts. The first page begins with encouraging the reader to think back to the president and imagine his life. As the book goes on, it is organized by time period. It begins with Lincoln’s arrival to Springfield, Illinois where he was a practicing lawyer who helped the people. The story also talks about Abraham Lincoln’s marriage and family life. The book also discusses the issue of slavery and its effect on the country. On these pages, an illustrious map is included showing all of the different trails and train lines, as well as using a color key to show which states had slavery. The book also talks about Lincoln’s run for Senate, and his loss to the other candidate, an event that is not frequently covered in history class. After this, the majority of the book is about Lincoln’s presidency. The book also does a thorough job of covering the Civil War and important battles during this war. In addition, Lincoln’s life during his presidency is also depicted with detail. The book even includes the full Gettysburg Address. The book ends with Lincoln’s assassination.As someone who has always been interested in Abraham Lincoln, I would definitely use this book in my curriculum. For individual or guided reading, it would need to be used with middle school grades, 5th grade being the youngest. However, I would use it as a supplemental read aloud for younger grades. The pictures are beautiful, intricate and engaging, and the text is written in a way to make history sound like an interesting story for students. I think this is a great resource and a great way to get different students interested in history. This would fit well in a unit on presidents or the Civil War. ",
            "An excellent resource on the adult life of Lincoln, focusing on the events leading up to and during his presidency. Author touches on family, business and political life. The narrative captures not only the mood of the president during the Civil War, but also the mood of the country. Bright and colorful illustrations including maps, battle scenes, big moments in Lincoln's life, his family and contemporaries. There is great attention to detail in all illustrations. Maps are filled with information including place names, borders, major event details, etc. Captions include additional information about the illustrations, such as names and dates of battles, names and titles of people and additional details of events. Includes full text of the Gettysburg address. Additional resources: Bibliography, National Geographic url, address and contact information for Lincoln's homesite in Springfield, Illinois.",
            "Abraham Lincoln was an incredibly influential and inspiring man that changed our country forever. This National Geographic book depicts the adult life of Lincoln in great detail; and even draws in some of the youngest readers. This book is jam-packed with information not only on this man, but also on the Civil War. I could have spent hours looking at the in-depth illustrations as they include extra information about the various events and people that pop in this book. I also enjoyed that Harness included the down-sides of Lincoln's life such as losing elections and the loss of many close family members. This great book informs young readers as well as older readers of this incredible man that brought about some of the biggest changes to our nation. ",
            "Abe Lincoln goes to Washington would fit well in any Civil War unit quite nicely. It has some good information on the role of children in Abe Lincoln's life that would provide children in a primary or middle grades classroom greater access and interest into larger events - which is always good thing. Overall it follows the basic canon of Abe Lincoln's life, but for a class that does not have this information the book could be very helpful. ",
            "The illustrations are awesome. The book was well-written history, however the book did seem to be overwhelming with the information and illustrations. The book would definitely tie in nicely with history in the middle grades.",
            "Abe has finally been elected president and then a war begins. Reasons I like this book-Reason 1- The book was a very short easy read.Reason 2- I learned about when Abe Lincoln was at the White House.Reason 3- The book has good illustrations. "],
          "_version_":1718999207505821696},
        {
          "id":"772774",
          "name":["Fortunate Son: George W. Bush and the Making of an American President"],
          "ISBN":"1887128506",
          "rating":[3.79],
          "publishYear":[2000],
          "publishMonth":[29],
          "publishDay":[2],
          "publisher":["Soft Skull Press"],
          "countsOfReviews":[0],
          "pagesNumber":[375],
          "description":["Offers a portrait of the two-time governor of Texas, George W. Bush, and argues against his fitness to serve as president."],
          "author":["J.H. Hatfield"],
          "language":["English"],
          "genres":["Politics",
            "Nonfiction",
            "Biography",
            "History"],
          "reviews":["Well done biography of W. Ironically, its not frothing at the mouth- not at all- and the Bush people ran him into the ground for what he wrote. I mean, all the way to the Ground.Watch Horns And Halos",
            "Reading this book makes me all weepy-eyed and nostalgic: remember when we hated him because he was an incompetant cokehead instead of a Constitution-shredding, child-murdering maniac?",
            "Notable more for what happened to the author and the book at the time of publication than for anything actually contained within the book. For those that don't like Bush there is plenty of red meat, there is also a huge credibility gap with the author. I will say that it can't be worse than most of the political hatchet jobs that have come out since. I worked in the industry at the time of publication and the Bush family used their connections to get it pulled from the shelves and destroyed, it was later reissued by soft skull press. Check out the doc Horns and Halos for the whole sordid affair. ",
            "If America could have collectively read this book, we wouldn't be in the situation we are today. It is a complete documentation of George W. Bush's life BEFORE he ran for president - completely documented. The Bushies never disputed one fact in the book. Instead, they threatened large publishers who had any significant sort of distribution so that the book would not receive public attention. There is a good documentary the covers the trials the author went through to get the book published and distributed. It is too late obviously to undo the damage Boy George has done. But the book is worth reading because it shows 1) the information was out there before the election 2) it showed without exaggeration, distortion or lie that W is/was an utter incompetent. 3) information can be suppressed in a free society in creative ways 4) it could very well happen again (though it is unlikely just statistically speaking that we could elect a president as bad as W even if we tried). Finally",
            "Honestly, I thought this book would be better. It wasn't the writing that I didn't like, but with all the hype that surrounded this book, I thought it would include some really ground-breaking stuff. It doesn't really. A little bit of this history: The original publisher decided not to sell the book after they had printed a number of copies. They went to the extreme step of destroying the books that they had printed already. Then the author was found dead and was presumed to have committed suicide. Then another publisher decided to publish the book.",
            "Insightful as to why W. is such a failure. He has skated his way to the top and never had to earn anything. In his earlier years, oil companies gave him positions of power solely because of his name. Every oil company that he lead, he drove into the ground only to be bailed out by daddies friends latter. This book explains George W. Bushs' debts to industry and carefully itemizes them. The author was careful to check his facts.",
            "Wes let me borrow this book. It had so much detail. I did find it exhausting to read. The author had so much information to work with and provided tons of footnotes and information on the side.Overall, I learned a lot but the writing didn't flow as well as it could have.Given the circumstances of the author's death, I would suggest only minimally editing the book for an easier read. But preserve the writing as the author left it. ",
            "Controversial look at George W. Bush's younger days and the allegatins of legal troubles covered up by his father. The author, Hatfield, commited suicide prior to the books publishing.",
            "This is an good expose of the entire Bush family, that clarifies many of the more corrupt and telling corners of its long history"],
          "_version_":1718999207069614080},
        {
          "id":"969599",
          "name":["The Ideal Wife (Stapleton-Downes, #1)"],
          "ISBN":"0451170431",
          "rating":[3.62],
          "publishYear":[1991],
          "publishMonth":[3],
          "publishDay":[10],
          "publisher":["Signet"],
          "countsOfReviews":[136],
          "pagesNumber":[224],
          "description":["When Abigail Gardiner knocks at the door of Miles Ripley, Earl of Severn, the last thing she expects is a marriage proposal. Desperate, she had come to this charismatic stranger’s home to plead for her future. Instead, she shocks them both by saying yes. Her impulsive decision will have consequences neither she nor her new husband can foresee. For Miles has his own reasons for marrying her. And Abigail is harboring a secret of her own. As distrust gives way to desire . . . as, together, they give in to the pleasures of the marriage bed, a devastating scandal threatens their future. Now these two wary hearts will risk ruin and disgrace for a love that has changed them both forever—the kind all seek, but few ever find."],
          "author":["Mary Balogh"],
          "language":["English"],
          "genres":["Romance",
            "Historical Romance",
            "Historical",
            "Regency"],
          "reviews":["Bleh. Mary Balogh had this format she used for a time in her earlier books where the heroine was keeping a secret from the hero and this is the driving point for most of the plot. I can tolerate it once in a while but after more than two books it gets annoying. For example I can deal with it in her book Heartless because I loved the hero in that one. This book features this plot device and it is ANNOYING. It starts off with a meet cute premise…the hero",
            "Don't let the 3 stars fool you. This was not a bad read. It's just that in 2019, I'm planning to be a little more discerning in my ratings. I've been known as a high grader before :)This was a fluffy piece. Light and fun in places. No real substance, and based on a very unbelievable premise (tho one that HRs tend to use): the H marries a complete stranger, an impoverished distant cousin, in 2 days by special license. It is the reason that he marries her that's weird. He just did it to avoid being badgered into a different marriage with a jewel of the ton by his female relatives. This is not the first time MB has used this plot device. In The Arrangement she did the same thing. The H runs away and marries a stranger because he doesn't have the balls to stand up to the female relatives he loves.I wonder if this actually happened back in the time period these novels are set. That would be very strange indeed.Anyway, this is the premise, and after doing this crazy thing, the H then plays the part of a level-headed, indulgent, mature husband, while the h is herself - bubbly, natters on, big-hearted, and honestly not very smart. The explanation is that she thinks with her heart instead of her brain. Which is another way of saying she doesn't do much thinking.I give it 3 stars because the writing reminds me of Jane Austen novels - in terms of the banter and lightness. There are parts that are believable - like how the couple don't both achieve orgasm in lovemaking until they are actually in love. Overall, it's something to read while I'm snacking on things and want to multi-task. This is not the sort of novel that commands my entire attention. I can put it down at any time.",
            "This was a light and fun romantic comedy tale with just enough heart to it to keep it an engaging tale. It had plenty of humour but also stood out from the crowd due to the fact that the characters were not your usual HR standard fare. I liked the change. In some ways the tone and feel of this reminded me of Amanda Quick's HR books. Which is a good thing in my eyes. The plot was crazy but fun. Miles Ripley, Earl of Severn, is despairing the fact that his meddling mother and sisters are due in London within a week and are bringing with them the girl they are determined to see him married to. Miles loves his family but has no desire to settle down with a wife. He even claims to his friend that the ideal wife for him would be meek, quiet, plain, and easily forgotten about. His friend laughs off Miles crazy claim but the offhand remark sticks in Miles mind and the very next day, when just such a woman pops up at his door claiming she needs his help, it prompts him to offer her marriage as a solution to both their problems. It all goes wrong for the hapless Miles as it quickly becomes apparent that his ideal wife Abigail Gardiner is not at all the quiet",
            "It's hard to be overly critical with a category romance. After all, given the word limitations and page restrictions, it's not fair to expect the same depth, intrigue, and character development as a full story. Yet surprisingly, quite a few authors actually do it, and do it well. Which is why the genre is so well loved. Mary Balogh built a career on it and became one of the most respected leaders in category romances. But, for some reason this book didn't quite deliver the punch I've come to expect from her. The premise was interesting. The story flowed smoothly. The characters were not cardboard cut out figures, and there was enough intrigue to keep me turning the pages. But, the story missed the mark. My biggest issue was the heroine. Abigail, annoyed me. Most of her bumbling ways and thoughtless attitudes would be considered appalling even by today's standards. The thought that the ton adored her and found her amusing",
            "This is so terrible that I am considering not finishing it even though I have endured 80% of the story. It follows a destitute governess Abigail and an earl, Miles. Their big character flaw? They don't make sense. Abigail is a nearly destitute woman but once she has money, she has no problem spending it and not making any savings. Miles, he is marriage shy. So what does he do? He marries. This was such a frustrating read because Abigail is so over the top annoying. I don't like her because she is loud. I don't like her because she is dumb and she has no scruples spending someone else's money. She accrued a 7500 pounds of debt within a week and it was so galling to read someone like that. She lies compulsively and doesn't even have a respect for her husband to tell him the truth, the source of money. She doesn't think about the damages she makes. In the end, it is all about her. I don't like her, not because she is demanding, I don't like her because she is demanding and dumb, a scary combination. She demands outrageous schemes with no heed to her actions. Her character flaw wasn't really that she was demanding and independent. She just talks a lot about nothing and that is supposedly charming. The only way she could get away with it is a convenient fast love. Of course, that is engineered by the author. Miles falls in love with her when they get married. I don't know why. The fantastic conversations happen off screen because I don't know what she could possibly say to delight him. The conversations in writing are mediocre at best, nothing to flutter your heart. It was just terrible. They have known each other for a week and Miles just smiles at her supposed quirky nature. I guess what I dislike the most is that for a character who supposedly supported her family through hard times, she was remarkably dumb. I saw no evidence of her hustling. It is either she is delusional or she transformed into another person. I could deal with the love fest in the beginning but the bait and switch characters the author did was too much. I dislike both of them immensely because they were poorly written. Miles looks at her way too fondly for a man who is married to a stranger. She is too free with someone's finances. I felt for Miles' friend, who clearly saw she was no good, but has to hold his tongue because he loves her. I suppose the biggest flaw in this book is Abigail. She was supposed to be charming. I was supposed to fall in love with her. I was supposed to see her mismatched pairings and really dumb schemes to be cute. No. Whatever she is serving Miles, I'm not getting. I'm not in love with her and she can't get away with her schemes. This book is terrible. ",
            "Abigail needs a letter of recommendation, and applies to her distant, distant, basically-on-another-continent-distant cousin, Miles. Who happens to be a hot Earl. So, he asks her to marry him because REASONS. (Mainly that she's plain and demure and WHY THE HELL NOT RIGHT.) Except feelings get in the way!!! OH NO. 1. MOC BOOKS WHY DO I LOVE YOU SO MUCH. This wasn't even that good because basically 10 minutes after saying I do",
            "There’s nothing like starting a book and discovering, halfway into the first chapter, that it has all of your favorite tropes. Every time I think to myself “Hmm, maybe Mary Balogh isn’t my favorite historical romance author…?” I get hit with an absolutely delightful novel that gives me the happiest of Happy Feels. I should’ve learned better by now.All this to say: The Ideal Wife is splendid and amazing and astoundingly honest. I enjoyed it tremendously, and it might have to be my favorite Balogh novel (of the 13 I’ve read so far).The book opens with Miles, the Earl of Severn, complaining about all the women in his life running the show and bossing him around. He’s had quite enough of that, thank you! He tells his friend that his “ideal wife” would be plain, quiet, and submissive; and he says that if met such a woman, he’d marry her straight away. It’s all sort of a joke, of course, but it’s very evident Miles is not interested in any kind of “managing” women in his life anymore. Which is very understandable.Anyway, Miles arrives home and is informed he has a poor distant relation named Abigail Gardiner waiting for him. He meets Miss Gardiner, and realizes right away she’s the spitting image of his “ideal wife!” So he does what anyone would do in the situation, he proposes on the spot. Abigail, not being a stupid woman, realizes she’d be insane to pass up on a chance to become a countess, and boom: Miles and Abigail get married two days later.Except we have one teensy problem: Abigail is not actually Miles’ “ideal wife.” Not even close. She talks nonstop, isn’t the least bit shy, is impetuous, silly, has a zany sense of humor, and has a lot of opinions. Oh, and she’s not nearly as plain-looking as Miles originally though. Oh dear.The good news is: Miles fucking loves Abigail even though she’s not what he signed up for! Like, he’s nuts about her. Absolutely besotted. At some point he realizes that he’s accidentally married a woman who’s the exact opposite of what he thought he wanted, but he’s not bothered at all. Instead, he has boatloads of fun with his new countess and everything seems to be going swimmingly, right off the bat.I can tell you now, this is not how I expected The Ideal Wife to go. If a romance author were writing this book today, there would be a lot of conflict and angst over Abigail’s personality not meeting Miles’ expectations. He’d feel deceived, they’d have a fight, they’d prepare to separate, then there would be groveling and a sweeping declaration of love at the end. That’s the standard plot. But Mary Balogh has always been a different sort of author, even way back in 1991. This is why she’s manages to be a bestseller for over 30 years.The reason I loved this book was that it dealt forthrightly and honestly with any issues as they arose. For instance, Miles and Abigail don’t have great sex on their wedding night. And they don’t have splendid sex the next night, either. Or the next. They’re two strangers, Regency-era wives weren’t expected to enjoy sex, and there’s always a learning curve with a new partner no matter what century it is. Our couple gets the hang of it eventually, of course. But do you know how rare it is to read a scene where the main characters have mediocre sex? That was so truthful and refreshing and I just...ahhhh!I also love Abigail and how Balogh handled her throughout the novel. For one thing, nobody ever shames her for being a somewhat silly chatterbox who tells outrageous jokes. That’s just who Abigail is, and everyone takes her as they find her. Even Miles. And while, yes, Miles thought he wanted a particular kind of woman for a wife, he immediately admits that what he thought he wanted never would have worked out for him, and instead he allows himself to be charmed by his slightly more unconventional bride.But then you might ask: so where is the conflict in this book???And, alas, I would have to tell you that the conflict in The Ideal Wife comes from Abigail having a Big Secret that she must hide from Miles at all costs, and which looms over the entire novel like a big stormcloud. Yeah, I know. It’s not my favorite trope, either. Especially since Miles obviously doesn’t give a fig about Abigail’s Shameful Past at all. He loves her! He thinks she’s great the way she is, problems and all. Silly Abigail.I understand that Balogh needed to have some kind of obstacle that had to be overcome before her couple could get their Happily Ever After. I don’t even think, in this instance, the Big Secret trope was out of place. Miles marries Abigail practically the second he meets her, and it would only follow that she has some issues that she’d need to explain to him that she’d be worried he might not like. I just think the secret was dragged out too long in this book, until the reader becomes almost frustrated with Abigail and begins to dislike her (slightly).But, overall? The Ideal Wife is splendid! It’s lighthearted but also realistic, and I think that’s something that’s difficult to find in Regency romances. Most novels in this genre are either dark and realistic or fluffy and somewhat lacking in substance. Here, Balogh bridges the gap between the two extremes and greats a feel-good love story that still has a ring of truth to it. I loved this.📌 . Blog | Review Database | Twitter | Instagram | Goodreads"],
          "_version_":1718999207393624064},
        {
          "id":"792520",
          "name":["Parish Priest: Father Michael McGivney and American Catholicism"],
          "ISBN":"0060853484",
          "rating":[3.97],
          "publishYear":[2006],
          "publishMonth":[24],
          "publishDay":[1],
          "publisher":["WmMorrow"],
          "countsOfReviews":[0],
          "pagesNumber":[320],
          "description":["In Father Michael McGivney (1852-1890), born and raised in a Connecticut factory town, the modern era's ideal of the priesthood hit its zenith. The son of Irish immigrants, he was a man to whom \"family values\" represented more than mere rhetoric. And he left a legacy of hope still celebrated around the world.In 1882, Father McGivney founded the Knights of Columbus, an organization that has helped to save countless families from the indignity of destitution. From its uncertain beginnings, when Father McGivney was the only person willing to work toward its success, it has grown to an international membership of 1.7 million men.At heart, though, Father McGivney was never anything more than an American parish priest, and nothing less than that, either -- beloved by children, trusted by young adults, and regarded as a \"positive saint\" by the elderly in his New Haven parish.Moving and inspirational, Parish Priest re-creates the life of Father McGivney, a fiercely dynamic and yet tenderhearted man, and chronicles the process of canonization that may well make Father McGivney the first American-born parish priest to be declared a saint by the Vatican."],
          "author":["Douglas Brinkley"],
          "language":["English"],
          "genres":["Biography",
            "Catholic",
            "History",
            "Religion"],
          "reviews":["In the latter part of the 1800s, an anti-Catholic and anti-immigrant attitude prevailed in America. In the midst of this setting in Connecticut was a young, caring Catholic priest. His concern for widows and orphans led him to form a fraternal organization of Catholic men to aid widows and orphans. This is the story of Father McGivney's short life and the beginning of the Knights of Columbus, the world's largest Catholic organization today. Father McGivney is undergoing the path to be declared a saint. In this day and age of wayward religious, it is good to read about a priest or other religious from any faith who tried to walk in Christ's footsteps.",
            "This book does a great job of laying out the life of a parish priest in America. It also gives a lot of great information about the founding of the Knights of Columbus which is a Catholic fraternal order focused on charity, unity, fraternity, and patriotism that supports church and family.Highly recommended.",
            "“His life, however, was not described by great occasions or grand gestures. His was the humility of moments, and the power beheld in the lightest of touches” (202). These lines at the end of this great book describe the life of Father Michael McGivney but may make some wonder why there is a biography of him. McGivney is the founder of the Knights of Columbus, a group for men in the Catholic Church which today numbers nearly 2 million men. But the authors don’t focus so much on that aspect as they use McGivney as an example of American Catholicism in the 19th century. More importantly, they give us insight in the role of the parish priest.They bring alive the Connecticut atmosphere and connect it with the overall status of priests at the time to give a sense of what life would be like for these servants of God. While it makes no claims to be an overview of all American Catholicism during that time period, the book shows what it was like in the established East Coast and, surprisingly, recognizes the demands that parish priests face today.McGivney becomes a priest after some of the more violent actions toward Catholics have subsided in the U.S., but prejudice against him because of his faith is something he shares with all his parishioners. In addition, we see how the Irish Catholics supplement the shortage of priests by importing priests from their homeland. McGivney is American born and goes through an educational process similar to today when a diocese directs their future priests to certain seminaries. It is this mix of Irish priests trying to connect with a more diverse parish that pushes McGivney from a quiet priest to one determined to meet people where they live. Before this priests were expected to spend most of their time on church grounds, but McGivney and others realize they need to reach out to people.Right out of seminary he is put into a church with an ailing head priest and a mountain of debt, which he works at reducing but will never fully succeed at doing. The ailing priest is not an old priest, just another worn-out priest. The authors note that over a 12-year span the Hartford diocese had 83 priests. During the same time, 70 priests died, creating an 85% turnover rate. Why? While priests were exposed to more disease than most, they were also greatly overworked and had little, if any, time off. The authors note that most priests knew they would not live to be 50 years old, but to be fair we have to realize the average lifespan at that time was around 42 years. McGivney had just turned 38 when he died. Yet in the midst of all that, McGivney started yet another project with the Knights of Columbus.Men’s groups were very popular during this time and many of them contributed funds in an early version of life insurance for widows and children. McGivney saw that many Catholic men were becoming more involved in these groups than the church, so he created the Knights as a way to offer a group that followed Catholic teaching yet created the same benefits for its members. In this, he was more successful than he would ever realize. Here I would like the authors to spend more time on this history because what is presented is so negative it is a surprise the Knights survived. Clearly, we are missing something.There is now an official process underway for McGivney to be considered for sainthood. Since the book was published in 2006, Pope Benedict XVI declared McGivney “Venerable” in 2008. Catholics may now seek his intercession in prayers and if a miracle is attributed to him, he moves on to be called “Blessed.” This can be a long process, but if it occurs he would be the first American-born parish priest to be canonized.Whether he is canonized or not (and the book takes no stand on that) McGivney is a priest worth reading about and this book is an excellent look into his life and American Catholicism in the late 19th century. If you are interested, you can visit the Knights of Columbus site to learn more about the group McGivney founded.",
            "It's remarkable that today we seem to think the only way someone can be discriminated against is by the color of their skin. As a Franco-American raised Catholic, I've long been interested in its other forms. Part of the history behind this diverging avenue can be found among the many and well-publicized Irish immigrants who came to America in the 1800s, who were also by and large Catholics. This book explores perhaps the most famous continuing legacy of those times (other than the presidency of JFK), the Knights of Columbus, and the man who founded them, Father Michael McGivney.It's not the subject matter I'm rating low, by any means. It's the fact that Douglas Brinkley and Julie Fenster seem to have taken for granted that their subject matter would probably not attract an audience far beyond Catholics or Knights. Their depth of insight into the times is acceptable, but in trying to tell McGivney's story with an apparent scant personal record (despite referencing a 700 page document of his activities), they generalize just about every topic they touch. The impression is that they stretch an article into a book.Personally, I find this kind of history lacking. If you have to spend time filling in blanks with background material from other sources, leave your conjecture to its proper place, limited to introduction and epilogue. And if you find conclusions that can easily be drawn from the material, which can be found throughout this book but never hazarded, then make them.It's a good book, all considered, for shedding light on a particular aspect of Catholic history, and perhaps later someone will come along and truly do the subject justice. This was the first McGivney biography. It proves there's fruitful material. It also proves that timidity is probably not something that ought to be associated with this man.",
            " This was a well written account of the life of Father Michael McGivney using limited documentation. The bio information was sparse and the authors filled in with the history of the Catholic Church in Connecticut and New England in general. The founding of the Knights of Columbus was covered well as it is essential to the ongoing legacy of the life of Father McGivney. If you have an expectation of a full biography you will be disappointed. If you temper your expectations to a more general coverage of Father McGivney and Catholicism in Connecticut, you will be pleased. A bit more on the expansion of the Knights of Columbus and Father McGivney's shadow role would have been welcome, although with limited documentation to validate it, it would have been conjecture.",
            "This is a biography of a man I had never heard of before, Father Michael McGivney, the founder of the Knights of Columbus. As the son of a Lutheran minister, I find myself sympathetic to finding out about the lives of people who choose the ministry as an occupation. Using mainly newspaper articles, the authors recreate the life of this parish priest from Connecticut until his death in 1890 at the age of 38. I found their discussion on Catholicism's place in the America of the late 1800s to be very interesting, as well the retelling of Father McGivney's life story. His involvement in founding the Knights of Columbus meant very little to me, but the book gives a good sense of this good and kind man and the times in which he lived. ",
            "Really good book. Author used some vocabulary that was hard to understand and I had to look up to know what he was saying - it could have been said in simpler words to make reading more accessible to everyone. I have a master's degree and read hundreds of books each year and still had to find out what some words meant. I was interested in the story because I am Catholic and I work at an organization that was started by the Knights of Columbus so I wanted to know more about their founder, Fr. McGivney",
            "Father Michael McGivney was a revolutionary priest. Douglas Brinkley wrote an excellent biography and it was a pleasure to read. The book was quick read, and I enjoyed every section. I was astounded by the work of the Irish Catholics and their contribution to American Catholicism in the 1850s. If you are Irish and Catholic, I think you would be surprised of how much of a legacy your history has in America. Overall, I rank the book 4 out of 5 and it should take a great reader about 4 days to ready it. "],
          "_version_":1718999206791741440}]
    }}